bad_cast
io_blksize
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
full_read
safe_read
__errno_location
bytes_split
full_read
STRING
__errno_location
error
\"%s\"
cwrite
cwrite
lines_split
full_read
STRING
__errno_location
error
\"%s\"
memchr
cwrite
cwrite
full_write
safe_write
__errno_location
line_bytes_split
xmalloc
full_read
STRING
__errno_location
error
\"%s\"
cwrite
memmove
free
is_basic
is_basic_table
strnlen1
memchr
proper_name_utf8
gettext
locale_charset
xstr_iconv
STRING
strlen
xmalloc
memcpy
memcpy
STRING
xstr_iconv
STRING
free
free
strchr
c_strcasecmp
STRING
free
free
free
free
strlen
strlen
xmalloc
sprintf
\"%s (%s)\"
free
free
mbsstr_trimmed_wordbounded
mbsstr_trimmed_wordbounded
mbsstr_trimmed_wordbounded
strcmp
is_basic_0
is_basic_table
version_etc_ar
version_etc_arn
version_etc_va
version_etc_arn
xstr_cd_iconv
str_cd_iconv
xalloc_die
__errno_location
quotearg_char_mem
default_quoting_options
qword_20E108
qword_20E110
qword_20E118
qword_20E120
qword_20E128
qword_20E130
set_char_quoting
quotearg_n_options
xstr_iconv
str_iconv
xalloc_die
__errno_location
bkm_scale
bkm_scale_by_power
bkm_scale
set_quoting_flags
default_quoting_options
quote_n
quotearg_n_style
x2nrealloc
xalloc_die
xrealloc
last_component
open_safer
open
fd_safer
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
quote
quote_n
set_char_quoting
default_quoting_options
quoting_options_from_style
memset
str_iconv
iconv_open
str_cd_iconv
__errno_location
free
__errno_location
iconv_close
__errno_location
iconv_close
__errno_location
strdup
__errno_location
c_strcasecmp
quotearg_custom
quotearg_n_custom
set_quoting_style
default_quoting_options
quotearg
quotearg_n
bkm_scale_0
mbslen
strlen
__ctype_get_mb_cur_max
memset
mbuiter_multi_next_1
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_20E038
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_mem
quotearg_n_mem
gettext_quote
gettext
L\"\\\"`'\"
knuth_morris_pratt_unibyte
strlen
mmalloca
freea
compile_regex
folded_chars
ignore_case
strlen
rpl_re_compile_pattern
quote
gettext
\"%s (for regexp %s)\"
error
rpl_re_compile_fastmap
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
xcharalloc
xmalloc
quotearg_style_mem
quotearg_n_style_mem
quotearg_n_style
quoting_options_from_style
quotearg_n_options
quotearg_colon
quotearg_char
quotearg_style
quotearg_n_style
xnrealloc
xalloc_die
xrealloc
quotearg_char
quotearg_char_mem
fd_reopen
open
dup2
__errno_location
close
__errno_location
swallow_file_in_memory
strcmp
\"-\"
fstat
open
__errno_location
error
\"%s\"
fstat
__errno_location
error
\"%s\"
xmalloc
read
__errno_location
error
\"%s\"
xmalloc
read
xrealloc
__errno_location
error
\"%s\"
__errno_location
error
\"%s\"
close
locale_charset
nl_langinfo
unk_B60E
get_charset_aliases
strlen
strlen
strcmp
strlen
STRING
fix_output_parameters
reference_max_width
file_line_count
file_line_count
sprintf
\"%d\"
strlen
strlen
input_file_name
input_file_name
reference_max_width
reference_max_width
number_input_files
STRING
xmalloc
reference_max_width
auto_reference
line_width
reference_max_width
gap_size
auto_reference
input_reference
right_reference
half_line_width
line_width
before_max_width
line_width
gap_size
keyafter_max_width
line_width
truncation_string_length
strlen
STRING
STRING
STRING
STRING
before_max_width
truncation_string_length
before_max_width
before_max_width
keyafter_max_width
truncation_string_length
keyafter_max_width
truncation_string_length
gnu_extensions
edited_flag
__ctype_b_loc
byte_2296CC
byte_2296E2
STRING
edited_flag
to_uchar
edited_flag
diacrit_diac
output_format
output_format
output_format
umaxtostr
c_tolower
is_basic_0
is_basic_table
mmalloca
malloc
mmalloca_results
mmalloca_results
is_basic_1
is_basic_table
c_toupper
argmatch_valid
gettext
\"Valid arguments are:\"
fprintf
stderr
fprintf
stderr
\", `%s'\"
fprintf
stderr
\"\\n  - `%s'\"
memcmp
putc_unlocked
stderr
version_etc_va
version_etc_arn
is_basic_2
is_basic_table
freea
mmalloca_results
free
set_quoting_style
default_quoting_options
__xargmatch_internal
argmatch
argmatch_invalid
argmatch_valid
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
mem_cd_iconv
iconv
iconv
__errno_location
__errno_location
iconv
malloc
__errno_location
iconv
iconv
__errno_location
iconv
abort
__errno_location
free
__errno_location
set_quoting_flags
default_quoting_options
rpl_fcntl
fcntl
rpl_fcntl
fcntl
rpl_fcntl
have_dupfd_cloexec_2895
have_dupfd_cloexec_2895
__errno_location
have_dupfd_cloexec_2895
fcntl
__errno_location
close
__errno_location
fcntl
have_dupfd_cloexec_2895
freopen_safer
fileno
dup2
dup2
dup2
freopen
protect_fd
protect_fd
protect_fd
__errno_location
close
close
close
__errno_location
compare_occurs
compare_words
gettext_quote
gettext
L\"\\\"`'\"
search_table
compare_words
digest_word_file
swallow_file_in_memory
xalloc_die
xrealloc
qsort
compare_words
quotearg_mem
quotearg_n_mem
digest_break_file
swallow_file_in_memory
memset
word_fastmap
word_fastmap
to_uchar
byte_229540
byte_229529
byte_22952A
gnu_extensions
free
quotearg_style
quotearg_n_style
strnlen1
memchr
quotearg_style_mem
quotearg_n_style_mem
version_etc_ar
version_etc_arn
quotearg_colon
quotearg_char
xstr_cd_iconv
str_cd_iconv
xalloc_die
__errno_location
output_one_tex_line
printf
\"\\\\%s \"
macro_name
putchar_unlocked
print_field
tail
qword_2297D8
fwrite_unlocked
off_23078
stdout
print_field
before
qword_2297F8
fwrite_unlocked
off_23078
stdout
keyafter
qword_229818
keyafter
rpl_re_match
unk_229288
keyafter
qword_229818
keyafter
matcher_error
qword_229818
word_fastmap
to_uchar
word_fastmap
to_uchar
keyafter
word_regex
print_field
fwrite_unlocked
off_23078
stdout
print_field
fwrite_unlocked
off_23078
stdout
print_field
head
qword_229838
putchar_unlocked
putchar_unlocked
print_field
STRING
qword_229858
putchar_unlocked
auto_reference
input_reference
putchar_unlocked
generate_all_output
tail
qword_2297D8
tail_truncation
head
qword_229838
head_truncation
occurs_table
number_of_occurs
number_of_occurs
define_all_fields
output_one_roff_line
output_one_dumb_line
output_one_tex_line
output_format
output_format
output_format
bitset_set
argmatch
strlen
strlen
memcmp
strncmp
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_229058
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
xstr_iconv
str_iconv
xalloc_die
__errno_location
is_basic
is_basic_table
bitset_set_all
memset
quote_n
quotearg_n_style
argmatch_invalid
gettext
\"invalid argument %s for %s\"
gettext
\"ambiguous argument %s for %s\"
quote_n
quotearg_n_style
error
re_string_skip_chars
mbrtowc
proper_name_utf8
gettext
locale_charset
xstr_iconv
STRING
strlen
xmalloc
memcpy
memcpy
STRING
xstr_iconv
STRING
free
free
strchr
c_strcasecmp
STRING
free
free
free
free
strlen
strlen
xmalloc
sprintf
\"%s (%s)\"
free
free
mbsstr_trimmed_wordbounded
mbsstr_trimmed_wordbounded
mbsstr_trimmed_wordbounded
strcmp
re_string_wchar_at
quote
quote_n
argmatch_to_argument
memcmp
re_string_context_at
bitset_contain
iswalnum
last_component
set_char_quoting
default_quoting_options
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
re_string_realloc_buffers
realloc
realloc
realloc
re_node_set_contains
quoting_options_from_style
memset
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
quotearg_custom_mem
quotearg_n_custom_mem
rpl_re_compile_pattern
rpl_re_syntax_options
re_compile_internal
rpl_re_syntax_options
gettext
\"Success\"
_re_error_msgid_idx
quotearg
quotearg_n
re_string_peek_byte_case
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
re_node_set_insert_last
realloc
bitset_contain
rpl_regerror
abort
gettext
\"Success\"
_re_error_msgid_idx
strlen
memcpy
quotearg_n_style
quoting_options_from_style
quotearg_n_options
quotearg_char
quotearg_char_mem
bitset_mask
re_node_set_remove_at
quotearg_custom
quotearg_n_custom
quotearg_char_mem
default_quoting_options
qword_229888
qword_229890
qword_229898
qword_2298A0
qword_2298A8
qword_2298B0
set_char_quoting
quotearg_n_options
init_dfa
memset
malloc
calloc
__ctype_get_mb_cur_max
nl_langinfo
strcasecmp
\"UTF-8\"
strcasecmp
\"UTF8\"
utf8_sb_map
calloc
btowc
re_string_construct
memset
re_string_construct_common
re_string_realloc_buffers
re_string_translate_buffer
build_wcs_buffer
build_upper_buffer
build_wcs_upper_buffer
re_string_realloc_buffers
bitset_empty
memset
bitset_clear
create_ci_newstate
calloc
free
free_state
register_state
re_node_set_init_copy
duplicate_node
re_dfa_add_node
re_string_destruct
free
free
free
bitset_merge
re_string_char_size_at
re_node_set_alloc
malloc
parse_reg_exp
parse_branch
fetch_token
parse_branch
create_tree
optimize_subexps
re_string_allocate
re_string_construct_common
re_string_realloc_buffers
re_string_construct_common
re_node_set_init_2
malloc
parse_bracket_symbol
re_string_fetch_byte_case
link_nfa_nodes
__assert_fail
\"node->next == NULL\"
\"regcomp.c\"
\"link_nfa_nodes\"
re_node_set_init_1
re_node_set_init_1
__assert_fail
\"REG_VALID_INDEX (left)\"
\"regcomp.c\"
\"link_nfa_nodes\"
__assert_fail
\"REG_VALID_INDEX (right)\"
\"regcomp.c\"
\"link_nfa_nodes\"
re_node_set_init_2
__assert_fail
\"!IS_EPSILON_NODE (node->token.type)\"
\"regcomp.c\"
\"link_nfa_nodes\"
re_string_fetch_byte_case
re_string_char_size_at
re_node_set_init_1
malloc
re_node_set_compare
free_token
free
free_charset
build_collating_symbol
strlen
bitset_set
calc_state_hash
re_node_set_init_copy
malloc
memcpy
memset
rpl_re_search_2
re_search_2_stub
re_acquire_state
calc_state_hash
re_node_set_compare
create_ci_newstate
rpl_re_set_registers
parse_bracket_element
re_string_char_size_at
parse_bracket_symbol
peek_token_bracket
re_string_wchar_at
register_state
re_node_set_alloc
re_node_set_insert_last
realloc
re_node_set_insert
re_node_set_init_1
realloc
rpl_re_set_syntax
rpl_re_syntax_options
rpl_re_syntax_options
check_halt_node_context
mark_opt_subexp
free_workarea_compile
free
free
re_acquire_state_context
calc_state_hash
re_node_set_compare
create_cd_newstate
rpl_re_match
re_search_stub
rpl_re_compile_fastmap
memset
re_compile_fastmap_iter
re_compile_fastmap_iter
re_compile_fastmap_iter
re_compile_fastmap_iter
update_regs
memcpy
memcpy
lower_subexps
lower_subexp
lower_subexp
rpl_re_search
re_search_stub
free_dfa_content
free_token
free
free
free
free
free
free
free
free
free_state
free
free
free
utf8_sb_map
free
free
postorder
add_epsilon_src_nodes
re_acquire_state
re_node_set_alloc
re_node_set_merge
re_node_set_add_intersect
calc_next
rpl_re_match_2
re_search_2_stub
search_duplicated_node
sift_states_iter_mb
check_node_accept_bytes
re_node_set_contains
lower_subexp
create_tree
create_tree
create_tree
create_tree
calc_eclosure
calc_eclosure_iter
free
calc_inveclosure
memset
re_node_set_insert_last
re_search_2_stub
malloc
memcpy
memcpy
re_search_stub
re_search_stub
re_search_stub
free
find_recover_state
merge_state_with_log
parse_branch
parse_expression
parse_expression
create_tree
peek_token_bracket
parse
fetch_token
parse_reg_exp
create_tree
create_tree
pop_fail_stack
__assert_fail
\"REG_VALID_INDEX (num)\"
\"regexec.c\"
\"pop_fail_stack\"
memcpy
free
free
build_equiv_class
strlen
bitset_set
check_subexp_matching_top
match_ctx_add_subtop
fetch_number
fetch_token
parse_sub_exp
fetch_token
parse_reg_exp
create_tree
build_sifted_states
sift_states_iter_mb
check_node_accept
re_node_set_contains
check_dst_limits
re_node_set_insert
build_charclass_op
calloc
calloc
build_charclass
free
free_charset
bitset_set
bitset_not
bitset_mask
create_token_tree
free_charset
create_token_tree
create_tree
free
free_charset
check_arrival_expand_ecl_sub
re_node_set_contains
re_node_set_contains
re_node_set_insert
re_node_set_insert
check_arrival_expand_ecl_sub
duplicate_tree
create_token_tree
create_tree
create_token_tree
check_dst_limits_calc_pos_1
check_dst_limits_calc_pos_1
prune_impossible_nodes
malloc
malloc
memset
sift_ctx_init
sift_states_backward
free
merge_state_array
free
check_halt_state_context
sift_ctx_init
sift_states_backward
free
free
free
free
match_ctx_clean
free
free
free
free
free
free
check_halt_state_context
re_string_context_at
check_halt_node_context
find_subexp_node
create_token_tree
malloc
xnrealloc
xalloc_die
xrealloc
clean_state_log_if_needed
extend_buffers
memset
free_fail_stack_return
free
free
free
push_fail_stack
realloc
malloc
memcpy
re_node_set_init_copy
check_node_accept
bitset_contain
re_string_context_at
xcharalloc
xmalloc
_sub_epsilon_src_nodes
memset
re_node_set_add_intersect
free
re_node_set_contains
re_node_set_contains
re_node_set_contains
re_node_set_contains
re_node_set_contains
re_node_set_remove_at
re_node_set_contains
free
sift_states_backward
re_node_set_init_1
update_cur_sifted_state
memset
free
update_cur_sifted_state
build_sifted_states
free
merge_state_array
re_node_set_init_union
re_acquire_state
free
bkm_scale
search_cur_bkref_entry
get_subexp_sub
check_arrival
match_ctx_add_entry
clean_state_log_if_needed
update_cur_sifted_state
add_epsilon_src_nodes
check_subexp_limits
re_acquire_state
sift_states_bkref
is_basic_1
is_basic_table
locale_charset
nl_langinfo
unk_24D6E
get_charset_aliases
strlen
strlen
strcmp
strlen
STRING
check_dst_limits
search_cur_bkref_entry
search_cur_bkref_entry
check_dst_limits_calc_pos
check_dst_limits_calc_pos
check_arrival_expand_ecl
re_node_set_alloc
re_node_set_merge
check_arrival_expand_ecl_sub
free
find_subexp_node
free
c_toupper
transit_state
transit_state_mb
build_trtable
re_string_context_at
str_iconv
iconv_open
str_cd_iconv
__errno_location
free
__errno_location
iconv_close
__errno_location
iconv_close
__errno_location
strdup
__errno_location
c_strcasecmp
check_dst_limits_calc_pos
check_dst_limits_calc_pos_1
match_ctx_init
malloc
malloc
freea
mmalloca_results
free
is_basic_2
is_basic_table
check_arrival_add_next_nodes
memset
check_node_accept_bytes
re_node_set_merge
re_node_set_insert
re_acquire_state
free
free
check_node_accept
re_node_set_insert
free
match_ctx_add_subtop
realloc
calloc
merge_state_with_log
re_node_set_init_union
re_string_context_at
re_acquire_state_context
free
check_subexp_matching_top
transit_state_bkref
mbslen
strlen
__ctype_get_mb_cur_max
memset
mbuiter_multi_next_1
scan_arg
gettext
\"invalid floating point argument: %s\"
error
usage
xstrtold
c_strtold
__ctype_b_loc
to_uchar
strlen
strchr
strcspn
\"eE\"
strchr
strchr
strtol
strcspn
\"xX\"
c_tolower
match_ctx_free
match_ctx_clean
free
free
extend_buffers
re_string_realloc_buffers
realloc
build_upper_buffer
build_wcs_upper_buffer
re_string_translate_buffer
build_wcs_buffer
get_default_format
sprintf
STRING
\"%%.%dLf\"
STRING
equal_width
sprintf
STRING
\"%%0%d.%dLf\"
STRING
STRING
quotearg
quotearg_n
mmalloca
malloc
mmalloca_results
mmalloca_results
match_ctx_add_sublast
realloc
calloc
sift_ctx_init
memset
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
quotearg_mem
quotearg_n_mem
set_quoting_flags
default_quoting_options
x2nrealloc
xalloc_die
xrealloc
version_etc_ar
version_etc_arn
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
c_strtold
c_locale
strtold_l
mem_cd_iconv
iconv
iconv
__errno_location
__errno_location
iconv
malloc
__errno_location
iconv
iconv
__errno_location
iconv
abort
__errno_location
free
__errno_location
quote_n
quotearg_n_style
quotearg_char_mem
default_quoting_options
qword_20D0E8
qword_20D0F0
qword_20D0F8
qword_20D100
qword_20D108
qword_20D110
set_char_quoting
quotearg_n_options
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
knuth_morris_pratt_unibyte
strlen
mmalloca
freea
last_component
quote
quote_n
xsum
x2nrealloc
xalloc_die
xrealloc
set_quoting_style
default_quoting_options
version_etc_va
version_etc_arn
decimal_point_char
nl_langinfo
set_char_quoting
default_quoting_options
rpl_isnanl
quoting_options_from_style
memset
gettext_quote
gettext
L\"\\\"`'\"
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
quotearg_style
quotearg_n_style
quotearg_n_style
quoting_options_from_style
quotearg_n_options
do_decode
base64_decode_ctx_init
fread_unlocked
memmove
isbase64
gettext
\"read error\"
__errno_location
error
ferror_unlocked
feof_unlocked
feof_unlocked
base64_decode_ctx
fwrite_unlocked
gettext
\"write error\"
__errno_location
error
gettext
\"invalid input\"
error
feof_unlocked
quotearg_char
quotearg_char_mem
quotearg_style_mem
quotearg_n_style_mem
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_20D028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
base64_encode
to_uchar
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
to_uchar
to_uchar
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
to_uchar
to_uchar
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
to_uchar
version_etc_ar
version_etc_arn
quotearg_custom
quotearg_n_custom
quotearg_colon
quotearg_char
decode_4
isbase64
isbase64
b64
to_uchar
b64
to_uchar
isbase64
b64
to_uchar
b64
to_uchar
isbase64
b64
to_uchar
b64
to_uchar
base64_decode_alloc_ctx
malloc
free
base64_decode_ctx
xnrealloc
xalloc_die
xrealloc
quotearg_custom_mem
quotearg_n_custom_mem
version_etc_va
version_etc_arn
gettext_quote
gettext
L\"\\\"`'\"
last_component
xcharalloc
xmalloc
rpl_vasprintf
vasnprintf
free
__errno_location
set_char_quoting
default_quoting_options
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
set_quoting_flags
default_quoting_options
xstrtold
__errno_location
__errno_location
xmax
quotearg
quotearg_n
xcharalloc
xmalloc
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
xsum_0
wrap_write
gettext
\"write error\"
__errno_location
error
fwrite_unlocked
stdout
gettext
\"write error\"
__errno_location
error
fputs_unlocked
\"\\n\"
gettext
\"write error\"
__errno_location
error
fwrite_unlocked
stdout
quotearg_mem
quotearg_n_mem
list_signals
strlen
sig2str
operand2sig
print_table_row
print_table_row
sig2str
operand2sig
printf
\"%d\\n\"
puts
puts
sig2str
quotearg_style_mem
quotearg_n_style_mem
base64_encode_alloc
malloc
base64_encode
do_encode
fread_unlocked
feof_unlocked
ferror_unlocked
base64_encode
wrap_write
feof_unlocked
ferror_unlocked
gettext
\"write error\"
__errno_location
error
fputs_unlocked
\"\\n\"
gettext
\"read error\"
__errno_location
error
ferror_unlocked
quotearg_n_style
quoting_options_from_style
quotearg_n_options
quotearg
quotearg_n
quotearg_colon
quotearg_char
base64_decode_ctx
decode_4
get_4
decode_4
isbase64
b64
to_uchar
quotearg_style
quotearg_n_style
quotearg_mem
quotearg_n_mem
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_n_style
quoting_options_from_style
quotearg_n_options
print_table_row
strsignal
STRING
printf
\"%*d %-*s %s\\n\"
quotearg_char
quotearg_char_mem
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_char_mem
default_quoting_options
qword_2080C8
qword_2080D0
qword_2080D8
qword_2080E0
qword_2080E8
qword_2080F0
set_char_quoting
quotearg_n_options
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_208028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
get_4
memchr
operand2sig
xstrdup
strchr
\"abcdefghijklmnopqrstuvwxyz\"
str2sig
str2sig
free
__errno_location
strtol
__errno_location
sig2str
gettext
\"%s: invalid signal\"
error
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
send_signals
__errno_location
strtoimax
gettext
\"%s: invalid process id\"
error
__errno_location
error
\"%s\"
kill
__errno_location
set_quoting_style
default_quoting_options
bkm_scale
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
argv_iter_init_stream
malloc
last_component
set_quoting_flags
default_quoting_options
bkm_scale_by_power
bkm_scale
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
version_etc_ar
version_etc_arn
set_char_quoting
default_quoting_options
gettext_quote
gettext
L\"\\\"`'\"
quote_n
quotearg_n_style
quotearg_custom
quotearg_n_custom
quote_n
quotearg_n_style
xcharalloc
xmalloc
quote
quote_n
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
quote
quote_n
is_basic
is_basic_table
quotearg_style_mem
quotearg_n_style_mem
set_quoting_style
default_quoting_options
quotearg_colon
quotearg_char
set_char_quoting
default_quoting_options
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_207028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
str2sig
str2signum
compute_number_width
quoting_options_from_style
memset
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_209028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
wc_file
open
__errno_location
error
\"%s\"
wc
close
have_read_stdin
wc
strcmp
\"-\"
last_component
write_counts
\" %*s\"
umaxtostr
printf
\" %*s\"
number_width
STRING
print_lines
umaxtostr
printf
number_width
STRING
print_words
umaxtostr
printf
number_width
STRING
print_chars
umaxtostr
printf
number_width
STRING
print_bytes
umaxtostr
printf
number_width
print_linelength
printf
\" %s\"
putchar_unlocked
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
argv_iter
feof
getdelim
quoting_options_from_style
memset
argv_iter_n_args
quotearg_char
quotearg_char_mem
quotearg_char
quotearg_char_mem
set_quoting_flags
default_quoting_options
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
quotearg_custom
quotearg_n_custom
version_etc_va
version_etc_arn
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_char
quotearg_char_mem
quotearg_custom
quotearg_n_custom
version_etc_ar
version_etc_arn
umaxtostr
xcharalloc
xmalloc
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_mem
quotearg_n_mem
last_component
version_etc_ar
version_etc_arn
quotearg_style
quotearg_n_style
AD_hash
version_etc_va
version_etc_arn
set_char_quoting
default_quoting_options
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
quotearg_style_mem
quotearg_n_style_mem
quoting_options_from_style
memset
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_206028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_char_mem
default_quoting_options
qword_209108
qword_209110
qword_209118
qword_209120
qword_209128
qword_209130
set_char_quoting
quotearg_n_options
quoting_options_from_style
memset
enter_dir
malloc
hash_insert
free
cycle_check
quotearg_style
quotearg_n_style
last_component
cwd_advance_fd
abort
i_ring_push
close
close
main
set_program_name
setlocale
shortopts
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
atexit
close_stdout
parse_long_options
STRING
STRING
STRING
usage
STRING
usage
getopt_long
shortopts
quote
optind
gettext
\"extra operand %s\"
error
usage
optind
geteuid
getpwuid
puts
exit
program_name
gettext
\"%s: cannot find name for user ID %lu\\n\"
fprintf
stderr
exit
quotearg_char_mem
default_quoting_options
qword_207288
qword_207290
qword_207298
qword_2072A0
qword_2072A8
qword_2072B0
set_char_quoting
quotearg_n_options
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
AD_compare
set_stat_type
gettext_quote
gettext
L\"\\\"`'\"
argv_iter_init_argv
malloc
setup_dir
hash_initialize
AD_hash
AD_compare
free
malloc
cycle_check_init
quotearg_mem
quotearg_n_mem
compute_context_from_mask
context_new
quote
specified_user
gettext
\"failed to set %s security context component to %s\"
__errno_location
error
STRING
specified_user
context_user_set
specified_user
quote
specified_range
gettext
\"failed to set %s security context component to %s\"
__errno_location
error
STRING
specified_range
context_range_set
specified_range
quote
specified_role
gettext
\"failed to set %s security context component to %s\"
__errno_location
error
STRING
specified_role
context_role_set
specified_role
quote
specified_type
gettext
\"failed to set %s security context component to %s\"
__errno_location
error
STRING
specified_type
context_type_set
specified_type
__errno_location
context_free
__errno_location
quotearg_colon
gettext
\"failed to create security context: %s\"
__errno_location
error
fts_padjust
LCO_hash
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
readtokens0_init
_obstack_begin
malloc
free
_obstack_begin
malloc
free
_obstack_begin
malloc
free
leaf_optimization_applies
fstatfs
LCO_compare
quotearg_style_mem
quotearg_n_style_mem
hash_lookup
abort
set_quoting_style
default_quoting_options
quotearg_colon
quotearg_char
next_prime
is_prime
link_count_optimize_ok
hash_initialize
LCO_hash
LCO_compare
free
hash_lookup
malloc
leaf_optimization_applies
hash_insert
abort
free
fts_set
__errno_location
quotearg_custom
quotearg_n_custom
gettext_quote
gettext
L\"\\\"`'\"
hash_initialize
raw_hasher
raw_comparator
malloc
default_tuning
free
check_tuning
compute_bucket_size
calloc
hash_get_n_buckets_used
xcharalloc
xmalloc
fts_compar
quotearg
quotearg_n
i_ring_empty
hash_table_ok
quotearg_n_style
quoting_options_from_style
quotearg_n_options
quotearg_colon
quotearg_char
quotearg_custom_mem
quotearg_n_custom_mem
version_etc_va
version_etc_arn
xnrealloc
xalloc_die
xrealloc
hash_do_for_each
i_ring_push
fts_sort
free
realloc
qsort
version_etc_ar
version_etc_arn
x2nrealloc
xalloc_die
xrealloc
openat_safer
openat
fd_safer
check_tuning
default_tuning
default_tuning
hash_get_entries
version_etc_va
version_etc_arn
quote_n
quotearg_n_style
set_quoting_flags
default_quoting_options
free_entry
raw_hasher
rotr_sz
quote
quote_n
free_dir
hash_free
free
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
set_quoting_style
default_quoting_options
allocate_entry
malloc
fts_set_stat_required
abort
quotearg_n_style
quoting_options_from_style
quotearg_n_options
set_quoting_flags
default_quoting_options
transfer_entries
abort
free_entry
abort
allocate_entry
diropen
openat_safer
open_safer
set_cloexec_flag
quotearg
quotearg_n
hash_find_entry
abort
free_entry
free_entry
quotearg_char_mem
default_quoting_options
qword_210108
qword_210110
qword_210118
qword_210120
qword_210128
qword_210130
set_char_quoting
quotearg_n_options
quotearg_n_style
quoting_options_from_style
quotearg_n_options
fts_compare_ino
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
quote_n
quotearg_n_style
quotearg_style
quotearg_n_style
fts_palloc
realloc
free
free
__errno_location
lsetfileconat
lsetfilecon
openat_proc_name
lsetfilecon
__errno_location
free
__errno_location
openat_save_fail
save_cwd
free_cwd
__errno_location
__errno_location
free_cwd
__errno_location
lsetfilecon
__errno_location
__errno_location
openat_restore_fail
restore_cwd
free_cwd
__errno_location
fchdir
__errno_location
quotearg_custom
quotearg_n_custom
set_quoting_style
default_quoting_options
quotearg_char_mem
default_quoting_options
qword_2060C8
qword_2060D0
qword_2060D8
qword_2060E0
qword_2060E8
qword_2060F0
set_char_quoting
quotearg_n_options
hash_print_statistics
hash_get_n_entries
hash_get_n_buckets
hash_get_n_buckets_used
hash_get_max_bucket_length
fprintf
\"# entries:         %lu\\n\"
fprintf
\"# buckets:         %lu\\n\"
fprintf
\"# buckets used:    %lu (%.2f%%)\\n\"
fprintf
\"max bucket length: %lu\\n\"
restore_cwd
chdir_long
fchdir
quoting_options_from_style
memset
getfileconat
getfilecon_0
openat_proc_name
getfilecon_0
__errno_location
free
__errno_location
openat_save_fail
save_cwd
free_cwd
__errno_location
__errno_location
free_cwd
__errno_location
getfilecon_0
__errno_location
__errno_location
openat_restore_fail
restore_cwd
free_cwd
__errno_location
fchdir
__errno_location
change_file_context
context_new
specified_context
abort
getfileconat
lgetfileconat
affect_symlink_referent
quote
gettext
\"failed to get security context of %s\"
__errno_location
error
__errno_location
quote
gettext
\"can't apply partial context to unlabeled file %s\"
error
compute_context_from_mask
specified_context
context_str
setfileconat
lsetfileconat
affect_symlink_referent
quote_n
quote_n
gettext
\"failed to change context of %s to %s\"
__errno_location
error
strcmp
context_free
freecon
compute_bucket_size
next_prime
quotearg
quotearg_n
bsd_sum_file
strcmp
\"-\"
fopen
\"r\"
stdin
have_read_stdin
getc_unlocked
stdin
getc_unlocked
__errno_location
error
\"%s\"
fclose
ferror_unlocked
__errno_location
error
\"%s\"
fclose
human_readable
printf
\"%05d %5s\"
printf
\" %s\"
putchar_unlocked
is_zero_or_power_of_two
leave_dir
hash_delete
abort
free
abort
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
hash_rehash
compute_bucket_size
calloc
free
abort
transfer_entries
transfer_entries
free
transfer_entries
set_quoting_flags
default_quoting_options
quotearg_char
quotearg_char_mem
rpl_fcntl
fcntl
rpl_fcntl
fcntl
rpl_fcntl
have_dupfd_cloexec_2895
have_dupfd_cloexec_2895
__errno_location
have_dupfd_cloexec_2895
fcntl
__errno_location
close
__errno_location
fcntl
have_dupfd_cloexec_2895
fts_maxarglen
strlen
gettext_quote
gettext
L\"\\\"`'\"
quotearg_custom_mem
quotearg_n_custom_mem
gettext_quote
gettext
L\"\\\"`'\"
last_component
hash_get_n_buckets
quotearg_mem
quotearg_n_mem
quotearg
quotearg_n
hash_get_n_entries
quotearg_style
quotearg_n_style
quotearg_mem
quotearg_n_mem
quotearg_style_mem
quotearg_n_style_mem
hash_get_max_bucket_length
group_number
strlen
memcpy
memcpy
memcpy
quotearg_colon
quotearg_char
lgetfileconat
lgetfilecon
openat_proc_name
lgetfilecon
__errno_location
free
__errno_location
openat_save_fail
save_cwd
free_cwd
__errno_location
__errno_location
free_cwd
__errno_location
lgetfilecon
__errno_location
__errno_location
openat_restore_fail
restore_cwd
free_cwd
__errno_location
fchdir
__errno_location
quotearg_n_style
quoting_options_from_style
quotearg_n_options
hash_get_first
abort
set_quoting_style
default_quoting_options
get_root_dev_ino
lstat
\"/\"
quotearg_style
quotearg_n_style
hash_string
cycle_check
__assert_fail
\"state->magic == CC_MAGIC\"
\"cycle-check.c\"
\"cycle_check\"
is_zero_or_power_of_two
quotearg_char_mem
default_quoting_options
qword_2080C8
qword_2080D0
qword_2080D8
qword_2080E0
qword_2080E8
qword_2080F0
set_char_quoting
quotearg_n_options
is_prime
quoting_options_from_style
memset
setfileconat
setfilecon
openat_proc_name
setfilecon
__errno_location
free
__errno_location
openat_save_fail
save_cwd
free_cwd
__errno_location
__errno_location
free_cwd
__errno_location
setfilecon
__errno_location
__errno_location
openat_restore_fail
restore_cwd
free_cwd
__errno_location
fchdir
__errno_location
cdb_fchdir
fchdir
argmatch_to_argument
memcmp
hash_free
free
free
free
free
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_208028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
cdb_free
close
__assert_fail
\"! close_fail\"
\"chdir-long.c\"
\"cdb_free\"
save_cwd
open_safer
STRING
xgetcwd
i_ring_pop
abort
i_ring_empty
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
open_safer
open
fd_safer
main
bsd_sum_file
set_program_name
setlocale
locale
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
atexit
close_stdout
setvbuf
stdout
have_read_stdin
getopt_long
\"rs\"
longopts
optind
optind
optind
optind
\"-\"
optind
__errno_location
error
\"-\"
fclose
stdin
have_read_stdin
exit
usage
bsd_sum_file
sysv_sum_file
version_etc
stdout
STRING
STRING
STRING
STRING
STRING
exit
usage
operand2sig
xstrdup
strchr
\"abcdefghijklmnopqrstuvwxyz\"
str2sig
str2sig
free
__errno_location
strtol
__errno_location
sig2str
gettext
\"%s: invalid signal\"
error
sysv_sum_file
strcmp
\"-\"
have_read_stdin
open
__errno_location
error
\"%s\"
safe_read
__errno_location
error
\"%s\"
close
__errno_location
error
\"%s\"
human_readable
printf
\"%d %s\"
printf
\" %s\"
putchar_unlocked
close
last_component
quote
quote_n
human_options
humblock
default_block_size
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
str2sig
str2signum
set_char_quoting
default_quoting_options
set_char_quoting
default_quoting_options
quoting_options_from_style
memset
quotearg_style_mem
quotearg_n_style_mem
bkm_scale
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg
quotearg_n
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_210028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_char
quotearg_char_mem
quotearg_mem
quotearg_n_mem
argmatch_invalid
gettext
\"invalid argument %s for %s\"
gettext
\"ambiguous argument %s for %s\"
quote_n
quotearg_n_style
error
knuth_morris_pratt_unibyte
strlen
mmalloca
freea
xcharalloc
xmalloc
quotearg_custom
quotearg_n_custom
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
__xargmatch_internal
argmatch
argmatch_invalid
argmatch_valid
xcharalloc
xmalloc
quotearg_style_mem
quotearg_n_style_mem
quote_n
quotearg_n_style
quotearg_char
quotearg_char_mem
cycle_warning_required
quotearg_colon
quotearg_char
send_sig
sigs_to_ignore
kill
bkm_scale_by_power
bkm_scale
set_char_quoting
default_quoting_options
quotearg_custom_mem
quotearg_n_custom_mem
set_cloexec_flag
rpl_fcntl
rpl_fcntl
proper_name_utf8
gettext
locale_charset
xstr_iconv
STRING
strlen
xmalloc
memcpy
memcpy
STRING
xstr_iconv
STRING
free
free
strchr
c_strcasecmp
STRING
free
free
free
free
strlen
strlen
xmalloc
sprintf
\"%s (%s)\"
free
free
mbsstr_trimmed_wordbounded
mbsstr_trimmed_wordbounded
mbsstr_trimmed_wordbounded
strcmp
quotearg
quotearg_n
x2nrealloc
xalloc_die
xrealloc
argmatch
strlen
strlen
memcmp
strncmp
quotearg_mem
quotearg_n_mem
free_cwd
close
free
quotearg_custom
quotearg_n_custom
quote
quote_n
quotearg_n_style
quoting_options_from_style
quotearg_n_options
str_iconv
iconv_open
str_cd_iconv
__errno_location
free
__errno_location
iconv_close
__errno_location
iconv_close
__errno_location
strdup
__errno_location
c_strcasecmp
apply_time_suffix
xnrealloc
xalloc_die
xrealloc
quotearg_style_mem
quotearg_n_style_mem
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
quotearg_colon
quotearg_char
xstr_cd_iconv
str_cd_iconv
xalloc_die
__errno_location
xcharalloc
xmalloc
mmalloca
malloc
mmalloca_results
mmalloca_results
version_etc_ar
version_etc_arn
xcharalloc
xmalloc
quote_n
quotearg_n_style
locale_charset
nl_langinfo
unk_A16E
get_charset_aliases
strlen
strlen
strcmp
strlen
STRING
mbslen
strlen
__ctype_get_mb_cur_max
memset
mbuiter_multi_next_1
quote
quote_n
quote
quote_n
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
version_etc_ar
version_etc_arn
version_etc_va
version_etc_arn
set_char_quoting
default_quoting_options
set_quoting_flags
default_quoting_options
set_quoting_flags
default_quoting_options
c_tolower
quotearg
quotearg_n
gettext_quote
gettext
L\"\\\"`'\"
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
default_block_size
getenv
\"POSIXLY_CORRECT\"
xcharalloc
xmalloc
quotearg_custom
quotearg_n_custom
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_20C038
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
c_toupper
version_etc_ar
version_etc_arn
version_etc_va
version_etc_arn
humblock
argmatch
STRING
block_size_opts
xstrtoumax
STRING
block_size_opts
default_block_size
getenv
\"BLOCK_SIZE\"
getenv
\"BLOCKSIZE\"
out_uint_o
printf
last_component
freea
mmalloca_results
free
version_etc_va
version_etc_arn
areadlink_with_size
malloc
malloc
readlink
__errno_location
free
__errno_location
__errno_location
free
__errno_location
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
is_basic_2
is_basic_table
last_component
file_type
gettext
\"regular file\"
gettext
\"regular empty file\"
gettext
\"directory\"
gettext
\"block special file\"
gettext
\"character special file\"
gettext
\"fifo\"
gettext
\"symbolic link\"
gettext
\"socket\"
gettext
\"weird file\"
mdir_name
dir_len
malloc
memcpy
dword_0
quotearg_colon
quotearg_char
quote_n
quotearg_n_style
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
quoting_options_from_style
memset
gettext_quote
gettext
L\"\\\"`'\"
quotearg_custom_mem
quotearg_n_custom_mem
set_quoting_style
default_quoting_options
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
quotearg_mem
quotearg_n_mem
bkm_scale
gettext_quote
gettext
L\"\\\"`'\"
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
argmatch_valid
gettext
\"Valid arguments are:\"
fprintf
stderr
fprintf
stderr
\", `%s'\"
fprintf
stderr
\"\\n  - `%s'\"
memcmp
putc_unlocked
stderr
quotearg_char_mem
default_quoting_options
qword_2060C8
qword_2060D0
qword_2060D8
qword_2060E0
qword_2060E8
qword_2060F0
set_char_quoting
quotearg_n_options
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_206028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_style_mem
quotearg_n_style_mem
is_basic
is_basic_table
dir_len
last_component
quotearg_char
quotearg_char_mem
quote_n
quotearg_n_style
quotearg_custom
quotearg_n_custom
strnlen1
memchr
quote
quote_n
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
is_basic_0
is_basic_table
memcpy_lowcase
tolower
xstr_iconv
str_iconv
xalloc_die
__errno_location
set_char_quoting
default_quoting_options
quotearg_n_style
quoting_options_from_style
quotearg_n_options
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
nstrftime
strftime_case_
set_quoting_style
default_quoting_options
quotearg_style_mem
quotearg_n_style_mem
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_206028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_char
quotearg_char_mem
set_quoting_flags
default_quoting_options
set_other_indent
first_indent
other_indent
first_indent
in_column
first_indent
other_indent
first_indent
first_indent
other_indent
other_indent
first_indent
in_column
other_indent
in_column
in_column
first_indent
first_indent
other_indent
first_indent
tagged
crown
split
quotearg_colon
quotearg_char
print_statfs
out_file_context
out_uint
human_fstype
out_string
out_int
out_int
out_uint
out_int
out_int
out_uint_x
out_uint
out_string
out_uint_x
fputc_unlocked
stdout
quotearg_custom
quotearg_n_custom
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
version_etc_va
version_etc_arn
get_prefix
in_column
getc_unlocked
get_space
next_prefix_indent
in_column
STRING
in_column
getc_unlocked
get_space
prefix_lead_space
in_column
in_column
prefix_lead_space
next_prefix_indent
prefix_length
filemodestring
strmode
strmode
ftypelet
quotearg_n_style
quoting_options_from_style
quotearg_n_options
version_etc_ar
version_etc_arn
imaxtostr
fmt_paragraph
word_limit
word_limit
word_limit
max_width
word_limit
first_indent
other_indent
unused_word_type
line_cost
last_line_length
last_line_length
unused_word_type
last_line_length
word_limit
max_width
base_cost
unused_word_type
word_limit
word_limit
quotearg_style
quotearg_n_style
get_stat_atime
quotearg_char_mem
default_quoting_options
qword_20C3E8
qword_20C3F0
qword_20C3F8
qword_20C400
qword_20C408
qword_20C410
set_char_quoting
quotearg_n_options
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
get_paragraph
last_line_length
next_char
get_prefix
next_char
copy_rest
putchar_unlocked
next_prefix_indent
prefix_lead_space
prefix_full_length
next_prefix_indent
in_column
prefix_indent
next_prefix_indent
first_indent
in_column
wptr
parabuf
word_limit
unused_word_type
get_line
same_para
set_other_indent
get_line
same_para
in_column
other_indent
same_para
get_line
same_para
in_column
other_indent
same_para
in_column
first_indent
get_line
same_para
in_column
other_indent
tagged
crown
split
word_limit
word_limit
word_limit
word_limit
next_char
get_stat_mtime
quotearg
quotearg_n
is_basic_1
is_basic_table
human_access
filemodestring
modebuf_5918
byte_20D0FA
modebuf_5918
version_etc_ar
version_etc_arn
quotearg_style_mem
quotearg_n_style_mem
quotearg_n_style
quoting_options_from_style
quotearg_n_options
out_string
printf
quotearg_char
quotearg_char_mem
quotearg_style
quotearg_n_style
out_int
printf
quotearg_custom
quotearg_n_custom
xcharalloc
xmalloc
out_uint_x
printf
quotearg_char_mem
default_quoting_options
qword_20D168
qword_20D170
qword_20D178
qword_20D180
qword_20D188
qword_20D190
