.free
free
.getenv
getenv
._exit
exit
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
.fclose
fclose
.__fpending
_fpending
.strlen
strlen
.textdomain
textdomain
.__xstat
_xstat
.close
close
.iswalnum
iswalnum
.malloc
malloc
.iconv_close
iconv_close
.nl_langinfo
nl_langinfo
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
.__fxstat
_fxstat
.iswspace
iswspace
.exit
exit
.__cxa_atexit
_cxa_atexit
.mbsinit
mbsinit
version_etc_va
version_etc_arn
.strdup
strdup
.iswprint
iswprint
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
set_quoting_style
default_quoting_options
default_quoting_options
strnlen1
memchr
proper_name
dcgettext
mbsstr_trimmed_wordbounded
strlen
strlen
xmalloc
__sprintf_chk
version_etc_ar
version_etc_arn
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
last_component
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s OPTION... FILE...\\n\"
__printf_chk
stdout
dcgettext
\"Shrink or extend the size of each FILE to the specified size\\n\\nA FILE argument that does not exist is created.\\n\\nIf a FILE is larger than the specified size, the extra data is lost.\\nIf a FILE is shorter, it is extended and the extended part (hole)\\nreads as zero bytes.\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"Mandatory arguments to long options are mandatory for short options too.\\n\"
fputs_unlocked
stdout
dcgettext
\"  -c, --no-create        do not create any files\\n\"
fputs_unlocked
stdout
dcgettext
\"  -o, --io-blocks        Treat SIZE as number of IO blocks instead of bytes\\n\"
fputs_unlocked
stdout
dcgettext
\"  -r, --reference=FILE   use this FILE's size\\n  -s, --size=SIZE        use this SIZE\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nSIZE may be (or may be an integer optionally followed by) one of following:\\nKB 1000, K 1024, MB 1000*1000, M 1024*1024, and so on for G, T, P, E, Z, Y.\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nSIZE may also be prefixed by one of the following modifying characters:\\n`+' extend by, `-' reduce by, `<' at most, `>' at least,\\n`/' round down to multiple of, `%' round up to multiple of.\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nNote that the -r and -s options are mutually exclusive.\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
quotearg_style
quotearg_n_style
version_etc
version_etc_arn
base_len
strlen
set_custom_quoting
default_quoting_options
default_quoting_options
abort
quote
quotearg_n_style
quotearg_style_mem
quotearg_n_style_mem
close_stdout_set_file_name
file_name
get_quoting_style
default_quoting_options
quotearg
quotearg_n_options
default_quoting_options
quotearg_char
quotearg_char_mem
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
close_stdout_set_ignore_EPIPE
ignore_EPIPE
set_char_quoting
default_quoting_options
quotearg_custom
quotearg_n_custom_mem
set_quoting_flags
default_quoting_options
quotearg_n_style
quotearg_n_options
quotearg_alloc
quotearg_alloc_mem
quote_n
quotearg_n_style
quotearg_colon
quotearg_char_mem
quotearg_mem
quotearg_n_options
default_quoting_options
xrealloc
realloc
xalloc_die
quotearg_custom_mem
quotearg_n_custom_mem
xcalloc
calloc
xalloc_die
xmalloc
malloc
xalloc_die
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
quotearg_n_style_mem
quotearg_n_options
x2realloc
xalloc_die
xrealloc
xrealloc
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
str_iconv
iconv_open
str_cd_iconv
__errno_location
free
iconv_close
__errno_location
iconv_close
c_strcasecmp
strdup
__errno_location
quotearg_char_mem
qword_20C1F0
default_quoting_options
xmmword_20C1D0
xmmword_20C1E0
quotearg_n_options
quotearg_n_custom_mem
default_quoting_options
qword_20C1F0
xmmword_20C1D0
xmmword_20C1E0
abort
quotearg_n_options
mmalloca
malloc
mmalloca_results
mmalloca_results
.exit
exit
xzalloc
xmalloc
memset
xmemdup
xmalloc
memcpy
c_strcasecmp
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
xstrdup
strlen
xmemdup
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
.free
free
.__fpending
_fpending
.fclose
fclose
.malloc
malloc
.mbsinit
mbsinit
close_stream
__fpending
fclose
__errno_location
__errno_location
last_component
mbslen
is_basic_table
__assert_fail
\"mbsinit (&iter->state)\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
mbsinit
__ctype_get_mb_cur_max
strnlen1
mbrtowc
strlen
__assert_fail
\"*iter->cur.ptr == '\\\\0'\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
__assert_fail
\"iter->cur.wc == 0\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
mbsinit
__ctype_get_mb_cur_max
strlen
knuth_morris_pratt_unibyte
strlen
mmalloca
freea
quote_n
quotearg_n_style
freea
mmalloca_results
mmalloca_results
free
main
set_program_name
setlocale
\"Written by %s, %s, and %s.\\n\"
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
atexit
close_stdout
parse_long_options
STRING
unk_3C3E
STRING
usage
STRING
STRING
optind
dir_len
fwrite_unlocked
stdout
stdout
__overflow
stdout
stdout
stdout
stdout
__overflow
stdout
stdout
stdout
exit
optind
quote
optind
dcgettext
\"extra operand %s\"
error
usage
optind
dcgettext
\"missing operand\"
error
getopt_long
\"+\"
usage
base_len
strlen
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
quote
quotearg_n_style
._exit
exit
get_quoting_style
default_quoting_options
close_stdout_set_file_name
file_name
mdir_name
dir_len
malloc
memcpy
.textdomain
textdomain
close_stdout_set_ignore_EPIPE
ignore_EPIPE
set_quoting_style
default_quoting_options
default_quoting_options
.strlen
strlen
.__cxa_atexit
_cxa_atexit
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
.iswprint
iswprint
quotearg
quotearg_n_options
default_quoting_options
dir_len
last_component
set_custom_quoting
default_quoting_options
default_quoting_options
abort
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
quotearg_n_style
quotearg_n_options
set_quoting_flags
default_quoting_options
quotearg_alloc
quotearg_alloc_mem
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
quotearg_char
quotearg_char_mem
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s NAME\\n  or:  %s OPTION\\n\"
__printf_chk
stdout
dcgettext
\"Print NAME with its trailing /component removed; if NAME contains no /'s,\\noutput `.' (meaning the current directory).\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
dcgettext
\"\\nExamples:\\n  %s /usr/bin/sort  Output \\\"/usr/bin\\\".\\n  %s stdio.h        Output \\\".\\\".\\n\"
__printf_chk
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
\"en_\"
last_component
program_name
\"en_\"
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
quotearg_mem
quotearg_n_options
default_quoting_options
quotearg_colon
quotearg_char_mem
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
quotearg_style
quotearg_n_style
set_char_quoting
default_quoting_options
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
quotearg_n_style_mem
quotearg_n_options
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
quotearg_style_mem
quotearg_n_style_mem
xrealloc
realloc
xalloc_die
quotearg_custom
quotearg_n_custom_mem
base64_decode_ctx_init
quotearg_n_custom_mem
default_quoting_options
qword_2061F0
xmmword_2061D0
xmmword_2061E0
abort
quotearg_n_options
xcalloc
calloc
xalloc_die
quotearg_char_mem
qword_2061F0
default_quoting_options
xmmword_2061D0
xmmword_2061E0
quotearg_n_options
xmalloc
malloc
xalloc_die
version_etc_ar
version_etc_arn
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
xstrdup
strlen
xmemdup
close_stdout_set_file_name
file_name
xzalloc
xmalloc
memset
close_stream
__fpending
fclose
__errno_location
__errno_location
xmemdup
xmalloc
memcpy
quote_n
quotearg_n_style
x2realloc
xalloc_die
xrealloc
xrealloc
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
version_etc_va
version_etc_arn
.strlen
strlen
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
.free
free
.iswprint
iswprint
version_etc
version_etc_arn
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
.__fpending
_fpending
.fclose
fclose
._exit
exit
base64_encode_alloc
malloc
base64_encode
.textdomain
textdomain
.exit
exit
.malloc
malloc
.__cxa_atexit
_cxa_atexit
.mbsinit
mbsinit
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
isbase64
b64
put_space
out_column
out_column
out_column
stdout
__overflow
stdout
stdout
stdout
out_column
out_column
out_column
out_column
tabs
stdout
__overflow
stdout
stdout
stdout
out_column
out_column
base64_decode_alloc_ctx
malloc
base64_decode_ctx
free
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]... [FILE]\\nBase64 encode or decode FILE, or standard input, to standard output.\\n\\n\"
__printf_chk
stdout
dcgettext
\"  -w, --wrap=COLS       Wrap encoded lines after COLS character (default 76).\\n                        Use 0 to disable line wrapping.\\n\\n  -d, --decode          Decode data.\\n  -i, --ignore-garbage  When decoding, ignore non-alphabet characters.\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nWith no FILE, or when FILE is -, read standard input.\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nThe data are encoded as described for the base64 alphabet in RFC 3548.\\nWhen decoding, the input may contain newlines in addition to the bytes of\\nthe formal base64 alphabet.  Use --ignore-garbage to attempt to recover\\nfrom any other non-alphabet bytes in the encoded stream.\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
base64_encode
b64str_2996
b64str_2996
b64str_2996
b64str_2996
b64str_2996
b64str_2996
version_etc
version_etc_arn
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
base_len
strlen
version_etc_ar
version_etc_arn
last_component
set_quoting_flags
default_quoting_options
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
get_quoting_style
default_quoting_options
set_quoting_style
default_quoting_options
default_quoting_options
version_etc_va
version_etc_arn
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
quotearg_style
quotearg_n_style
set_char_quoting
default_quoting_options
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
close_stdout_set_ignore_EPIPE
ignore_EPIPE
quotearg_colon
quotearg_char_mem
quotearg_style_mem
quotearg_n_style_mem
quotearg
quotearg_n_options
default_quoting_options
quote
quotearg_n_style
quotearg_n_style_mem
quotearg_n_options
quotearg_custom
quotearg_n_custom_mem
quotearg_char_mem
qword_213250
default_quoting_options
xmmword_213230
xmmword_213240
quotearg_n_options
quotearg_n_style
quotearg_n_options
quotearg_custom_mem
quotearg_n_custom_mem
xmalloc
malloc
xalloc_die
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
xcalloc
calloc
xalloc_die
quotearg_char
quotearg_char_mem
xrealloc
realloc
xalloc_die
x2realloc
xalloc_die
xrealloc
xrealloc
set_custom_quoting
default_quoting_options
default_quoting_options
abort
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
quotearg_n_custom_mem
default_quoting_options
qword_2071F0
xmmword_2071D0
xmmword_2071E0
abort
quotearg_n_options
xzalloc
xmalloc
memset
._exit
exit
.free
free
quotearg_alloc
quotearg_alloc_mem
.strlen
strlen
xmemdup
xmalloc
memcpy
.__fpending
_fpending
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
quotearg_mem
quotearg_n_options
default_quoting_options
.fclose
fclose
.iswprint
iswprint
.strlen
strlen
quotearg_style
quotearg_n_style
close_stream
__fpending
fclose
__errno_location
__errno_location
head_bytes
safe_read
dcgettext
\"write error\"
__errno_location
error
fwrite_unlocked
stdout
quote
dcgettext
\"error reading %s\"
__errno_location
error
.__cxa_atexit
_cxa_atexit
quotearg_style_mem
quotearg_n_style_mem
.malloc
malloc
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
STRING
STRING
program_name
program_invocation_name
get_prefix
in_column
__uflow
get_space
STRING
in_column
STRING
next_prefix_indent
in_column
in_column
__uflow
in_column
get_space
prefix_lead_space
in_column
in_column
prefix_lead_space
next_prefix_indent
prefix_length
.mbsinit
mbsinit
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
base_len
strlen
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
quotearg_char_mem
qword_2071F0
default_quoting_options
xmmword_2071D0
xmmword_2071E0
quotearg_n_options
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
set_other_indent
first_indent
other_indent
first_indent
in_column
first_indent
other_indent
first_indent
first_indent
other_indent
first_indent
other_indent
first_indent
other_indent
in_column
in_column
first_indent
other_indent
first_indent
tagged
crown
split
quote_n
quotearg_n_style
xcalloc
calloc
xalloc_die
put_word.isra.1
stdout
__overflow
stdout
stdout
stdout
out_column
last_component
get_quoting_style
default_quoting_options
xstrdup
strlen
xmemdup
flush_paragraph
word_limit
fwrite_unlocked
parabuf
wptr
parabuf
stdout
wptr
parabuf
fmt_paragraph
qword_208100
qword_208100
qword_208100
put_paragraph
wptr
__memmove_chk
word_limit
parabuf
wptr
parabuf
word_limit
__memmove_chk
word_limit
unused_word_type
word_limit
unused_word_type
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [-WIDTH] [OPTION]... [FILE]...\\n\"
__printf_chk
stdout
dcgettext
\"Reformat each paragraph in the FILE(s), writing to standard output.\\nThe option -WIDTH is an abbreviated form of --width=DIGITS.\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"Mandatory arguments to long options are mandatory for short options too.\\n\"
fputs_unlocked
stdout
dcgettext
\"  -c, --crown-margin        preserve indentation of first two lines\\n  -p, --prefix=STRING       reformat only lines beginning with STRING,\\n                              reattaching the prefix to reformatted lines\\n  -s, --split-only          split long lines, but do not refill\\n\"
fputs_unlocked
stdout
dcgettext
\"  -t, --tagged-paragraph    indentation of first line different from second\\n  -u, --uniform-spacing     one space between words, two after sentences\\n  -w, --width=WIDTH         maximum line width (default of 75 columns)\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nWith no FILE, or when FILE is -, read standard input.\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
close_stdout_set_ignore_EPIPE
ignore_EPIPE
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
set_char_quoting
default_quoting_options
base_len
strlen
close_stdout_set_file_name
file_name
._exit
exit
quote
quotearg_n_style
.textdomain
textdomain
quote_n
quotearg_n_style
.exit
exit
get_quoting_style
default_quoting_options
.iswprint
iswprint
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
set_char_quoting
default_quoting_options
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
set_custom_quoting
default_quoting_options
default_quoting_options
abort
get_space
in_column
__uflow
tabs
in_column
in_column
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
close_stream
__fpending
fclose
__errno_location
__errno_location
xrealloc
realloc
xalloc_die
quotearg_n_style
quotearg_n_options
put_line
out_column
put_space
prefix_indent
fputs_unlocked
STRING
stdout
out_column
prefix_length
out_column
prefix_length
put_space
put_word_isra_1
put_space
put_word_isra_1
last_line_length
out_column
stdout
__overflow
stdout
stdout
stdout
quotearg_char
quotearg_char_mem
.close
close
quotearg_colon
quotearg_char_mem
xmemdup
xmalloc
memcpy
version_etc_ar
version_etc_arn
quotearg_custom
quotearg_n_custom_mem
.utmpxname
utmpxname
.__cxa_atexit
_cxa_atexit
quotearg_custom_mem
quotearg_n_custom_mem
._exit
exit
xmalloc
malloc
xalloc_die
xzalloc
xmalloc
memset
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
version_etc_va
version_etc_arn
.fclose
fclose
xrealloc
realloc
xalloc_die
xstrdup
strlen
xmemdup
.exit
exit
set_quoting_style
default_quoting_options
default_quoting_options
elide_tail_lines_seekable
lseek
safe_read
quote
dcgettext
\"error reading %s\"
__errno_location
error
offtostr
dcgettext
\"%s: cannot seek to offset %s\"
__errno_location
error
lseek
safe_read
memrchr
copy_fd
stdout
diagnose_copy_fd_failure
fwrite_unlocked
stdout
lseek
quote
__errno_location
error
STRING
x2realloc
xalloc_die
xrealloc
xrealloc
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
set_quoting_flags
default_quoting_options
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]... [FILE]\\n\"
__printf_chk
dcgettext
\"Output who is currently logged in according to FILE.\\nIf FILE is not specified, use %s.  %s as FILE is common.\\n\\n\"
__printf_chk
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
xmemdup
xmalloc
memcpy
version_etc_va
version_etc_arn
.__fpending
_fpending
quotearg_alloc
quotearg_alloc_mem
set_custom_quoting
default_quoting_options
default_quoting_options
abort
.free
free
quote
quotearg_n_style
.malloc
malloc
quotearg
quotearg_n_options
default_quoting_options
quotearg
quotearg_n_options
default_quoting_options
.fclose
fclose
.exit
exit
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
quotearg_mem
quotearg_n_options
default_quoting_options
quotearg_n_style_mem
quotearg_n_options
.mbsinit
mbsinit
copy_fd
safe_read
fwrite_unlocked
set_custom_quoting
default_quoting_options
default_quoting_options
abort
quotearg_n_style_mem
quotearg_n_options
xmalloc
malloc
xalloc_die
quotearg
quotearg_n_options
default_quoting_options
string_to_integer
xstrtoumax
dcgettext
\"invalid number of lines\"
dcgettext
\"number of bytes\"
dcgettext
\"%s: %s is so large that it is not representable\"
error
dcgettext
\"invalid number of lines\"
dcgettext
\"invalid number of bytes\"
error
\"%s: %s\"
quotearg_n_custom_mem
default_quoting_options
qword_213250
xmmword_213230
xmmword_213240
abort
quotearg_n_options
head_lines
safe_read
fwrite_unlocked
stdout
__errno_location
quote
dcgettext
\"cannot reposition file pointer for %s\"
error
__fxstat
lseek
fwrite_unlocked
stdout
dcgettext
\"write error\"
__errno_location
error
quote
dcgettext
\"error reading %s\"
__errno_location
error
xstrdup
strlen
xmemdup
quotearg_n_style
quotearg_n_options
full_read
safe_read
__errno_location
.textdomain
textdomain
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
close_stream
__fpending
fclose
__errno_location
__errno_location
.__fxstat
_fxstat
version_etc_ar
version_etc_arn
quotearg_n_custom_mem
default_quoting_options
qword_208210
xmmword_2081F0
xmmword_208200
abort
quotearg_n_options
.exit
exit
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
xzalloc
xmalloc
memset
offtostr
diagnose_copy_fd_failure
quote
STRING
quote
\"%s: file has shrunk too much\"
quote
\"error reading %s\"
abort
dcgettext
__errno_location
error
version_etc
version_etc_arn
xstrdup
strlen
xmemdup
print_factors_single
umaxtostr
__printf_chk
wheel_tab
__assert_fail
\"n_factors < max_n_factors\"
\"factor.c\"
\"factor_wheel\"
wheel_tab
wheel_tab
__assert_fail
\"n_factors < max_n_factors\"
\"factor.c\"
\"factor_wheel\"
umaxtostr
__printf_chk
umaxtostr
__printf_chk
umaxtostr
__printf_chk
stdout
__overflow
stdout
stdout
stdout
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
set_quoting_style
default_quoting_options
default_quoting_options
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]... [FILE]...\\n\"
__printf_chk
stdout
dcgettext
\"Print the first 10 lines of each FILE to standard output.\\nWith more than one FILE, precede each with a header giving the file name.\\nWith no FILE, or when FILE is -, read standard input.\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"Mandatory arguments to long options are mandatory for short options too.\\n\"
fputs_unlocked
stdout
dcgettext
\"  -c, --bytes=[-]K         print the first K bytes of each file;\\n                             with the leading `-', print all but the last\\n                             K bytes of each file\\n  -n, --lines=[-]K         print the first K lines instead of the first 10;\\n                             with the leading `-', print all but the last\\n                             K lines of each file\\n\"
fputs_unlocked
stdout
dcgettext
\"  -q, --quiet, --silent    never print headers giving file names\\n  -v, --verbose            always print headers giving file names\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nK may have a multiplier suffix:\\nb 512, kB 1000, K 1024, MB 1000*1000, M 1024*1024,\\nGB 1000*1000*1000, G 1024*1024*1024, and so on for T, P, E, Z, Y.\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
quotearg_style
quotearg_n_style
set_char_quoting
default_quoting_options
set_quoting_flags
default_quoting_options
.strlen
strlen
last_component
quotearg_style_mem
quotearg_n_style_mem
quotearg_mem
quotearg_n_options
default_quoting_options
quotearg_alloc
quotearg_alloc_mem
main
set_program_name
setlocale
\"Written by %s, %s, and %s.\\n\"
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
atexit
close_stdout
parse_long_options
STRING
unk_4050
STRING
usage
STRING
STRING
users
STRING
exit
optind
users
optind
optind
quote
optind
dcgettext
\"extra operand %s\"
error
getopt_long
\"Written by %s, %s, and %s.\\n\"
usage
close_stdout_set_file_name
file_name
quotearg_style
quotearg_n_style
quotearg_mem
quotearg_n_options
default_quoting_options
close_stdout_set_ignore_EPIPE
ignore_EPIPE
quotearg_char_mem
qword_208210
default_quoting_options
xmmword_2081F0
xmmword_208200
quotearg_n_options
base_len
strlen
quotearg_style_mem
quotearg_n_style_mem
quotearg_n_style_mem
quotearg_n_options
quotearg_custom
quotearg_n_custom_mem
get_quoting_style
default_quoting_options
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
quotearg_colon
quotearg_char_mem
quotearg_char_mem
qword_2071F0
default_quoting_options
xmmword_2071D0
xmmword_2071E0
quotearg_n_options
xmalloc
malloc
xalloc_die
set_quoting_style
default_quoting_options
default_quoting_options
quotearg_char
quotearg_char_mem
set_quoting_flags
default_quoting_options
umaxtostr
xzalloc
xmalloc
memset
xstrdup
strlen
xmemdup
xcalloc
calloc
xalloc_die
x2realloc
xalloc_die
xrealloc
xrealloc
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
safe_read
read
__errno_location
.free
free
quotearg_mem
quotearg_n_options
default_quoting_options
.fclose
fclose
.iswprint
iswprint
close_stream
__fpending
fclose
__errno_location
__errno_location
.__fpending
_fpending
quotearg_style
quotearg_n_style
.exit
exit
quotearg_style_mem
quotearg_n_style_mem
.textdomain
textdomain
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
.malloc
malloc
.__cxa_atexit
_cxa_atexit
.mbsinit
mbsinit
userid_compare
strcmp
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
quotearg_char_mem
qword_2061F0
default_quoting_options
xmmword_2061D0
xmmword_2061E0
quotearg_n_options
last_component
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
extract_trimmed_name
xmalloc
strncpy
strlen
last_component
get_quoting_style
default_quoting_options
close_stdout_set_file_name
file_name
users
__errno_location
error
\"%s: %s\"
read_utmp
xalloc_die
xmalloc
extract_trimmed_name
qsort
userid_compare
fputs_unlocked
stdout
stdout
__overflow
stdout
stdout
stdout
free
qsort
userid_compare
free
free
xcalloc
calloc
xalloc_die
close_stdout_set_ignore_EPIPE
ignore_EPIPE
set_custom_quoting
default_quoting_options
default_quoting_options
abort
quote_n
quotearg_n_style
quotearg_alloc
quotearg_alloc_mem
version_etc_ar
version_etc_arn
quote
quotearg_n_style
quotearg_n_style_mem
quotearg_n_options
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
quotearg_n_style
quotearg_n_options
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
quotearg_custom
quotearg_n_custom_mem
quotearg_char
quotearg_char_mem
x2realloc
xalloc_die
xrealloc
xrealloc
.__fpending
_fpending
set_char_quoting
default_quoting_options
xrealloc
realloc
xalloc_die
quotearg_colon
quotearg_char_mem
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
.fclose
fclose
xmemdup
xmalloc
memcpy
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
quotearg_n_custom_mem
default_quoting_options
qword_2061F0
xmmword_2061D0
xmmword_2061E0
abort
quotearg_n_options
.__fpending
_fpending
.__cxa_atexit
_cxa_atexit
quotearg_custom_mem
quotearg_n_custom_mem
version_etc_va
version_etc_arn
.strlen
strlen
xzalloc
xmalloc
memset
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
x2realloc
xalloc_die
xrealloc
xrealloc
.free
free
.__cxa_atexit
_cxa_atexit
._exit
exit
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
.textdomain
textdomain
.malloc
malloc
base_len
strlen
version_etc
version_etc_arn
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
version_etc
version_etc_arn
quote_n
quotearg_n_style
main
set_program_name
setlocale
\"Written by %s, %s, and %s.\\n\"
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
atexit
close_stdout
getopt_long
\"Written by %s, %s, and %s.\\n\"
long_options
usage
usage
version_etc
stdout
STRING
unk_4448
Version
STRING
exit
optind
init_tokenbuffer
print_factors
readtoken
stdin
free
print_factors
optind
exit
.strlen
strlen
set_custom_quoting
default_quoting_options
default_quoting_options
abort
.mbsinit
mbsinit
quotearg_alloc
quotearg_alloc_mem
base_len
strlen
.iswprint
iswprint
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
quotearg_mem
quotearg_n_options
default_quoting_options
close_stdout_set_file_name
file_name
close_stdout_set_ignore_EPIPE
ignore_EPIPE
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
quote
quotearg_n_style
set_quoting_flags
default_quoting_options
quotearg_n_style_mem
quotearg_n_options
print_factors
xstrtoumax
quote
STRING
\"%s is not a valid positive integer\"
quote
dcgettext
error
dcgettext
\"using single-precision arithmetic\"
print_factors_single
get_quoting_style
default_quoting_options
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [NUMBER]...\\n  or:  %s OPTION\\n\"
__printf_chk
stdout
dcgettext
\"Print the prime factors of each specified integer NUMBER.  If none\\nare specified on the command line, read them from standard input.\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
quotearg_char_mem
qword_207210
default_quoting_options
xmmword_2071F0
xmmword_207200
quotearg_n_options
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
set_quoting_style
default_quoting_options
default_quoting_options
quotearg_char
quotearg_char_mem
xmemdup
xmalloc
memcpy
last_component
version_etc_ar
version_etc_arn
set_custom_quoting
default_quoting_options
default_quoting_options
abort
quotearg_colon
quotearg_char_mem
quotearg_alloc
quotearg_alloc_mem
quotearg_custom_mem
quotearg_n_custom_mem
quotearg
quotearg_n_options
default_quoting_options
version_etc_va
version_etc_arn
quotearg_n_style_mem
quotearg_n_options
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
quotearg_custom
quotearg_n_custom_mem
readtokens
xalloc_die
xmalloc
xmalloc
readtoken
xrealloc
xrealloc
xmalloc
memcpy
free
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
quotearg_n_style
quotearg_n_options
init_tokenbuffer
base_len
strlen
xmalloc
malloc
xalloc_die
close_stdout_set_ignore_EPIPE
ignore_EPIPE
umaxtostr
set_quoting_style
default_quoting_options
default_quoting_options
quotearg_n_custom_mem
default_quoting_options
qword_2071F0
xmmword_2071D0
xmmword_2071E0
abort
quotearg_n_options
xrealloc
realloc
xalloc_die
x2realloc
xalloc_die
xrealloc
xrealloc
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
freopen_safer
fileno
__errno_location
freopen
dup2
dup2
dup2
protect_fd
protect_fd
close
close
protect_fd
close
close
xmemdup
xmalloc
memcpy
xcalloc
calloc
xalloc_die
.free
free
quotearg_n_style
quotearg_n_options
quotearg_style
quotearg_n_style
._exit
exit
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
quotearg_colon
quotearg_char_mem
.puts
puts
quotearg_style_mem
quotearg_n_style_mem
.__fpending
_fpending
quotearg_custom
quotearg_n_custom_mem
close_stream
__fpending
fclose
__errno_location
__errno_location
.strlen
strlen
.textdomain
textdomain
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_char_mem
qword_207230
default_quoting_options
xmmword_207210
xmmword_207220
quotearg_n_options
.__cxa_atexit
_cxa_atexit
.iswprint
iswprint
.malloc
malloc
xrealloc
realloc
xalloc_die
.mbsinit
mbsinit
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
xmemdup
xmalloc
memcpy
x2realloc
xalloc_die
xrealloc
xrealloc
main
set_program_name
setlocale
\"Written by %s, %s, and %s.\\n\"
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
atexit
close_stdout
parse_long_options
STRING
unk_39E2
STRING
usage
STRING
getlogin
puts
exit
dcgettext
\"no login name\"
error
exit
optind
quote
optind
dcgettext
\"extra operand %s\"
error
getopt_long
\"Written by %s, %s, and %s.\\n\"
usage
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
version_etc
version_etc_arn
close_stdout_set_ignore_EPIPE
ignore_EPIPE
close_stdout_set_file_name
file_name
.getenv
getenv
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]\\n\"
__printf_chk
stdout
dcgettext
\"Print the name of the current user.\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
.iswprint
iswprint
quote
quotearg_n_style
set_char_quoting
default_quoting_options
.endmntent
endmntent
quote_n
quotearg_n_style
quotearg_alloc
quotearg_alloc_mem
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
quotearg
quotearg_n_options
default_quoting_options
.fclose
fclose
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
quotearg_mem
quotearg_n_options
default_quoting_options
set_quoting_style
default_quoting_options
default_quoting_options
.__xstat
_xstat
quotearg_style
quotearg_n_style
set_quoting_flags
default_quoting_options
.iconv_close
iconv_close
set_quoting_flags
default_quoting_options
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
quotearg_style_mem
quotearg_n_style_mem
.iswprint
iswprint
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
xzalloc
xmalloc
memset
quotearg_char_mem
qword_2061F0
default_quoting_options
xmmword_2061D0
xmmword_2061E0
quotearg_n_options
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_char
quotearg_char_mem
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]... [FILE]...\\n\"
__printf_chk
stdout
dcgettext
\"Show information about the file system on which each FILE resides,\\nor all file systems by default.\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"Mandatory arguments to long options are mandatory for short options too.\\n\"
fputs_unlocked
stdout
dcgettext
\"  -a, --all             include dummy file systems\\n  -B, --block-size=SIZE  use SIZE-byte blocks\\n      --total           produce a grand total\\n  -h, --human-readable  print sizes in human readable format (e.g., 1K 234M 2G)\\n  -H, --si              likewise, but use powers of 1000 not 1024\\n\"
fputs_unlocked
stdout
dcgettext
\"  -i, --inodes          list inode information instead of block usage\\n  -k                    like --block-size=1K\\n  -l, --local           limit listing to local file systems\\n      --no-sync         do not invoke sync before getting usage info (default)\\n\"
fputs_unlocked
stdout
dcgettext
\"  -P, --portability     use the POSIX output format\\n      --sync            invoke sync before getting usage info\\n  -t, --type=TYPE       limit listing to file systems of type TYPE\\n  -T, --print-type      print file system type\\n  -x, --exclude-type=TYPE   limit listing to file systems not of type TYPE\\n  -v                    (ignored)\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
dcgettext
\"\\nDisplay values are in units of the first available SIZE from --block-size,\\nand the %s_BLOCK_SIZE, BLOCK_SIZE and BLOCKSIZE environment variables.\\nOtherwise, units default to 1024 bytes (or 512 if POSIXLY_CORRECT is set).\\n\"
__printf_chk
stdout
dcgettext
\"\\nSIZE may be (or may be an integer optionally followed by) one of following:\\nKB 1000, K 1024, MB 1000*1000, M 1024*1024, and so on for G, T, P, E, Z, Y.\\n\"
fputs_unlocked
last_component
