._exit
exit
.free
free
.localtime
localtime
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
.fclose
fclose
.textdomain
textdomain
.strlen
strlen
.__fpending
_fpending
.getpwuid
getpwuid
.getgrgid
getgrgid
.__lxstat
_lxstat
.malloc
malloc
.__xstat
_xstat
.mktime
mktime
.exit
exit
.__fxstat
_fxstat
.__cxa_atexit
_cxa_atexit
.mbsinit
mbsinit
.iswprint
iswprint
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
human_time
localtime
imaxtostr
str_6778
nstrftime
str_6778
STRING
str_6778
out_file_context
__errno_location
quote
dcgettext
\"failed to get security context of %s\"
error
__printf_chk
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
print_stat
filemodestring
modebuf_6774
byte_20B0FA
out_uint
out_file_context
out_uint_x
file_type
setgrent
getgrgid
quote
out_string
areadlink_with_size
__printf_chk
quote
out_string
quote
dcgettext
\"cannot read symbolic link %s\"
__errno_location
error
setpwent
getpwuid
out_int
__printf_chk
human_time
human_time
human_time
stdout
__overflow
stdout
stdout
stdout
version_etc_ar
version_etc_arn
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
STRING
STRING
program_name
program_invocation_name
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
areadlink_with_size
malloc
readlink
free
__errno_location
free
malloc
__errno_location
imaxtostr
version_etc_va
version_etc_arn
version_etc
version_etc_arn
base_len
strlen
last_component
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
close_stdout_set_file_name
file_name
filemodestring
strmode
quote
quotearg_n_style
get_quoting_style
default_quoting_options
close_stdout_set_ignore_EPIPE
ignore_EPIPE
memcpy_lowcase
__ctype_tolower_loc
quote_n
quotearg_n_style
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
set_quoting_style
default_quoting_options
default_quoting_options
xzalloc
xmalloc
memset
file_type
dcgettext
\"regular file\"
dcgettext
\"regular empty file\"
dcgettext
\"directory\"
dcgettext
\"block special file\"
dcgettext
\"character special file\"
dcgettext
\"fifo\"
dcgettext
\"symbolic link\"
dcgettext
\"socket\"
dcgettext
\"weird file\"
xstrdup
strlen
xmemdup
.free
free
set_quoting_flags
default_quoting_options
._exit
exit
set_char_quoting
default_quoting_options
.__fpending
_fpending
set_custom_quoting
default_quoting_options
default_quoting_options
abort
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
quotearg_alloc
quotearg_alloc_mem
.fclose
fclose
quotearg
quotearg_n_options
default_quoting_options
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
quotearg_mem
quotearg_n_options
default_quoting_options
quotearg_n_style
quotearg_n_options
.fileno
fileno
quotearg_n_style_mem
quotearg_n_options
quotearg_char
quotearg_char_mem
quotearg_style
quotearg_n_style
quotearg_custom
quotearg_n_custom_mem
quotearg_style_mem
quotearg_n_style_mem
.exit
exit
quotearg_colon
quotearg_char_mem
memcpy_uppcase
__ctype_toupper_loc
nstrftime
strftime_case_
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
quotearg_char_mem
qword_20B270
default_quoting_options
xmmword_20B250
xmmword_20B260
quotearg_n_options
x2realloc
xalloc_die
xrealloc
xrealloc
set_join_field
dcgettext
\"incompatible join fields %lu, %lu\"
error
xcalloc
calloc
xalloc_die
quotearg_n_custom_mem
default_quoting_options
qword_20B270
xmmword_20B250
xmmword_20B260
abort
quotearg_n_options
.close
close
quotearg_custom_mem
quotearg_n_custom_mem
prfield.isra.4
fwrite_unlocked
stdout
fputs_unlocked
STRING
stdout
STRING
.mbsinit
mbsinit
xmalloc
malloc
xalloc_die
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
xrealloc
realloc
xalloc_die
string_to_join_field
xstrtoul
quote
dcgettext
\"invalid field number: %s\"
error
getseq
xalloc_die
xrealloc
get_line
close_stream
__fpending
fclose
__errno_location
__errno_location
.malloc
malloc
xmemdup
xmalloc
memcpy
extract_field
xalloc_die
xrealloc
.iswprint
iswprint
freebuffer
free
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
.textdomain
textdomain
.strlen
strlen
.__cxa_atexit
_cxa_atexit
add_field_list
strpbrk
\", \\t\"
quote
\", \\t\"
dcgettext
\"invalid field specifier: %s\"
error
quote
\", \\t\"
dcgettext
\"invalid file number in field spec: %s\"
error
abort
quote
\", \\t\"
dcgettext
\"invalid field specifier: %s\"
error
string_to_join_field
__assert_fail
\"file == 0 || file == 1 || file == 2\"
\"join.c\"
\"add_field\"
__assert_fail
\"file != 0 || field == 0\"
\"join.c\"
\"add_field\"
xmalloc
outlist_end
outlist_end
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
add_file_name
string_to_join_field
set_join_field
join_field_1
quote
dcgettext
\"extra operand %s\"
error
usage
string_to_join_field
set_join_field
join_field_2
add_field_list
byte_8
byte_8
keycmp.isra.3
memcasecmp
xmemcoll
hard_LC_COLLATE
memcmp
ignore_case
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
version_etc
version_etc_arn
delseq.isra.2
free
free
free
free
free
xmemcoll
memcoll
__errno_location
dcgettext
\"string comparison failed\"
error
dcgettext
\"Set LC_ALL='C' to work around the problem.\"
error
quotearg_n_style_mem
quotearg_n_style_mem
dcgettext
\"The strings compared were %s and %s.\"
error
exit_failure
initbuffer
close_stdout_set_file_name
file_name
close_stdout_set_ignore_EPIPE
ignore_EPIPE
memcasecmp
__ctype_toupper_loc
hard_locale
setlocale
STRING
STRING
fopen_safer
fopen
fileno
dup_safer
__errno_location
fclose
__errno_location
close
fclose
fdopen
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]... FILE1 FILE2\\n\"
__printf_chk
stdout
dcgettext
\"For each pair of input lines with identical join fields, write a line to\\nstandard output.  The default join field is the first, delimited\\nby whitespace.  When FILE1 or FILE2 (not both) is -, read standard input.\\n\\n  -a FILENUM        print unpairable lines coming from file FILENUM, where\\n                      FILENUM is 1 or 2, corresponding to FILE1 or FILE2\\n  -e EMPTY          replace missing input fields with EMPTY\\n\"
fputs_unlocked
stdout
dcgettext
\"  -i, --ignore-case  ignore differences in case when comparing fields\\n  -j FIELD          equivalent to `-1 FIELD -2 FIELD'\\n  -o FORMAT         obey FORMAT while constructing output line\\n  -t CHAR           use CHAR as input and output field separator\\n\"
fputs_unlocked
stdout
dcgettext
\"  -v FILENUM        like -a FILENUM, but suppress joined output lines\\n  -1 FIELD          join on this FIELD of file 1\\n  -2 FIELD          join on this FIELD of file 2\\n  --check-order     check that the input is correctly sorted, even\\n                      if all input lines are pairable\\n  --nocheck-order   do not check that the input is correctly sorted\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nUnless -t CHAR is given, leading blanks separate fields and are ignored,\\nelse fields are separated by CHAR.  Any FIELD is a field number counted\\nfrom 1.  FORMAT is one or more comma or blank separated specifications,\\neach being `FILENUM.FIELD' or `0'.  Default FORMAT outputs the join field,\\nthe remaining fields from FILE1, the remaining fields from FILE2, all\\nseparated by CHAR.\\n\\nImportant: FILE1 and FILE2 must be sorted on the join fields.\\nE.g., use `sort -k 1b,1' if `join' has no options.\\nNote, comparisons honor the rules specified by `LC_COLLATE'.\\nIf the input is not sorted and some lines cannot be joined, a\\nwarning message will be given.\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
readlinebuffer_delim
__uflow
x2realloc
get_quoting_style
default_quoting_options
quote_n
quotearg_n_style
set_custom_quoting
default_quoting_options
default_quoting_options
abort
version_etc_ar
version_etc_arn
last_component
set_char_quoting
default_quoting_options
quotearg_alloc
quotearg_alloc_mem
quote
quotearg_n_style
quotearg
quotearg_n_options
default_quoting_options
quotearg_mem
quotearg_n_options
default_quoting_options
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
set_quoting_style
default_quoting_options
default_quoting_options
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
version_etc_va
version_etc_arn
quotearg_n_style_mem
quotearg_n_options
quotearg_char
quotearg_char_mem
set_quoting_flags
default_quoting_options
quotearg_n_custom_mem
default_quoting_options
qword_2092D0
xmmword_2092B0
xmmword_2092C0
abort
quotearg_n_options
base_len
strlen
xmalloc
malloc
xalloc_die
quotearg_colon
quotearg_char_mem
xmemdup
xmalloc
memcpy
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
quotearg_custom
quotearg_n_custom_mem
xcalloc
calloc
xalloc_die
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
x2realloc
xalloc_die
xrealloc
xrealloc
quotearg_n_style
quotearg_n_options
memcoll
__errno_location
strcoll
strlen
strlen
memcmp
rpl_fcntl
fcntl
rpl_fcntl
have_dupfd_cloexec_3202
fcntl
have_dupfd_cloexec_3202
__errno_location
rpl_fcntl
have_dupfd_cloexec_3202
have_dupfd_cloexec_3202
fcntl
__errno_location
close
fcntl
.clearerr_unlocked
clearerr_unlocked
close_stream
__fpending
fclose
__errno_location
__errno_location
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_style
quotearg_n_style
.strlen
strlen
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
.mbsinit
mbsinit
xzalloc
xmalloc
memset
quotearg_style_mem
quotearg_n_style_mem
.malloc
malloc
version_etc
version_etc_arn
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
dup_safer
rpl_fcntl
quotearg_char_mem
qword_2092D0
default_quoting_options
xmmword_2092B0
xmmword_2092C0
quotearg_n_options
.iswprint
iswprint
.free
free
._exit
exit
.__fpending
_fpending
xrealloc
realloc
xalloc_die
mark_range_start
hash_insert
range_start_ht
xalloc_die
__assert_fail
\"(size_t) ent_from_table == i\"
\"cut.c\"
\"mark_range_start\"
.ferror
ferror
.textdomain
textdomain
print_kth
eol_range_start
eol_range_start
printable_field
max_range_endpoint
complement
hash_lookup
range_start_ht
.fgetc
fgetc
xstrdup
strlen
xmemdup
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
.__cxa_atexit
_cxa_atexit
hash_find_entry
abort
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
version_etc_va
version_etc_arn
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
base_len
strlen
hash_reset_tuning
.fclose
fclose
close_stdout_set_file_name
file_name
version_etc_ar
version_etc_arn
hash_get_n_buckets
.fileno
fileno
close_stdout_set_ignore_EPIPE
ignore_EPIPE
hash_clear
xstrndup
strndup
xalloc_die
hash_get_n_buckets_used
.exit
exit
raw_hasher
set_quoting_flags
default_quoting_options
hash_get_n_entries
last_component
compare_ranges
next_prime
hash_get_max_bucket_length
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
check_tuning.isra.0
default_tuning
default_tuning
hash_get_first
abort
hash_lookup
abort
quotearg_n_style
quotearg_n_options
hash_print_statistics
__fprintf_chk
__fprintf_chk
__fprintf_chk
__fprintf_chk
quotearg_custom_mem
quotearg_n_custom_mem
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s OPTION... [FILE]...\\n\"
__printf_chk
stdout
dcgettext
\"Print selected parts of lines from each FILE to standard output.\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"Mandatory arguments to long options are mandatory for short options too.\\n\"
fputs_unlocked
stdout
dcgettext
\"  -b, --bytes=LIST        select only these bytes\\n  -c, --characters=LIST   select only these characters\\n  -d, --delimiter=DELIM   use DELIM instead of TAB for field delimiter\\n\"
fputs_unlocked
stdout
dcgettext
\"  -f, --fields=LIST       select only these fields;  also print any line\\n                            that contains no delimiter character, unless\\n                            the -s option is specified\\n  -n                      (ignored)\\n\"
fputs_unlocked
stdout
dcgettext
\"      --complement        complement the set of selected bytes, characters\\n                            or fields\\n\"
fputs_unlocked
stdout
dcgettext
\"  -s, --only-delimited    do not print lines not containing delimiters\\n      --output-delimiter=STRING  use STRING as the output delimiter\\n                            the default is to use the input delimiter\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nUse one, and only one of -b, -c or -f.  Each LIST is made up of one\\nrange, or many ranges separated by commas.  Selected input is written\\nin the same order that it is read, and is written exactly once.\\n\"
fputs_unlocked
stdout
dcgettext
\"Each range is one of:\\n\\n  N     N'th byte, character or field, counted from 1\\n  N-    from N'th byte, character or field, to end of line\\n  N-M   from N'th to M'th (included) byte, character or field\\n  -M    from first to M'th (included) byte, character or field\\n\\nWith no FILE, or when FILE is -, read standard input.\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
hash_get_entries
hash_string
x2realloc
xalloc_die
xrealloc
xrealloc
hash_get_next
abort
hash_table_ok
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
.localtime
localtime
quote_n
quotearg_n_style
hash_initialize
raw_hasher
raw_comparator
malloc
check_tuning_isra_0
next_prime
calloc
free
default_tuning
check_tuning_isra_0
hash_do_for_each
get_quoting_style
default_quoting_options
.__fpending
_fpending
quote
quotearg_n_style
.iswcntrl
iswcntrl
set_quoting_style
default_quoting_options
default_quoting_options
.textdomain
textdomain
hash_free
free
free
free
free
quotearg_style_mem
quotearg_n_style_mem
.strlen
strlen
quotearg_char
quotearg_char_mem
.sigemptyset
sigemptyset
set_char_quoting
default_quoting_options
quotearg_colon
quotearg_char_mem
.readdir
readdir
set_custom_quoting
default_quoting_options
default_quoting_options
abort
.exit
exit
free
free
quotearg_alloc
quotearg_alloc_mem
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
quotearg
quotearg_n_options
default_quoting_options
quotearg_n_custom_mem
default_quoting_options
qword_20A250
xmmword_20A230
xmmword_20A240
abort
quotearg_n_options
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
sighandler
interrupt_signal
interrupt_signal
interrupt_signal
quotearg_mem
quotearg_n_options
default_quoting_options
xmemdup
xmalloc
memcpy
quotearg_custom
quotearg_n_custom_mem
quotearg_style
quotearg_n_style
rev_strcmp_size
strcmp
quotearg_n_style_mem
quotearg_n_options
xrealloc
realloc
xalloc_die
close_stream
__fpending
fclose
__errno_location
__errno_location
quotearg_char_mem
qword_20A250
default_quoting_options
xmmword_20A230
xmmword_20A240
quotearg_n_options
rev_strcmp_name
strcmp
xmalloc
malloc
xalloc_die
xcalloc
calloc
xalloc_die
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
xzalloc
xmalloc
memset
xstrcoll_name
xstrcoll
xstrdup
strlen
xmemdup
.getenv
getenv
freadseek
freadahead
freadptr
fgetc
fileno
__fread_chk
ferror
rpl_fseeko
lseek
.raise
raise
freadptr
rpl_fseeko
fseeko
fileno
fseeko
lseek
fileno
lseek
indent
tabsize
stdout
stdout
tabsize
tabsize
tabsize
__overflow
stdout
tabsize
stdout
__overflow
stdout
stdout
.opendir
opendir
._exit
exit
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
freadahead
strcmp_df_size
strcmp
.getgrgid
getgrgid
.isatty
isatty
.__cxa_atexit
_cxa_atexit
.closedir
closedir
rev_xstrcoll_df_name
xstrcoll
.iswprint
iswprint
.clock_gettime
clock_gettime
._setjmp
setjmp
.getpwnam
getpwnam
dev_ino_hash
.fclose
fclose
.getgrnam
getgrnam
rev_strcmp_df_extension
strrchr
strrchr
\"Written by %s, %s, and %s.\\n\"
\"Written by %s, %s, and %s.\\n\"
strcmp
strcmp
strcmp
.__xstat
_xstat
.getpwuid
getpwuid
dev_ino_compare
.wcwidth
wcwidth
rev_strcmp_df_ctime
strcmp
.__fxstat
_fxstat
.__lxstat
_lxstat
.mktime
mktime
queue_directory
xmalloc
xstrdup
xstrdup
pending_dirs
pending_dirs
.mbsinit
mbsinit
xstrcoll_mtime
xstrcoll
.dirfd
dirfd
.fflush_unlocked
fflush_unlocked
rev_xstrcoll_version
filevercmp
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
.tcgetpgrp
tcgetpgrp
strcmp_mtime
strcmp
malloc
malloc
format_user_or_group
gnu_mbswidth
fputs_unlocked
stdout
strlen
stdout
__overflow
stdout
stdout
stdout
__printf_chk
dired_pos
dired_pos
is_colored
color_indicator
STRING
xstrcoll_df_atime
xstrcoll
rev_xstrcoll_size
xstrcoll
.nl_langinfo
nl_langinfo
xstrcoll_df_size
xstrcoll
rev_xstrcoll_name
xstrcoll
xstrcoll_extension
strrchr
strrchr
\"Written by %s, %s, and %s.\\n\"
\"Written by %s, %s, and %s.\\n\"
xstrcoll
xstrcoll
dired_dump_obstack
fputs_unlocked
stdout
__printf_chk
stdout
__overflow
stdout
stdout
stdout
dev_ino_free
free
xstrcoll_df_name
xstrcoll
strcmp_extension
strrchr
strrchr
\"Written by %s, %s, and %s.\\n\"
strcmp
strcmp
strcmp
strcmp
\"Written by %s, %s, and %s.\\n\"
strcmp
extract_dirs_from_files
queue_directory
active_dir_set
cwd_n_used
cwd_n_used
sorted_file
last_component
queue_directory
file_name_concat
queue_directory
free
free
cwd_n_used
sorted_file
sorted_file
cwd_n_used
sorted_file
cwd_n_used
cwd_n_used
rev_strcmp_df_size
strcmp
strcmp_size
strcmp
length_of_file_name_and_frills
print_inode
umaxtostr
strlen
print_scontext
strlen
format
scontext_width
print_block_size
human_readable
human_output_opts
output_block_size
strlen
format
block_size_width
format
inode_number_width
print_block_size
print_scontext
quote_name
filename_quoting_options
get_type_indicator
indicator_style
strcmp_df_name
strcmp
xstrcoll_df_extension
strrchr
strrchr
\"Written by %s, %s, and %s.\\n\"
\"Written by %s, %s, and %s.\\n\"
xstrcoll
xstrcoll
get_type_indicator
indicator_style
indicator_style
strcmp_name
strcmp
format_user_width
__sprintf_chk
gnu_mbswidth
numeric_ids
getuser
rev_xstrcoll_df_version
filevercmp
mbsnwidth
__ctype_b_loc
__ctype_get_mb_cur_max
mbrtowc
wcwidth
iswcntrl
mbsinit
rev_strcmp_df_atime
strcmp
xstrcoll_size
xstrcoll
rev_strcmp_atime
strcmp
print_file_name_and_frills
umaxtostr
__printf_chk
print_inode
human_readable
human_output_opts
output_block_size
__printf_chk
print_block_size
__printf_chk
print_scontext
print_name_with_quoting
print_type_indicator
indicator_style
filemodestring
strmode
rev_xstrcoll_ctime
xstrcoll
xstrcoll_version
filevercmp
rev_strcmp_mtime
strcmp
rev_xstrcoll_mtime
xstrcoll
strcmp_atime
strcmp
format_user
\"?\"
getuser
numeric_ids
format_user_or_group
mfile_name_concat
last_component
base_len
strlen
malloc
mempcpy
mempcpy
rev_xstrcoll_atime
xstrcoll
file_failure
quotearg_colon
__errno_location
error
exit_status
exit_status
exit_status
xstrcoll_df_ctime
xstrcoll
xstrcoll_df_mtime
xstrcoll
hash_print_statistics
__fprintf_chk
__fprintf_chk
__fprintf_chk
__fprintf_chk
rev_strcmp_ctime
strcmp
rev_strcmp_df_mtime
strcmp
strcmp_df_ctime
strcmp
hash_get_next
abort
rev_xstrcoll_df_ctime
xstrcoll
rev_xstrcoll_df_atime
xstrcoll
rev_xstrcoll_df_size
xstrcoll
adjust_value.part.0
strcmp_df_extension
strrchr
strrchr
\"Written by %s, %s, and %s.\\n\"
\"Written by %s, %s, and %s.\\n\"
strcmp
strcmp
strcmp
rev_strcmp_extension
strrchr
strrchr
\"Written by %s, %s, and %s.\\n\"
strcmp
strcmp
strcmp
strcmp
\"Written by %s, %s, and %s.\\n\"
strcmp
rev_xstrcoll_extension
strrchr
strrchr
\"Written by %s, %s, and %s.\\n\"
\"Written by %s, %s, and %s.\\n\"
xstrcoll
xstrcoll
rev_strcmp_df_name
strcmp
getuser
user_alist
user_alist
user_alist
\"Written by %s, %s, and %s.\\n\"
getpwuid
strlen
xmalloc
strcpy
user_alist
user_alist
match_suffix
version_etc_ar
version_etc_arn
strcmp_df_atime
strcmp
xstrcoll_df_version
filevercmp
getgidbyname
group_alist
strcmp
group_alist
nogroup_alist
strcmp
getgrnam
strlen
xmalloc
strcpy
group_alist
group_alist
nogroup_alist
nogroup_alist
nogroup_alist
version_etc_va
version_etc_arn
version_etc
version_etc_arn
areadlink_with_size
malloc
readlink
free
__errno_location
free
malloc
__errno_location
align_nstrftime.constprop.49
strstr
\"%b\"
__mempcpy_chk
stpcpy
abmon
strcpy
strlen
required_mon_width
nstrftime
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
argmatch_invalid
dcgettext
\"invalid argument %s for %s\"
dcgettext
\"ambiguous argument %s for %s\"
quote_n
quotearg_n_style
error
argmatch_valid
dcgettext
\"Valid arguments are:\"
__fprintf_chk
__fprintf_chk
memcmp
__fprintf_chk
stderr
__overflow
stderr
stderr
stderr
quotearg_style
quotearg_n_style
hard_locale
setlocale
STRING
STRING
xstrcoll_atime
xstrcoll
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
__xargmatch_internal
argmatch
argmatch_invalid
argmatch_valid
hash_get_n_buckets
base_len
strlen
xstrcoll_ctime
xstrcoll
quotearg_style_mem
quotearg_n_style_mem
hash_get_n_buckets_used
argmatch_to_argument
memcmp
close_stdout_set_file_name
file_name
strcmp_ctime
strcmp
quotearg_char_mem
qword_219F70
default_quoting_options
xmmword_219F50
xmmword_219F60
quotearg_n_options
hash_get_n_entries
next_prime
close_stdout_set_ignore_EPIPE
ignore_EPIPE
rev_xstrcoll_df_mtime
xstrcoll
file_name_concat
mfile_name_concat
xalloc_die
memcpy_uppcase
__ctype_toupper_loc
hash_get_max_bucket_length
hash_table_ok
gettime
gettimeofday
clock_gettime
strcmp_df_mtime
strcmp
x2realloc
xalloc_die
xrealloc
xrealloc
hash_get_first
abort
hash_do_for_each
check_tuning.isra.0
default_tuning
default_tuning
hash_free
free
free
free
free
rev_xstrcoll_df_extension
strrchr
strrchr
\"Written by %s, %s, and %s.\\n\"
\"Written by %s, %s, and %s.\\n\"
xstrcoll
xstrcoll
hash_get_entries
._exit
exit
hash_lookup
abort
getgroup
group_alist
group_alist
group_alist
\"Written by %s, %s, and %s.\\n\"
getgrgid
strlen
xmalloc
strcpy
group_alist
group_alist
gnu_mbswidth
strlen
mbsnwidth
human_options
argmatch
block_size_args
block_size_opts
block_size_opts
xstrtoumax
getenv
\"POSIXLY_CORRECT\"
getenv
\"LS_BLOCK_SIZE\"
getenv
\"BLOCKSIZE\"
getenv
\"POSIXLY_CORRECT\"
.fclose
fclose
hash_string
quote_n
quotearg_n_style
.malloc
malloc
mpsort
mpsort_with_tmp
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
.mbsinit
mbsinit
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
set_custom_quoting
default_quoting_options
default_quoting_options
abort
quotearg_mem
quotearg_n_options
default_quoting_options
diagnose_copy_fd_failure
quote
STRING
quote
\"%s: file has shrunk too much\"
quote
\"error reading %s\"
abort
dcgettext
__errno_location
error
quotearg_n_style_mem
quotearg_n_options
argmatch
strlen
strncmp
strlen
memcmp
full_read
safe_read
__errno_location
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
hash_initialize
raw_hasher
raw_comparator
malloc
check_tuning_isra_0
next_prime
calloc
free
default_tuning
check_tuning_isra_0
quotearg_colon
quotearg_char_mem
last_component
xmalloc
malloc
xalloc_die
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
imaxtostr
quotearg_custom
quotearg_n_custom_mem
raw_hasher
xzalloc
xmalloc
memset
last_component
get_quoting_style
default_quoting_options
memcpy_lowcase
__ctype_tolower_loc
set_char_quoting
default_quoting_options
xmemdup
xmalloc
memcpy
close_stdout_set_ignore_EPIPE
ignore_EPIPE
hash_find_entry
abort
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
xrealloc
realloc
xalloc_die
quote
quotearg_n_style
quotearg_alloc
quotearg_alloc_mem
.textdomain
textdomain
hash_reset_tuning
xstrdup
strlen
xmemdup
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
quotearg
quotearg_n_options
default_quoting_options
.close
close
hash_clear
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
quotearg_alloc
quotearg_alloc_mem
quotearg_n_style
quotearg_n_options
.exit
exit
.free
free
quotearg_char
quotearg_char_mem
quotearg
quotearg_n_options
default_quoting_options
.__fpending
_fpending
.strlen
strlen
quotearg_mem
quotearg_n_options
default_quoting_options
.__fxstat
_fxstat
.iswprint
iswprint
getuidbyname
user_alist
strcmp
user_alist
nouser_alist
strcmp
getpwnam
strlen
xmalloc
strcpy
user_alist
user_alist
nouser_alist
nouser_alist
nouser_alist
copy_fd
safe_read
fwrite_unlocked
quotearg_n_custom_mem
default_quoting_options
qword_219F70
xmmword_219F50
xmmword_219F60
abort
quotearg_n_options
quotearg_n_style
quotearg_n_options
quote
quotearg_n_style
head_bytes
safe_read
dcgettext
\"write error\"
__errno_location
error
fwrite_unlocked
stdout
quote
dcgettext
\"error reading %s\"
__errno_location
error
xcalloc
calloc
xalloc_die
quotearg_colon
quotearg_char_mem
set_quoting_style
default_quoting_options
default_quoting_options
quotearg_custom_mem
quotearg_n_custom_mem
set_quoting_flags
default_quoting_options
close_stream
__fpending
fclose
__errno_location
__errno_location
head_lines
safe_read
fwrite_unlocked
stdout
__errno_location
quote
dcgettext
\"cannot reposition file pointer for %s\"
error
__fxstat
lseek
fwrite_unlocked
stdout
dcgettext
\"write error\"
__errno_location
error
quote
dcgettext
\"error reading %s\"
__errno_location
error
umaxtostr
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
STRING
STRING
program_name
program_invocation_name
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
.__cxa_atexit
_cxa_atexit
x2realloc
xalloc_die
xrealloc
xrealloc
quotearg_custom_mem
quotearg_n_custom_mem
version_etc_ar
version_etc_arn
version_etc
version_etc_arn
.__fpending
_fpending
nstrftime
strftime_case_
string_to_integer
xstrtoumax
dcgettext
\"invalid number of lines\"
dcgettext
\"number of bytes\"
dcgettext
\"%s: %s is so large that it is not representable\"
error
dcgettext
\"invalid number of lines\"
dcgettext
\"invalid number of bytes\"
error
\"%s: %s\"
version_etc_va
version_etc_arn
quote_n
quotearg_n_style
.textdomain
textdomain
umaxtostr
close_stdout_set_file_name
file_name
.exit
exit
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]... [FILE]...\\n\"
__printf_chk
stdout
dcgettext
\"Print the first 10 lines of each FILE to standard output.\\nWith more than one FILE, precede each with a header giving the file name.\\nWith no FILE, or when FILE is -, read standard input.\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"Mandatory arguments to long options are mandatory for short options too.\\n\"
fputs_unlocked
stdout
dcgettext
\"  -c, --bytes=[-]K         print the first K bytes of each file;\\n                             with the leading `-', print all but the last\\n                             K bytes of each file\\n  -n, --lines=[-]K         print the first K lines instead of the first 10;\\n                             with the leading `-', print all but the last\\n                             K lines of each file\\n\"
fputs_unlocked
stdout
dcgettext
\"  -q, --quiet, --silent    never print headers giving file names\\n  -v, --verbose            always print headers giving file names\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nK may have a multiplier suffix:\\nb 512, kB 1000, K 1024, MB 1000*1000, M 1024*1024,\\nGB 1000*1000*1000, G 1024*1024*1024, and so on for T, P, E, Z, Y.\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
xstrtol_fatal
exit_failure
STRING
STRING
\"%s%s argument `%s' too large\"
\"--\"
STRING
dcgettext
error
abort
offtostr
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
get_quoting_style
default_quoting_options
xrealloc
realloc
xalloc_die
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
set_custom_quoting
default_quoting_options
default_quoting_options
abort
xstrdup
strlen
xmemdup
set_char_quoting
default_quoting_options
.free
free
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
quotearg_n_style_mem
quotearg_n_options
._exit
exit
elide_tail_lines_seekable
lseek
safe_read
quote
dcgettext
\"error reading %s\"
__errno_location
error
offtostr
dcgettext
\"%s: cannot seek to offset %s\"
__errno_location
error
lseek
safe_read
memrchr
copy_fd
stdout
diagnose_copy_fd_failure
fwrite_unlocked
stdout
lseek
quote
__errno_location
error
STRING
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
close_stdout_set_file_name
file_name
quotearg_custom
quotearg_n_custom_mem
base_len
strlen
.isatty
isatty
quotearg_style
quotearg_n_style
quote
quotearg_n_style
.malloc
malloc
quotearg_style_mem
quotearg_n_style_mem
set_quoting_style
default_quoting_options
default_quoting_options
safe_read
read
__errno_location
.mbsinit
mbsinit
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
set_quoting_flags
default_quoting_options
xcalloc
calloc
xalloc_die
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
quotearg_char_mem
qword_208210
default_quoting_options
xmmword_2081F0
xmmword_208200
quotearg_n_options
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
malloc
xalloc_die
quotearg_char
quotearg_char_mem
quotearg_mem
quotearg_n_options
default_quoting_options
close_stream
__fpending
fclose
__errno_location
__errno_location
version_etc_ar
version_etc_arn
xzalloc
xmalloc
memset
quotearg_style
quotearg_n_style
.__cxa_atexit
_cxa_atexit
quotearg_n_custom_mem
default_quoting_options
qword_208210
xmmword_2081F0
xmmword_208200
abort
quotearg_n_options
version_etc_va
version_etc_arn
xmemdup
xmalloc
memcpy
quotearg_style_mem
quotearg_n_style_mem
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
base_len
strlen
.puts
puts
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
.fclose
fclose
.strlen
strlen
.ttyname
ttyname
set_quoting_style
default_quoting_options
default_quoting_options
version_etc
version_etc_arn
quotearg_char_mem
qword_2061D0
default_quoting_options
xmmword_2061B0
xmmword_2061C0
quotearg_n_options
.iswprint
iswprint
set_custom_quoting
default_quoting_options
default_quoting_options
abort
quote_n
quotearg_n_style
main
set_program_name
setlocale
\"Usage: %s [OPTION]...\\n\"
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
exit_failure
atexit
close_stdout
silent
silent
getopt_long
shortopts
longopts
usage
usage
version_etc
stdout
\"not a tty\"
unk_3985
STRING
STRING
exit
quote
optind
dcgettext
\"extra operand %s\"
error
optind
ttyname
dcgettext
\"not a tty\"
puts
silent
isatty
exit
quotearg
quotearg_n_options
default_quoting_options
get_quoting_style
default_quoting_options
x2realloc
xalloc_die
xrealloc
xrealloc
last_component
.strlen
strlen
quotearg_n_style_mem
quotearg_n_options
set_char_quoting
default_quoting_options
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]...\\n\"
__printf_chk
stdout
dcgettext
\"Print the file name of the terminal connected to standard input.\\n\\n  -s, --silent, --quiet   print nothing, only return an exit status\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
.closedir
closedir
set_quoting_flags
default_quoting_options
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_alloc
quotearg_alloc_mem
close_stdout_set_ignore_EPIPE
ignore_EPIPE
.fileno
fileno
xrealloc
realloc
xalloc_die
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
quotearg_n_style
quotearg_n_options
.malloc
malloc
xcalloc
calloc
xalloc_die
.__freading
_freading
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
quotearg_custom
quotearg_n_custom_mem
quotearg_char
quotearg_char_mem
.mbsinit
mbsinit
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
quotearg_colon
quotearg_char_mem
close_stream
__fpending
fclose
__errno_location
__errno_location
xmalloc
malloc
xalloc_die
.__fxstatat
_fxstatat
.fchdir
fchdir
.fflush
fflush
.iswprint
iswprint
xzalloc
xmalloc
memset
.fdopendir
fdopendir
quotearg_n_custom_mem
default_quoting_options
qword_2061D0
xmmword_2061B0
xmmword_2061C0
abort
quotearg_n_options
xstrdup
strlen
xmemdup
free
free
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]... FILE...\\n\"
__printf_chk
stdout
dcgettext
\"Remove (unlink) the FILE(s).\\n\\n  -f, --force           ignore nonexistent files, never prompt\\n  -i                    prompt before every removal\\n\"
fputs_unlocked
stdout
dcgettext
\"  -I                    prompt once before removing more than three files, or\\n                          when removing recursively.  Less intrusive than -i,\\n                          while still giving protection against most mistakes\\n      --interactive[=WHEN]  prompt according to WHEN: never, once (-I), or\\n                          always (-i).  Without WHEN, prompt always\\n\"
fputs_unlocked
stdout
dcgettext
\"      --one-file-system  when removing a hierarchy recursively, skip any\\n                          directory that is on a file system different from\\n                          that of the corresponding command line argument\\n\"
fputs_unlocked
stdout
dcgettext
\"      --no-preserve-root  do not treat `/' specially\\n      --preserve-root   do not remove `/' (default)\\n  -r, -R, --recursive   remove directories and their contents recursively\\n  -v, --verbose         explain what is being done\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nBy default, rm does not remove directories.  Use the --recursive (-r or -R)\\noption to remove each listed directory, too, along with all of its contents.\\n\"
fputs_unlocked
dcgettext
\"\\nTo remove a file whose name starts with a `-', for example `-foo',\\nuse one of these commands:\\n  %s -- -foo\\n\\n  %s ./-foo\\n\"
__printf_chk
stdout
dcgettext
\"\\nNote that if you use rm to remove a file, it is usually possible to recover\\nthe contents of that file.  If you want more assurance that the contents are\\ntruly unrecoverable, consider using shred.\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
excise
__errno_location
__fxstatat
quote
dcgettext
\"cannot remove %s\"
error
quote
dcgettext
\"removed directory: %s\\n\"
dcgettext
\"removed %s\\n\"
__printf_chk
unlinkat
xmemdup
xmalloc
memcpy
.group_member
group_member
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
STRING
STRING
program_name
program_invocation_name
__xargmatch_internal
argmatch
argmatch_invalid
argmatch_valid
argmatch_to_argument
memcmp
._exit
exit
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
.__fpending
_fpending
.isatty
isatty
base_len
strlen
.textdomain
textdomain
rpl_fseeko
fseeko
fileno
fseeko
lseek
fileno
lseek
.fclose
fclose
.opendir
opendir
AD_hash
.__lxstat
_lxstat
version_etc_va
version_etc_arn
.close
close
.dirfd
dirfd
cwd_advance_fd
abort
i_ring_push
close
close
fts_stat
__xstat
__errno_location
__lxstat
__errno_location
__fxstatat
argmatch_invalid
dcgettext
\"invalid argument %s for %s\"
dcgettext
\"ambiguous argument %s for %s\"
quote_n
quotearg_n_style
error
.rpmatch
rpmatch
.__xstat
_xstat
enter_dir.isra.11
malloc
hash_insert
free
cycle_check
hash_get_n_buckets_used
.readdir
readdir
.__fxstat
_fxstat
last_component
hash_get_max_bucket_length
hash_find_entry
abort
.__cxa_atexit
_cxa_atexit
.exit
exit
LCO_compare
hash_get_first
abort
hash_reset_tuning
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
i_ring_empty
hash_do_for_each
cache_fstatat.constprop.4
__errno_location
__fxstatat
__errno_location
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
i_ring_push
version_etc_ar
version_etc_arn
hash_clear
fts_sort
free
realloc
qsort
argmatch
strlen
strncmp
strlen
memcmp
opendir_safer
opendir
dirfd
dup_safer
fdopendir
__errno_location
close
closedir
version_etc
version_etc_arn
open_safer
open
fd_safer
fts_set
__errno_location
close_stdin_set_file_name
file_name
quote_n
quotearg_n_style
raw_hasher
argmatch_valid
dcgettext
\"Valid arguments are:\"
__fprintf_chk
__fprintf_chk
memcmp
__fprintf_chk
stderr
__overflow
stderr
stderr
stderr
set_custom_quoting
default_quoting_options
default_quoting_options
abort
close_stdout_set_ignore_EPIPE
ignore_EPIPE
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
close_stdout_set_file_name
file_name_0
check_tuning.isra.0
default_tuning
default_tuning
quotearg
quotearg_n_options
default_quoting_options
rpl_fflush
fflush
__freading
rpl_fseeko
fflush
set_char_quoting
default_quoting_options
hash_print_statistics
__fprintf_chk
__fprintf_chk
__fprintf_chk
__fprintf_chk
quotearg_n_style
quotearg_n_options
file_type
dcgettext
\"regular file\"
dcgettext
\"regular empty file\"
dcgettext
\"directory\"
dcgettext
\"block special file\"
dcgettext
\"character special file\"
dcgettext
\"fifo\"
dcgettext
\"symbolic link\"
dcgettext
\"socket\"
dcgettext
\"weird file\"
AD_compare
quotearg_alloc
quotearg_alloc_mem
hash_string
quotearg_n_custom_mem
default_quoting_options
qword_20E210
xmmword_20E1F0
xmmword_20E200
abort
quotearg_n_options
LCO_hash
quotearg_mem
quotearg_n_options
default_quoting_options
fts_alloc
malloc
memcpy
i_ring_init
fts_compare_ino
cycle_warning_required
fd_ring_clear
i_ring_empty
i_ring_pop
close
setup_dir.isra.4
hash_initialize
AD_hash
AD_compare
free
malloc
cycle_check_init
i_ring_pop
abort
quotearg_n_style_mem
quotearg_n_options
close_stream
__fpending
fclose
__errno_location
__errno_location
fts_palloc.isra.2
free
__errno_location
realloc
free
openat_safer
openat
fd_safer
leave_dir.isra.14
hash_delete
free
abort
quotearg_colon
quotearg_char_mem
rpl_fcntl
fcntl
rpl_fcntl
have_dupfd_cloexec_3202
fcntl
have_dupfd_cloexec_3202
__errno_location
rpl_fcntl
have_dupfd_cloexec_3202
have_dupfd_cloexec_3202
fcntl
__errno_location
close
fcntl
next_prime
quotearg_custom_mem
quotearg_n_custom_mem
hash_get_n_buckets
hash_lookup
abort
.mbsinit
mbsinit
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
hash_get_n_entries
can_write_any_file
can_write_2988
initialized_2987
geteuid
initialized_2987
can_write_2988
hash_get_next
abort
operand2sig
xstrdup
strchr
\"abcdefghijklmnopqrstuvwxyz\"
free
dcgettext
\"%s: invalid signal\"
error
str2sig
str2sig
free
__errno_location
strtol
sig2str
strip_trailing_slashes
last_component
base_len
xrealloc
realloc
xalloc_die
hash_table_ok
hash_initialize
raw_hasher
raw_comparator
malloc
check_tuning_isra_0
next_prime
calloc
free
