.strncmp
strncmp
.free
free
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
._exit
exit
.__fpending
_fpending
.strlen
strlen
.bindtextdomain
bindtextdomain
.textdomain
textdomain
.mbrtowc
mbrtowc
.fclose
fclose
.strrchr
strrchr
.readlink
readlink
.__lxstat
_lxstat
.getopt_long
getopt_long
.getcwd
getcwd
.memset
memset
.fputs_unlocked
fputs_unlocked
.printf
printf
.strcmp
strcmp
.ferror_unlocked
ferror_unlocked
.gettext
gettext
.fprintf
fprintf
.malloc
malloc
.__xstat
_xstat
.memcmp
memcmp
.strspn
strspn
.setlocale
setlocale
.__cxa_atexit
_cxa_atexit
.error
error
.memcpy
memcpy
.calloc
calloc
.fwrite
fwrite
.exit
exit
.memmove
memmove
.realloc
realloc
__cxa_finalize
__cxa_finalize
.mbsinit
mbsinit
.iswprint
iswprint
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
gettext
\"Usage: %s [OPTION]... FILE\\n\"
printf
stdout
gettext
\"Print value of a symbolic link or canonical file name\\n\\n\"
fputs_unlocked
stdout
gettext
\"  -f, --canonicalize            canonicalize by following every symlink in\\n                                every component of the given name recursively;\\n                                all but the last component must exist\\n  -e, --canonicalize-existing   canonicalize by following every symlink in\\n                                every component of the given name recursively,\\n                                all components must exist\\n\"
fputs_unlocked
stdout
gettext
\"  -m, --canonicalize-missing    canonicalize by following every symlink in\\n                                every component of the given name recursively,\\n                                without requirements on components existence\\n  -n, --no-newline              do not output the trailing newline\\n  -q, --quiet,\\n  -s, --silent                  suppress most error messages\\n  -v, --verbose                 report error messages\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
emit_ancillary_info
exit
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
hash_get_n_buckets
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
version_etc_ar
version_etc_arn
areadlink_with_size
malloc
malloc
readlink
__errno_location
free
__errno_location
__errno_location
free
__errno_location
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
emit_bug_reporting_address
gettext
\"\\nReport bugs to: %s\\n\"
printf
STRING
gettext
\"%s home page: <%s>\\n\"
printf
STRING
STRING
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
version_etc_va
version_etc_arn
hash_print_statistics
hash_get_n_entries
hash_get_n_buckets
hash_get_n_buckets_used
hash_get_max_bucket_length
fprintf
\"# entries:         %lu\\n\"
fprintf
\"# buckets:         %lu\\n\"
fprintf
\"# buckets used:    %lu (%.2f%%)\\n\"
fprintf
\"max bucket length: %lu\\n\"
base_len
strlen
last_component
seen_triple
hash_initialize
triple_hash
triple_compare_ino_str
triple_free
xalloc_die
seen_file
record_file
close_stdout_set_file_name
file_name
hash_clear
close_stdout_set_ignore_EPIPE
ignore_EPIPE
hash_get_n_buckets_used
hash_lookup
abort
rotr_sz
close_stdout
gettext
\"write error\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
off_7704
file_name
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
set_quoting_style
default_quoting_options
hash_get_n_entries
hash_get_max_bucket_length
hash_do_for_each
hash_get_first
abort
set_quoting_flags
default_quoting_options
hash_table_ok
hash_get_next
abort
next_prime
is_prime
hash_string
quoting_options_from_style
memset
hash_get_entries
raw_hasher
rotr_sz
is_prime
hash_initialize
raw_hasher
raw_comparator
malloc
default_tuning
free
check_tuning
compute_bucket_size
calloc
quotearg
quotearg_n
hash_reset_tuning
raw_comparator
quote_n
quotearg_n_style
check_tuning
default_tuning
default_tuning
quotearg_style
quotearg_n_style
quote
quote_n
quotearg_style_mem
quotearg_n_style_mem
allocate_entry
malloc
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
quotearg_colon_mem
quotearg_char_mem
get_quoting_style
default_quoting_options
compute_bucket_size
next_prime
quotearg_custom_mem
quotearg_n_custom_mem
hash_free
free
free
free
free
set_char_quoting
default_quoting_options
hash_find_entry
abort
free_entry
free_entry
free_entry
xnmalloc
xalloc_die
xmalloc
set_custom_quoting
default_quoting_options
abort
hash_rehash
compute_bucket_size
calloc
free
abort
transfer_entries
transfer_entries
free
transfer_entries
gettext_quote
gettext
L\"\\\"`'\"
xmalloc
malloc
xalloc_die
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
transfer_entries
abort
free_entry
abort
allocate_entry
quotearg_alloc
quotearg_alloc_mem
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
xcalloc
calloc
xalloc_die
quotearg_n
quotearg_n_options
default_quoting_options
triple_free
free
free
quotearg_n_mem
quotearg_n_options
default_quoting_options
quotearg_mem
quotearg_n_mem
xalloc_die
gettext
\"memory exhausted\"
error
exit_failure
\"%s\"
abort
quotearg_char_mem
default_quoting_options
qword_20A0A8
qword_20A0B0
qword_20A0B8
qword_20A0C0
qword_20A0C8
qword_20A0D0
set_char_quoting
quotearg_n_options
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
dir_len
last_component
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_20A028
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_20A028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_colon
quotearg_char
x2nrealloc
xalloc_die
xrealloc
lstat
__lxstat
quotearg_n_style
quoting_options_from_style
quotearg_n_options
seen_file
hash_lookup
quotearg_n_custom
quotearg_n_custom_mem
quotearg_char
quotearg_char_mem
._exit
exit
xstrdup
strlen
xmemdup
quotearg_custom
quotearg_n_custom
.bindtextdomain
bindtextdomain
triple_hash_no_name
.printf
printf
xgetcwd
getcwd
xalloc_die
__errno_location
.setgroups
setgroups
triple_compare
same_name
.getpwnam
getpwnam
.setlocale
setlocale
quotearg_n_custom_mem
default_quoting_options
qword_20A0A8
qword_20A0B0
qword_20A0B8
qword_20A0C0
qword_20A0C8
qword_20A0D0
set_custom_quoting
quotearg_n_options
xnrealloc
xalloc_die
xrealloc
.execvp
execvp
xzalloc
xmalloc
memset
same_name
last_component
last_component
base_len
base_len
memcmp
dir_name
dir_name
__errno_location
error
\"%s\"
stat
__errno_location
error
\"%s\"
stat
free
free
xcharalloc
xmalloc
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
.iswprint
iswprint
record_file
xmalloc
xstrdup
hash_insert
xalloc_die
triple_free
.getpwuid
getpwuid
atexit
__cxa_atexit
_dso_handle
xrealloc
realloc
xalloc_die
initialize_exit_failure
exit_failure
dir_name
mdir_name
xalloc_die
.strchr
strchr
x2realloc
x2nrealloc
stat
__xstat
.fputs_unlocked
fputs_unlocked
last_component
xmemdup
xmalloc
memcpy
.memcpy
memcpy
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
mdir_name
dir_len
malloc
memcpy
dword_0
realloc_groupbuf
realloc
__errno_location
.error
error
triple_hash
hash_pjw
.textdomain
textdomain
.__fpending
_fpending
set_quoting_style
default_quoting_options
triple_compare_ino_str
strcmp
.__cxa_atexit
_cxa_atexit
.strlen
strlen
.getopt_long
getopt_long
gettext_quote
gettext
L\"\\\"`'\"
hash_pjw
.setuid
setuid
.gettext
gettext
.__assert_fail
_assert_fail
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_208028
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
.ferror_unlocked
ferror_unlocked
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
.strrchr
strrchr
x2nrealloc
xalloc_die
xrealloc
.fprintf
fprintf
.free
free
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
.memcmp
memcmp
version_etc_va
version_etc_arn
.realloc
realloc
.textdomain
textdomain
get_quoting_style
default_quoting_options
.strcmp
strcmp
.strncmp
strncmp
.getgrouplist
getgrouplist
.malloc
malloc
.mbrtowc
mbrtowc
.mbsinit
mbsinit
.fclose
fclose
.memset
memset
.strtoul
strtoul
.strcmp
strcmp
.mbrtowc
mbrtowc
.fwrite
fwrite
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
.realloc
realloc
.memset
memset
quoting_options_from_style
memset
base_len
strlen
quotearg_n
quotearg_n_options
default_quoting_options
.calloc
calloc
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
.fwrite
fwrite
close_stdout_set_file_name
file_name
quotearg_mem
quotearg_n_mem
.getgroups
getgroups
xgetgroups
mgetgroups
xalloc_die
__errno_location
close_stdout_set_ignore_EPIPE
ignore_EPIPE
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
quotearg_style
quotearg_n_style
quote
quote_n
.setgid
setgid
quotearg_style_mem
quotearg_n_style_mem
.exit
exit
quotearg_char
quotearg_char_mem
__cxa_finalize
__cxa_finalize
set_char_quoting
default_quoting_options
quotearg_colon_mem
quotearg_char_mem
quotearg_alloc
quotearg_alloc_mem
close_stdout
gettext
\"write error\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
\"%s\"
file_name
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
quotearg_n_custom_mem
default_quoting_options
qword_2080E8
qword_2080F0
qword_2080F8
qword_208100
qword_208108
qword_208110
set_custom_quoting
quotearg_n_options
get_default_format
sprintf
STRING
\"%%.%dLf\"
STRING
equal_width
sprintf
STRING
\"%%0%d.%dLf\"
STRING
STRING
set_quoting_flags
default_quoting_options
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
program_name
program_name
gettext
\"Usage: %s [SHORT-OPTION]... USER COMMAND [ARGUMENT]...\\n  or:  %s LONG-OPTION\\n\"
printf
stdout
gettext
\"Drop any supplemental groups, assume the user-ID and group-ID of the specified\\nUSER (numeric ID or user name), and run COMMAND with any specified ARGUMENTs.\\nExit with status 111 if unable to assume the required user and group ID.\\nOtherwise, exit with the exit status of COMMAND.\\nThis program is useful only when run by root (user ID zero).\\n\\n\"
fputs_unlocked
stdout
gettext
\"  -g GID[,GID1...]  also set the primary group-ID to the numeric GID, and\\n                    (if specified) supplemental group IDs to GID1, ...\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
emit_ancillary_info
exit
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_208028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
xcharalloc
xmalloc
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
version_etc_va
version_etc_arn
quote_n
quotearg_n_style
xmalloc
malloc
xalloc_die
quotearg_n_mem
quotearg_n_options
default_quoting_options
getugroups
setgrent
__errno_location
getgrent
__errno_location
strcmp
__errno_location
__errno_location
endgrent
__errno_location
set_quoting_flags
default_quoting_options
xcalloc
calloc
xalloc_die
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
quotearg_n_style
quoting_options_from_style
quotearg_n_options
.fputs_unlocked
fputs_unlocked
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
bkm_scale_by_power
bkm_scale
.fprintf
fprintf
set_custom_quoting
default_quoting_options
abort
.nl_langinfo
nl_langinfo
quotearg_n
quotearg_n_options
default_quoting_options
quotearg_char_mem
default_quoting_options
qword_2080E8
qword_2080F0
qword_2080F8
qword_208100
qword_208108
qword_208110
set_char_quoting
quotearg_n_options
.__cxa_atexit
_cxa_atexit
quotearg_mem
quotearg_n_mem
emit_bug_reporting_address
gettext
\"\\nReport bugs to: %s\\n\"
printf
STRING
gettext
\"%s home page: <%s>\\n\"
printf
STRING
STRING
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
.mbsinit
mbsinit
quotearg_style
quotearg_n_style
atexit
__cxa_atexit
_dso_handle
.free
free
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
.strncmp
strncmp
xnmalloc
xalloc_die
xmalloc
quotearg_char_mem
default_quoting_options
qword_20D0E8
qword_20D0F0
qword_20D0F8
qword_20D100
qword_20D108
qword_20D110
set_char_quoting
quotearg_n_options
quotearg
quotearg_n
.strcpy
strcpy
x2realloc
x2nrealloc
print_numbers
printf
setlocale
\"C\"
rpl_asprintf
setlocale
byte_ACD7
xalloc_die
xalloc_die
rpl_asprintf
strcmp
free
xstrtold
c_strtold
free
fputs_unlocked
STRING
stdout
fputc_unlocked
stdout
xrealloc
realloc
xalloc_die
.bindtextdomain
bindtextdomain
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
xzalloc
xmalloc
memset
base_len
strlen
xstrdup
strlen
xmemdup
.strchr
strchr
quotearg_colon
quotearg_char
xstrdup
strlen
xmemdup
close_stdout_set_file_name
file_name
xsum4
xsum
xsum
xsum
.snprintf
snprintf
quotearg_n_custom
quotearg_n_custom_mem
quote
quote_n
.strcspn
strcspn
quotearg_custom
quotearg_n_custom
version_etc_ar
version_etc_arn
quotearg_custom_mem
quotearg_n_custom_mem
.calloc
calloc
get_quoting_style
default_quoting_options
rpl_isnanl
.memcpy
memcpy
.strchr
strchr
.error
error
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
.fputs_unlocked
fputs_unlocked
.strtold_l
strtold_l
xnrealloc
xalloc_die
xrealloc
to_uchar
xrealloc
realloc
xalloc_die
.memcpy
memcpy
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
.fopen
fopen
xmemdup
xmalloc
memcpy
.iswprint
iswprint
._exit
exit
set_char_quoting
default_quoting_options
.fclose
fclose
bkm_scale
.getopt_long
getopt_long
xalloc_die
gettext
\"memory exhausted\"
error
exit_failure
\"%s\"
abort
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_20D028
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
.newlocale
newlocale
wrap_write
gettext
\"write error\"
__errno_location
error
fwrite_unlocked
stdout
gettext
\"write error\"
__errno_location
error
fputs_unlocked
\"\\n\"
gettext
\"write error\"
__errno_location
error
fwrite_unlocked
stdout
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
quotearg_n_custom
quotearg_n_custom_mem
.__fpending
_fpending
scan_arg
gettext
\"invalid floating point argument: %s\"
error
usage
xstrtold
c_strtold
__ctype_b_loc
to_uchar
strlen
strchr
strcspn
\"eE\"
strchr
strchr
strtol
strcspn
\"xX\"
.strspn
strspn
quotearg_custom_mem
quotearg_n_custom_mem
.strlen
strlen
xnmalloc
xalloc_die
xmalloc
close_stdout_set_ignore_EPIPE
ignore_EPIPE
.ferror_unlocked
ferror_unlocked
base64_decode_ctx
decode_4
get_4
decode_4
.gettext
gettext
xnrealloc
xalloc_die
xrealloc
.strtol
strtol
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
.printf
printf
.sprintf
sprintf
x2nrealloc
xalloc_die
xrealloc
.strrchr
strrchr
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_208028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
__cxa_finalize
__cxa_finalize
.memcmp
memcmp
xsum
set_custom_quoting
default_quoting_options
abort
.fprintf
fprintf
.fputc_unlocked
fputc_unlocked
xmax
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
quotearg_alloc
quotearg_alloc_mem
.malloc
malloc
.malloc
malloc
decimal_point_char
nl_langinfo
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_20D028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
.setlocale
setlocale
.setlocale
setlocale
atexit
__cxa_atexit
_dso_handle
xalloc_die
gettext
\"memory exhausted\"
error
exit_failure
\"%s\"
abort
.exit
exit
.fwrite
fwrite
.strncmp
strncmp
xsum_0
last_component
.iswprint
iswprint
quote_n
quotearg_n_style
.__fpending
_fpending
.free
free
.fclose
fclose
._exit
exit
set_quoting_style
default_quoting_options
.getopt_long
getopt_long
.textdomain
textdomain
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
program_name
program_name
program_name
gettext
\"Usage: %s [-s SIGNAL | -SIGNAL] PID...\\n  or:  %s -l [SIGNAL]...\\n  or:  %s -t [SIGNAL]...\\n\"
printf
stdout
gettext
\"Send signals to processes, or list signals.\\n\\n\"
fputs_unlocked
stdout
gettext
\"Mandatory arguments to long options are mandatory for short options too.\\n\"
fputs_unlocked
stdout
gettext
\"  -s, --signal=SIGNAL, -SIGNAL\\n                   specify the name or number of the signal to be sent\\n  -l, --list       list signal names, or convert signal names to/from numbers\\n  -t, --table      print a table of signal information\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
gettext
\"\\nSIGNAL may be a signal name like `HUP', or a signal number like `1',\\nor the exit status of a process terminated by a signal.\\nPID is an integer; if negative it identifies a process group.\\n\"
fputs_unlocked
gettext
\"\\nNOTE: your shell may have its own version of %s, which usually supersedes\\nthe version described here.  Please refer to your shell's documentation\\nfor details about the options it supports.\\n\"
printf
STRING
emit_ancillary_info
exit
.memset
memset
.printf
printf
quoting_options_from_style
memset
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
program_name
program_name
program_name
gettext
\"Usage: %s [OPTION]... LAST\\n  or:  %s [OPTION]... FIRST LAST\\n  or:  %s [OPTION]... FIRST INCREMENT LAST\\n\"
printf
stdout
gettext
\"Print numbers from FIRST to LAST, in steps of INCREMENT.\\n\\n  -f, --format=FORMAT      use printf style floating-point FORMAT\\n  -s, --separator=STRING   use STRING to separate numbers (default: \\\\n)\\n  -w, --equal-width        equalize width by padding with leading zeroes\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
gettext
\"\\nIf FIRST or INCREMENT is omitted, it defaults to 1.  That is, an\\nomitted INCREMENT defaults to 1 even when LAST is smaller than FIRST.\\nFIRST, INCREMENT, and LAST are interpreted as floating point values.\\nINCREMENT is usually positive if FIRST is smaller than LAST, and\\nINCREMENT is usually negative if FIRST is greater than LAST.\\n\"
fputs_unlocked
stdout
gettext
\"FORMAT must be suitable for printing one argument of type `double';\\nit defaults to %.PRECf if FIRST, INCREMENT, and LAST are all fixed point\\ndecimal numbers with maximum precision PREC, and to %g otherwise.\\n\"
fputs_unlocked
emit_ancillary_info
exit
close_stdout_set_file_name
file_name
.fprintf
fprintf
.memchr
memchr
quotearg_n_mem
quotearg_n_options
default_quoting_options
version_etc_ar
version_etc_arn
set_quoting_style
default_quoting_options
quotearg
quotearg_n
.ferror_unlocked
ferror_unlocked
.setlocale
setlocale
quotearg_n_style
quoting_options_from_style
quotearg_n_options
.malloc
malloc
emit_bug_reporting_address
gettext
\"\\nReport bugs to: %s\\n\"
printf
STRING
gettext
\"%s home page: <%s>\\n\"
printf
STRING
STRING
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
set_custom_quoting
default_quoting_options
abort
.exit
exit
quotearg_style_mem
quotearg_n_style_mem
.memmove
memmove
.feof_unlocked
feof_unlocked
quotearg_colon
quotearg_char
c_strtold
c_locale
strtold_l
.strtoumax
strtoumax
.mbsinit
mbsinit
quotearg_n_custom_mem
default_quoting_options
qword_20D0E8
qword_20D0F0
qword_20D0F8
qword_20D100
qword_20D108
qword_20D110
set_custom_quoting
quotearg_n_options
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
xcharalloc
xmalloc
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
xmalloc
malloc
xalloc_die
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
close_stdout
gettext
\"write error\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
off_B198
file_name
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
to_uchar
xcalloc
calloc
xalloc_die
do_decode
base64_decode_ctx_init
fread_unlocked
memmove
isbase64
gettext
\"read error\"
__errno_location
error
ferror_unlocked
feof_unlocked
feof_unlocked
base64_decode_ctx
fwrite_unlocked
gettext
\"write error\"
__errno_location
error
gettext
\"invalid input\"
error
feof_unlocked
quotearg_custom_mem
quotearg_n_custom_mem
gettext_quote
gettext
L\"\\\"`'\"
xstrtold
__errno_location
__errno_location
base64_encode
to_uchar
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
to_uchar
to_uchar
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
to_uchar
to_uchar
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
to_uchar
str2sig
str2signum
base64_decode_alloc_ctx
malloc
free
base64_decode_ctx
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
xnrealloc
xalloc_die
xrealloc
set_program_name
fwrite
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
emit_bug_reporting_address
gettext
\"\\nReport bugs to: %s\\n\"
printf
STRING
gettext
\"%s home page: <%s>\\n\"
printf
STRING
STRING
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
.bindtextdomain
bindtextdomain
xrealloc
realloc
xalloc_die
bkm_scale
quotearg_char
quotearg_char_mem
bkm_scale_by_power
bkm_scale
.mbrtowc
mbrtowc
xstrdup
strlen
xmemdup
quotearg_colon_mem
quotearg_char_mem
.__assert_fail
_assert_fail
last_component
quotearg_custom
quotearg_n_custom
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
base_len
strlen
.strcmp
strcmp
quote
quote_n
.bindtextdomain
bindtextdomain
.realloc
realloc
.printf
printf
close_stdout_set_ignore_EPIPE
ignore_EPIPE
rpl_vasprintf
vasnprintf
free
__errno_location
.error
error
.close
close
.fwrite
fwrite
get_quoting_style
default_quoting_options
x2realloc
x2nrealloc
quote_n
quotearg_n_style
.ferror_unlocked
ferror_unlocked
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
xzalloc
xmalloc
memset
set_char_quoting
default_quoting_options
.obstack_free
obstack_free
set_quoting_style
default_quoting_options
xmemdup
xmalloc
memcpy
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
.wcwidth
wcwidth
set_quoting_flags
default_quoting_options
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
do_encode
fread_unlocked
feof_unlocked
ferror_unlocked
base64_encode
wrap_write
feof_unlocked
ferror_unlocked
gettext
\"write error\"
__errno_location
error
fputs_unlocked
\"\\n\"
gettext
\"read error\"
__errno_location
error
ferror_unlocked
quotearg_n
quotearg_n_options
default_quoting_options
.setvbuf
setvbuf
quoting_options_from_style
memset
is_infinite_or_zerol
rpl_isnanl
isbase64
b64
to_uchar
quotearg
quotearg_n
.__cxa_atexit
_cxa_atexit
quotearg_n_mem
quotearg_n_options
default_quoting_options
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
base64_decode_ctx_init
quotearg_mem
quotearg_n_mem
malloc
malloc
quotearg_n_style
quoting_options_from_style
quotearg_n_options
.fread_unlocked
fread_unlocked
quotearg_style
quotearg_n_style
is_basic
is_basic_table
.strlen
strlen
quotearg_style_mem
quotearg_n_style_mem
.gettext
gettext
quotearg_char
quotearg_char_mem
.strrchr
strrchr
quotearg_n_custom
quotearg_n_custom_mem
quotearg_custom_mem
quotearg_n_custom_mem
.memcmp
memcmp
get_4
memchr
.calloc
calloc
quotearg_char_mem
default_quoting_options
qword_2080C8
qword_2080D0
qword_2080D8
qword_2080E0
qword_2080E8
qword_2080F0
set_char_quoting
quotearg_n_options
.fwrite_unlocked
fwrite_unlocked
xnrealloc
xalloc_die
xrealloc
version_etc_ar
version_etc_arn
get_input_fstatus
xnmalloc
stat
fstat
strcmp
\"-\"
print_bytes
print_chars
print_words
print_lines
print_linelength
.__cxa_atexit
_cxa_atexit
xrealloc
realloc
xalloc_die
x2nrealloc
xalloc_die
xrealloc
__cxa_finalize
__cxa_finalize
xmemdup
xmalloc
memcpy
xalloc_die
gettext
\"memory exhausted\"
error
exit_failure
\"%s\"
abort
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
version_etc_va
version_etc_arn
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
close_stdout_set_file_name
file_name
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
gettext
\"Usage: %s [OPTION]... [FILE]\\nBase64 encode or decode FILE, or standard input, to standard output.\\n\\n\"
printf
stdout
gettext
\"  -w, --wrap=COLS       Wrap encoded lines after COLS character (default 76).\\n                        Use 0 to disable line wrapping.\\n\\n  -d, --decode          Decode data.\\n  -i, --ignore-garbage  When decoding, ignore non-alphabet characters.\\n\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
gettext
\"\\nWith no FILE, or when FILE is -, read standard input.\\n\"
fputs_unlocked
stdout
gettext
\"\\nThe data are encoded as described for the base64 alphabet in RFC 3548.\\nWhen decoding, the input may contain newlines in addition to the bytes of\\nthe formal base64 alphabet.  Use --ignore-garbage to attempt to recover\\nfrom any other non-alphabet bytes in the encoded stream.\\n\"
fputs_unlocked
emit_ancillary_info
exit
save_token
_obstack_newchunk
_obstack_newchunk
memcpy
.strncmp
strncmp
.__fpending
_fpending
close_stdout
gettext
\"write error\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
off_651E
file_name
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
.fclose
fclose
.strcpy
strcpy
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_209028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
base64_encode_alloc
malloc
base64_encode
.getopt_long
getopt_long
gettext_quote
gettext
L\"\\\"`'\"
.textdomain
textdomain
.strncmp
strncmp
.gettext
gettext
decode_4
isbase64
isbase64
b64
to_uchar
b64
to_uchar
isbase64
b64
to_uchar
b64
to_uchar
isbase64
b64
to_uchar
b64
to_uchar
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_208028
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
.strlen
strlen
.getpwuid
getpwuid
.printf
printf
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
.strcmp
strcmp
quotearg_colon
quotearg_char
.gettext
gettext
.memset
memset
.strtol
strtol
.memset
memset
.fputs_unlocked
fputs_unlocked
.kill
kill
.fprintf
fprintf
.calloc
calloc
set_custom_quoting
default_quoting_options
abort
.exit
exit
.error
error
quotearg_n_custom_mem
default_quoting_options
qword_2080C8
qword_2080D0
qword_2080D8
qword_2080E0
qword_2080E8
qword_2080F0
set_custom_quoting
quotearg_n_options
.strsignal
strsignal
quotearg_alloc
quotearg_alloc_mem
.iswprint
iswprint
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
xcharalloc
xmalloc
.error
error
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
x2realloc
x2nrealloc
.mbsinit
mbsinit
quotearg_colon_mem
quotearg_char_mem
quotearg_custom
quotearg_n_custom
xzalloc
xmalloc
memset
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
xstrdup
strlen
xmemdup
xnmalloc
xalloc_die
xmalloc
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
atexit
__cxa_atexit
_dso_handle
send_signals
__errno_location
strtoimax
gettext
\"%s: invalid process id\"
error
__errno_location
error
\"%s\"
kill
__errno_location
xmalloc
malloc
xalloc_die
.free
free
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
list_signals
strlen
sig2str
operand2sig
print_table_row
print_table_row
sig2str
operand2sig
printf
\"%d\\n\"
puts
puts
sig2str
.strtoimax
strtoimax
xcalloc
calloc
xalloc_die
version_etc_ar
version_etc_arn
._exit
exit
quoting_options_from_style
memset
last_component
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
.puts
puts
quotearg_n
quotearg_n_options
default_quoting_options
.memcpy
memcpy
.bindtextdomain
bindtextdomain
quotearg
quotearg_n
.realloc
realloc
.mbrtowc
mbrtowc
.sprintf
sprintf
version_etc_va
version_etc_arn
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
quotearg_n_style
quoting_options_from_style
quotearg_n_options
.strchr
strchr
__cxa_finalize
__cxa_finalize
.strrchr
strrchr
close_stdout
gettext
\"write error\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
\"%s\"
file_name
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
quotearg_char_mem
default_quoting_options
qword_2060C8
qword_2060D0
qword_2060D8
qword_2060E0
qword_2060E8
qword_2060F0
set_char_quoting
quotearg_n_options
quoting_options_from_style
memset
print_table_row
strsignal
STRING
printf
\"%*d %-*s %s\\n\"
.memcmp
memcmp
quotearg_alloc
quotearg_alloc_mem
quotearg_n
quotearg_n_options
default_quoting_options
x2nrealloc
xalloc_die
xrealloc
.ferror_unlocked
ferror_unlocked
quotearg_mem
quotearg_n_mem
xmemdup
xmalloc
memcpy
.__cxa_atexit
_cxa_atexit
quotearg_style
quotearg_n_style
.iswprint
iswprint
quotearg_style_mem
quotearg_n_style_mem
operand2sig
xstrdup
strchr
\"abcdefghijklmnopqrstuvwxyz\"
str2sig
str2sig
free
__errno_location
strtol
__errno_location
sig2str
gettext
\"%s: invalid signal\"
error
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_207028
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
emit_bug_reporting_address
gettext
\"\\nReport bugs to: %s\\n\"
printf
STRING
gettext
\"%s home page: <%s>\\n\"
printf
STRING
STRING
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
quotearg_char
quotearg_char_mem
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
base_len
strlen
quotearg
quotearg_n
.strncmp
strncmp
quotearg_colon_mem
quotearg_char_mem
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
set_char_quoting
default_quoting_options
._exit
exit
quotearg_n_style
quoting_options_from_style
quotearg_n_options
quotearg_n_custom
quotearg_n_custom_mem
.qsort
qsort
quotearg_custom
quotearg_n_custom
.opendir
opendir
emit_bug_reporting_address
gettext
\"\\nReport bugs to: %s\\n\"
printf
STRING
gettext
\"%s home page: <%s>\\n\"
printf
STRING
STRING
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
.strlen
strlen
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
.gettext
gettext
close_stdout_set_ignore_EPIPE
ignore_EPIPE
quotearg_char_mem
default_quoting_options
qword_207288
qword_207290
qword_207298
qword_2072A0
qword_2072A8
qword_2072B0
set_char_quoting
quotearg_n_options
quotearg_n_mem
quotearg_n_options
default_quoting_options
str2signum
numname_table
strcmp
numname_table
__libc_current_sigrtmin
__libc_current_sigrtmax
strtol
strtol
strncmp
\"RTMAX\"
strncmp
\"RTMIN\"
strtol
.__fxstatat
_fxstatat
get_quoting_style
default_quoting_options
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
sig2str
strcpy
numname_table
numname_table
__libc_current_sigrtmin
__libc_current_sigrtmax
sprintf
\"RTMAX\"
sprintf
\"RTMAX-%d\"
sprintf
\"RTMIN\"
sprintf
\"RTMIN+%d\"
xzalloc
xmalloc
memset
quotearg_colon
quotearg_char
set_quoting_flags
default_quoting_options
.closedir
closedir
xcharalloc
xmalloc
.calloc
calloc
quotearg_n_custom_mem
default_quoting_options
qword_207288
qword_207290
qword_207298
qword_2072A0
qword_2072A8
qword_2072B0
set_custom_quoting
quotearg_n_options
x2realloc
x2nrealloc
gettext_quote
gettext
L\"\\\"`'\"
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
.__xstat
_xstat
xcalloc
calloc
xalloc_die
xnmalloc
xalloc_die
xmalloc
.fchdir
fchdir
._obstack_begin
obstack_begin
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_207028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
atexit
__cxa_atexit
_dso_handle
.open
open
.memchr
memchr
x2nrealloc
xalloc_die
xrealloc
xmalloc
malloc
xalloc_die
._exit
exit
xalloc_die
gettext
\"memory exhausted\"
error
exit_failure
\"%s\"
abort
.calloc
calloc
.sprintf
sprintf
.ferror
ferror
.strncmp
strncmp
.iswprint
iswprint
.__fpending
_fpending
xmemdup
xmalloc
memcpy
.fclose
fclose
.textdomain
textdomain
.memcpy
memcpy
.strlen
strlen
.realloc
realloc
.getopt_long
getopt_long
.gettext
gettext
.error
error
.lseek
lseek
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
.mbsinit
mbsinit
.fgetc
fgetc
.strrchr
strrchr
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
.mbrtowc
mbrtowc
free
free
.fputs_unlocked
fputs_unlocked
to_uchar
.__assert_fail
_assert_fail
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
program_name
program_name
gettext
\"Usage: %s [OPTION]... [FILE]...\\n  or:  %s [OPTION]... --files0-from=F\\n\"
printf
stdout
gettext
\"Print newline, word, and byte counts for each FILE, and a total line if\\nmore than one FILE is specified.  With no FILE, or when FILE is -,\\nread standard input.\\n  -c, --bytes            print the byte counts\\n  -m, --chars            print the character counts\\n  -l, --lines            print the newline counts\\n\"
fputs_unlocked
stdout
gettext
\"      --files0-from=F    read input from the files specified by\\n                           NUL-terminated names in file F;\\n                           If F is - then read names from standard input\\n  -L, --max-line-length  print the length of the longest line\\n  -w, --words            print the word counts\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
emit_ancillary_info
exit
.memset
memset
.strcmp
strcmp
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
.__xstat
_xstat
.memcmp
memcmp
.read
read
.setlocale
setlocale
.fprintf
fprintf
.feof
feof
.putchar_unlocked
putchar_unlocked
.memmove
memmove
.fileno
fileno
._obstack_newchunk
obstack_newchunk
last_component
.sysconf
sysconf
argv_iter
feof
getdelim
.__fxstat
_fxstat
.open
open
setup_dir
hash_initialize
AD_hash
AD_compare
free
malloc
cycle_check_init
.iswprint
iswprint
.iswspace
iswspace
xalloc_die
gettext
\"memory exhausted\"
error
exit_failure
\"%s\"
abort
.exit
exit
__cxa_finalize
__cxa_finalize
.fopen
fopen
fts_set_stat_required
abort
.getdelim
getdelim
.fwrite
fwrite
last_component
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
diropen
openat_safer
open_safer
set_cloexec_flag
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
quote_n
quotearg_n_style
LCO_hash
wc_file
open
__errno_location
error
\"%s\"
wc
close
have_read_stdin
wc
strcmp
\"-\"
write_counts
\" %*s\"
umaxtostr
printf
\" %*s\"
number_width
STRING
print_lines
umaxtostr
printf
number_width
STRING
print_words
umaxtostr
printf
number_width
STRING
print_chars
umaxtostr
printf
number_width
STRING
print_bytes
umaxtostr
printf
number_width
print_linelength
printf
\" %s\"
putchar_unlocked
argv_iter_init_argv
malloc
quote
quote_n
LCO_compare
argv_iter_n_args
get_quoting_style
default_quoting_options
argv_iter_init_stream
malloc
compute_number_width
readtokens0_init
_obstack_begin
malloc
free
_obstack_begin
malloc
free
_obstack_begin
malloc
free
set_quoting_style
default_quoting_options
argv_iter_free
free
free
fts_children
__errno_location
__errno_location
fts_lfree
fts_build
diropen
unk_C869
fts_build
cwd_advance_fd
__errno_location
close
__errno_location
fchdir
close
emit_bug_reporting_address
gettext
\"\\nReport bugs to: %s\\n\"
printf
STRING
gettext
\"%s home page: <%s>\\n\"
printf
STRING
STRING
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
readtokens0_free
obstack_free
obstack_free
obstack_free
set_custom_quoting
default_quoting_options
abort
base_len
strlen
close_stdout_set_file_name
file_name
fts_safe_changedir
strcmp
off_C86B
close
i_ring_pop
i_ring_empty
diropen
strcmp
off_C86B
__errno_location
cwd_advance_fd
fchdir
fstat
__errno_location
close
__errno_location
version_etc_ar
version_etc_arn
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
close_stdout_set_ignore_EPIPE
ignore_EPIPE
physmem_total
sysconf
sysconf
raw_hasher
rotr_sz
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
safe_read
read
read
__errno_location
__errno_location
close_stdout
gettext
\"write error\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
off_7496
file_name
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
xnrealloc
xalloc_die
xrealloc
version_etc_va
version_etc_arn
set_char_quoting
default_quoting_options
compute_bucket_size
next_prime
set_quoting_flags
default_quoting_options
xcharalloc
xmalloc
physmem_available
sysconf
sysconf
physmem_total
free_entry
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
atexit
__cxa_atexit
_dso_handle
gettext_quote
gettext
L\"\\\"`'\"
quoting_options_from_style
memset
fstat
__fxstat
quotearg_n_mem
quotearg_n_options
default_quoting_options
quotearg_alloc
quotearg_alloc_mem
quotearg_n
quotearg_n_options
default_quoting_options
transfer_entries
abort
free_entry
abort
allocate_entry
._exit
exit
quotearg_mem
quotearg_n_mem
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_209028
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
quotearg
quotearg_n
set_char_quoting
default_quoting_options
.textdomain
textdomain
quotearg_style_mem
quotearg_n_style_mem
.getopt_long
getopt_long
quotearg_alloc
quotearg_alloc_mem
quotearg_colon
quotearg_char
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
.calloc
calloc
quotearg_n_style
quoting_options_from_style
quotearg_n_options
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_n_custom
quotearg_n_custom_mem
quotearg_char
quotearg_char_mem
quotearg_colon_mem
quotearg_char_mem
quotearg_style
quotearg_n_style
.setlocale
setlocale
quotearg_custom
quotearg_n_custom
quotearg_colon_mem
quotearg_char_mem
quotearg_custom
quotearg_n_custom
.mbsinit
mbsinit
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_char_mem
default_quoting_options
qword_209108
qword_209110
qword_209118
qword_209120
qword_209128
qword_209130
set_char_quoting
quotearg_n_options
get_root_dev_ino
lstat
\"/\"
xmalloc
malloc
xalloc_die
umaxtostr
quotearg_n_custom_mem
default_quoting_options
qword_209108
qword_209110
qword_209118
qword_209120
qword_209128
qword_209130
set_custom_quoting
quotearg_n_options
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
gettext
\"Usage: %s [OPTION]...\\n\"
printf
stdout
gettext
\"Print the user name associated with the current effective user ID.\\nSame as id -un.\\n\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
emit_ancillary_info
exit
x2realloc
x2nrealloc
xnmalloc
xalloc_die
xmalloc
xrealloc
realloc
xalloc_die
setfileconat
setfilecon
openat_proc_name
setfilecon
__errno_location
free
__errno_location
openat_save_fail
save_cwd
free_cwd
__errno_location
__errno_location
free_cwd
__errno_location
setfilecon
__errno_location
__errno_location
openat_restore_fail
restore_cwd
free_cwd
__errno_location
fchdir
__errno_location
quote_n
quotearg_n_style
xcalloc
calloc
xalloc_die
x2realloc
x2nrealloc
xzalloc
xmalloc
memset
x2nrealloc
xalloc_die
xrealloc
set_quoting_style
default_quoting_options
xstrdup
strlen
xmemdup
xmemdup
xmalloc
memcpy
stat
__xstat
xcalloc
calloc
xalloc_die
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
.fclose
fclose
set_custom_quoting
default_quoting_options
abort
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
cycle_warning_required
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
.mbrtowc
mbrtowc
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
.free
free
is_zero_or_power_of_two
.puts
puts
.fputs_unlocked
fputs_unlocked
.__fpending
_fpending
dup_safer
rpl_fcntl
.bindtextdomain
bindtextdomain
xnmalloc
xalloc_die
xmalloc
.malloc
malloc
.strlen
strlen
.strrchr
strrchr
xrealloc
realloc
xalloc_die
fd_safer
dup_safer
__errno_location
close
__errno_location
.__cxa_atexit
_cxa_atexit
.printf
printf
.ferror_unlocked
ferror_unlocked
restore_cwd
chdir_long
fchdir
version_etc_ar
version_etc_arn
.memcmp
memcmp
cdb_fchdir
fchdir
.memcpy
memcpy
.realloc
realloc
.exit
exit
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
__cxa_finalize
__cxa_finalize
.fwrite
fwrite
.chdir
chdir
.strrchr
strrchr
cdb_free
close
__assert_fail
\"! close_fail\"
\"chdir-long.c\"
\"cdb_free\"
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
.memcmp
memcmp
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
lstat
__lxstat
main
set_program_name
setlocale
shortopts
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
atexit
close_stdout
parse_long_options
STRING
STRING
STRING
usage
STRING
usage
getopt_long
shortopts
quote
optind
gettext
\"extra operand %s\"
error
usage
optind
geteuid
getpwuid
puts
exit
program_name
gettext
\"%s: cannot find name for user ID %lu\\n\"
fprintf
stderr
exit
close_stdout_set_file_name
file_name
.memcpy
memcpy
last_component
.free
free
set_quoting_flags
default_quoting_options
.realloc
realloc
close_stdout
gettext
\"write error\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
\"%s\"
file_name
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
.strcpy
strcpy
.error
error
base_len
strlen
.getc_unlocked
getc_unlocked
gettext_quote
gettext
L\"\\\"`'\"
quotearg_buffer
default_quoting_options
__errno_location
