._exit
exit
.textdomain
textdomain
.__fpending
_fpending
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
.free
free
.strlen
strlen
.mbsinit
mbsinit
.exit
exit
.malloc
malloc
.fclose
fclose
.iswprint
iswprint
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
version_etc_ar
version_etc_arn
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]... FILE\\n\"
__printf_chk
stdout
dcgettext
\"Print value of a symbolic link or canonical file name\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"  -f, --canonicalize            canonicalize by following every symlink in\\n                                every component of the given name recursively;\\n                                all but the last component must exist\\n  -e, --canonicalize-existing   canonicalize by following every symlink in\\n                                every component of the given name recursively,\\n                                all components must exist\\n\"
fputs_unlocked
stdout
dcgettext
\"  -m, --canonicalize-missing    canonicalize by following every symlink in\\n                                every component of the given name recursively,\\n                                without requirements on components existence\\n  -n, --no-newline              do not output the trailing newline\\n  -q, --quiet,\\n  -s, --silent                  suppress most error messages\\n  -v, --verbose                 report error messages\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
areadlink_with_size
malloc
readlink
free
__errno_location
free
malloc
__errno_location
version_etc_va
version_etc_arn
close_stdout_set_ignore_EPIPE
ignore_EPIPE
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
version_etc
version_etc_arn
close_stdout_set_file_name
file_name
base_len
strlen
last_component
raw_hasher
hash_find_entry
abort
hash_get_n_buckets
next_prime
hash_get_n_buckets_used
check_tuning.isra.0
default_tuning
default_tuning
hash_reset_tuning
hash_get_n_entries
hash_print_statistics
__fprintf_chk
__fprintf_chk
__fprintf_chk
__fprintf_chk
quote
quotearg_n_style
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
hash_get_max_bucket_length
hash_lookup
abort
get_quoting_style
default_quoting_options
hash_table_ok
hash_get_entries
hash_get_first
abort
set_char_quoting
default_quoting_options
hash_do_for_each
hash_get_next
abort
quote_n
quotearg_n_style
hash_string
set_custom_quoting
default_quoting_options
default_quoting_options
abort
hash_free
free
free
free
free
hash_clear
quotearg_alloc
quotearg_alloc_mem
hash_initialize
raw_hasher
raw_comparator
malloc
check_tuning_isra_0
next_prime
calloc
free
default_tuning
check_tuning_isra_0
quotearg
quotearg_n_options
default_quoting_options
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
set_quoting_style
default_quoting_options
default_quoting_options
quotearg_style
quotearg_n_style
quotearg_n_style
quotearg_n_options
quotearg_char
quotearg_char_mem
quotearg_style_mem
quotearg_n_style_mem
set_quoting_flags
default_quoting_options
quotearg_n_custom_mem
default_quoting_options
qword_2081D0
xmmword_2081B0
xmmword_2081C0
abort
quotearg_n_options
xmalloc
malloc
xalloc_die
quotearg_colon
quotearg_char_mem
quotearg_char_mem
qword_2081D0
default_quoting_options
xmmword_2081B0
xmmword_2081C0
quotearg_n_options
triple_hash_no_name
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
xstrdup
strlen
xmemdup
quotearg_custom
quotearg_n_custom_mem
xcalloc
calloc
xalloc_die
close_stream
__fpending
fclose
__errno_location
__errno_location
quotearg_mem
quotearg_n_options
default_quoting_options
triple_compare
same_name
quotearg_custom_mem
quotearg_n_custom_mem
xmemdup
xmalloc
memcpy
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
dir_name
mdir_name
xalloc_die
.malloc
malloc
xrealloc
realloc
xalloc_die
quotearg_n_style_mem
quotearg_n_options
.setuid
setuid
xzalloc
xmalloc
memset
seen_file
hash_lookup
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
triple_hash
hash_pjw
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
x2realloc
xalloc_die
xrealloc
xrealloc
same_name
last_component
last_component
base_len
dir_name
dir_name
__errno_location
error
\"%s: %s\"
__xstat
__errno_location
error
\"%s: %s\"
__xstat
free
free
base_len
memcmp
._exit
exit
triple_free
free
free
base_len
strlen
record_file
xmalloc
xstrdup
hash_insert
xalloc_die
triple_free
.fclose
fclose
hash_pjw
.getpwnam
getpwnam
.exit
exit
triple_compare_ino_str
strcmp
mdir_name
dir_len
malloc
memcpy
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [SHORT-OPTION]... USER COMMAND [ARGUMENT]...\\n  or:  %s LONG-OPTION\\n\"
__printf_chk
stdout
dcgettext
\"Drop any supplemental groups, assume the user-ID and group-ID of the specified\\nUSER (numeric ID or user name), and run COMMAND with any specified ARGUMENTs.\\nExit with status 111 if unable to assume the required user and group ID.\\nOtherwise, exit with the exit status of COMMAND.\\nThis program is useful only when run by root (user ID zero).\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"  -g GID[,GID1...]  also set the primary group-ID to the numeric GID, and\\n                    (if specified) supplemental group IDs to GID1, ...\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
dir_len
last_component
.__fpending
_fpending
close_stdout_set_file_name
file_name
quotearg_alloc
quotearg_alloc_mem
close_stdout_set_ignore_EPIPE
ignore_EPIPE
.free
free
.getpwuid
getpwuid
x2realloc
xalloc_die
xrealloc
xrealloc
quotearg_n_style
quotearg_n_options
quote_n
quotearg_n_style
.textdomain
textdomain
.mbsinit
mbsinit
.strlen
strlen
quotearg_n_custom_mem
default_quoting_options
qword_207210
xmmword_2071F0
xmmword_207200
abort
quotearg_n_options
quote
quotearg_n_style
close_stream
__fpending
fclose
__errno_location
__errno_location
.setgid
setgid
version_etc
version_etc_arn
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
.free
free
.iswprint
iswprint
.nl_langinfo
nl_langinfo
set_quoting_style
default_quoting_options
default_quoting_options
.__fpending
_fpending
set_custom_quoting
default_quoting_options
default_quoting_options
abort
.mbsinit
mbsinit
last_component
.fclose
fclose
set_quoting_flags
default_quoting_options
quotearg
quotearg_n_options
default_quoting_options
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
.close
close
get_quoting_style
default_quoting_options
.iconv_close
iconv_close
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
proper_name
dcgettext
mbsstr_trimmed_wordbounded
strlen
strlen
xmalloc
__sprintf_chk
quotearg_n_style_mem
quotearg_n_options
set_char_quoting
default_quoting_options
version_etc
version_etc_arn
quotearg_mem
quotearg_n_options
default_quoting_options
version_etc_ar
version_etc_arn
quotearg_custom
quotearg_n_custom_mem
close_stdout_set_ignore_EPIPE
ignore_EPIPE
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
quotearg_style
quotearg_n_style
xreadlink
areadlink
xalloc_die
__errno_location
xmalloc
malloc
xalloc_die
quotearg_char
quotearg_char_mem
dir_len
last_component
quotearg_style_mem
quotearg_n_style_mem
quotearg_colon
quotearg_char_mem
xmemdup
xmalloc
memcpy
last_component
get_quoting_style
default_quoting_options
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_char_mem
qword_207210
default_quoting_options
xmmword_2071F0
xmmword_207200
quotearg_n_options
.iswalnum
iswalnum
xrealloc
realloc
xalloc_die
mdir_name
dir_len
malloc
memcpy
set_char_quoting
default_quoting_options
xzalloc
xmalloc
memset
.exit
exit
xcalloc
calloc
xalloc_die
set_quoting_style
default_quoting_options
default_quoting_options
quotearg_alloc
quotearg_alloc_mem
xstrdup
strlen
xmemdup
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
version_etc_ar
version_etc_arn
set_quoting_flags
default_quoting_options
quotearg
quotearg_n_options
default_quoting_options
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
version_etc_va
version_etc_arn
quotearg_style
quotearg_n_style
quotearg_n_style
quotearg_n_options
close_stdout_set_file_name
file_name
quotearg_style_mem
quotearg_n_style_mem
.putenv
putenv
dir_name
mdir_name
xalloc_die
quotearg_colon
quotearg_char_mem
.iswspace
iswspace
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
quotearg_custom_mem
quotearg_n_custom_mem
.getenv
getenv
file_name_concat
mfile_name_concat
xalloc_die
._exit
exit
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
xmalloc
malloc
xalloc_die
quotearg_char_mem
qword_20F250
default_quoting_options
xmmword_20F230
xmmword_20F240
quotearg_n_options
quote_n
quotearg_n_style
.textdomain
textdomain
strnlen1
memchr
.strlen
strlen
xcalloc
calloc
xalloc_die
quote
quotearg_n_style
x2realloc
xalloc_die
xrealloc
xrealloc
.malloc
malloc
.strdup
strdup
.iswprint
iswprint
version_etc_va
version_etc_arn
close_stream
__fpending
fclose
__errno_location
__errno_location
base_len
strlen
areadlink
readlink
free
__errno_location
free
__errno_location
malloc
malloc
memcpy
realloc
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s OPTION... COMMAND\\n\"
__printf_chk
stdout
dcgettext
\"Run COMMAND, with modified buffering operations for its standard streams.\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"Mandatory arguments to long options are mandatory for short options too.\\n\"
fputs_unlocked
stdout
dcgettext
\"  -i, --input=MODE   Adjust standard input stream buffering\\n  -o, --output=MODE  Adjust standard output stream buffering\\n  -e, --error=MODE   Adjust standard error stream buffering\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nIf MODE is `L' the corresponding stream will be line buffered.\\nThis option is invalid with standard input.\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nIf MODE is `0' the corresponding stream will be unbuffered.\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nOtherwise MODE is a number which may be followed by one of the following:\\nKB 1000, K 1024, MB 1000*1000, M 1024*1024, and so on for G, T, P, E, Z, Y.\\nIn this case the corresponding stream will be fully buffered with the buffer\\nsize set to MODE bytes.\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nNOTE: If COMMAND adjusts the buffering of its standard streams (`tee' does\\nfor e.g.) then that will override corresponding settings changed by `stdbuf'.\\nAlso some filters (like `dd' and `cat' etc.) don't use streams for I/O,\\nand are thus unaffected by `stdbuf' settings.\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
mfile_name_concat
last_component
base_len
strlen
malloc
mempcpy
mempcpy
freea
mmalloca_results
mmalloca_results
free
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
quotearg_custom
quotearg_n_custom_mem
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
set_custom_quoting
default_quoting_options
default_quoting_options
abort
.strlen
strlen
.free
free
xrealloc
realloc
xalloc_die
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
quotearg_mem
quotearg_n_options
default_quoting_options
.iswprint
iswprint
._exit
exit
xzalloc
xmalloc
memset
quotearg_char
quotearg_char_mem
quotearg_n_style_mem
quotearg_n_options
base64_encode
b64str_2996
b64str_2996
b64str_2996
b64str_2996
b64str_2996
b64str_2996
.textdomain
textdomain
xmemdup
xmalloc
memcpy
rpl_vasprintf
vasnprintf
free
__errno_location
quotearg_n_custom_mem
default_quoting_options
qword_20F250
xmmword_20F230
xmmword_20F240
abort
quotearg_n_options
version_etc_va
version_etc_arn
.exit
exit
c_strcasecmp
close_stdout_set_file_name
file_name
knuth_morris_pratt_unibyte
strlen
mmalloca
freea
xstrdup
strlen
xmemdup
close_stdout_set_ignore_EPIPE
ignore_EPIPE
.malloc
malloc
mmalloca
malloc
mmalloca_results
mmalloca_results
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
quote
quotearg_n_style
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
str_iconv
iconv_open
str_cd_iconv
__errno_location
free
iconv_close
__errno_location
iconv_close
c_strcasecmp
strdup
__errno_location
get_quoting_style
default_quoting_options
isbase64
b64
base64_decode_ctx_init
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
base64_encode_alloc
malloc
base64_encode
.__fpending
_fpending
set_char_quoting
default_quoting_options
.fclose
fclose
mbslen
is_basic_table
__assert_fail
\"mbsinit (&iter->state)\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
mbsinit
__ctype_get_mb_cur_max
strnlen1
mbrtowc
strlen
__assert_fail
\"*iter->cur.ptr == '\\\\0'\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
__assert_fail
\"iter->cur.wc == 0\"
\"mbuiter.h\"
\"mbuiter_multi_next\"
mbsinit
__ctype_get_mb_cur_max
strlen
base64_decode_alloc_ctx
malloc
base64_decode_ctx
free
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
.mbsinit
mbsinit
quotearg_style
quotearg_n_style
version_etc_ar
version_etc_arn
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
set_quoting_style
default_quoting_options
default_quoting_options
set_quoting_flags
default_quoting_options
quotearg_char_mem
qword_2071F0
default_quoting_options
xmmword_2071D0
xmmword_2071E0
quotearg_n_options
base_len
strlen
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]... [FILE]\\nBase64 encode or decode FILE, or standard input, to standard output.\\n\\n\"
__printf_chk
stdout
dcgettext
\"  -w, --wrap=COLS       Wrap encoded lines after COLS character (default 76).\\n                        Use 0 to disable line wrapping.\\n\\n  -d, --decode          Decode data.\\n  -i, --ignore-garbage  When decoding, ignore non-alphabet characters.\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nWith no FILE, or when FILE is -, read standard input.\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nThe data are encoded as described for the base64 alphabet in RFC 3548.\\nWhen decoding, the input may contain newlines in addition to the bytes of\\nthe formal base64 alphabet.  Use --ignore-garbage to attempt to recover\\nfrom any other non-alphabet bytes in the encoded stream.\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
last_component
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmemdup
xmalloc
memcpy
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
version_etc
version_etc_arn
quotearg_mem
quotearg_n_options
default_quoting_options
quotearg_custom
quotearg_n_custom_mem
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
set_custom_quoting
default_quoting_options
default_quoting_options
abort
quote_n
quotearg_n_style
quotearg_n_style_mem
quotearg_n_options
.fileno
fileno
xrealloc
realloc
xalloc_die
quotearg_alloc
quotearg_alloc_mem
.__freading
_freading
quotearg_colon
quotearg_char_mem
xzalloc
xmalloc
memset
quotearg
quotearg_n_options
default_quoting_options
.mbsinit
mbsinit
quotearg_custom_mem
quotearg_n_custom_mem
close_stream
__fpending
fclose
__errno_location
__errno_location
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
record_file
xmalloc
xstrdup
hash_insert
xalloc_die
triple_free
quotearg_n_style
quotearg_n_options
x2realloc
xalloc_die
xrealloc
xrealloc
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
xmalloc
malloc
xalloc_die
triple_free
free
free
quotearg_style_mem
quotearg_n_style_mem
.free
free
triple_hash
hash_pjw
xcalloc
calloc
xalloc_die
quotearg_char
quotearg_char_mem
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
._exit
exit
triple_hash_no_name
close_stdin_set_file_name
file_name
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
.fclose
fclose
rpl_fflush
fflush
__freading
rpl_fseeko
fflush
.close
close
triple_compare_ino_str
strcmp
.__fpending
_fpending
.rpmatch
rpmatch
raw_hasher
quotearg_n_custom_mem
default_quoting_options
qword_2071F0
xmmword_2071D0
xmmword_2071E0
abort
quotearg_n_options
.opendir
opendir
.malloc
malloc
version_etc_va
version_etc_arn
check_tuning.isra.0
default_tuning
default_tuning
xstrdup
strlen
xmemdup
.closedir
closedir
.fdopendir
fdopendir
base_len
strlen
hash_get_n_buckets_used
.getenv
getenv
.fflush
fflush
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
.unlink
unlink
rpl_fseeko
fseeko
fileno
fseeko
lseek
fileno
lseek
.exit
exit
triple_compare
same_name
.textdomain
textdomain
hash_get_n_buckets
hash_table_ok
.strlen
strlen
.dirfd
dirfd
version_etc_ar
version_etc_arn
.readdir
readdir
.rename
rename
hash_get_max_bucket_length
.iswprint
iswprint
get_version
get_version_part_0
hash_get_entries
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]... [-T] TARGET LINK_NAME   (1st form)\\n  or:  %s [OPTION]... TARGET                  (2nd form)\\n  or:  %s [OPTION]... TARGET... DIRECTORY     (3rd form)\\n  or:  %s [OPTION]... -t DIRECTORY TARGET...  (4th form)\\n\"
__printf_chk
stdout
dcgettext
\"In the 1st form, create a link to TARGET with the name LINK_NAME.\\nIn the 2nd form, create a link to TARGET in the current directory.\\nIn the 3rd and 4th forms, create links to each TARGET in DIRECTORY.\\nCreate hard links by default, symbolic links with --symbolic.\\nWhen creating hard links, each TARGET must exist.  Symbolic links\\ncan hold arbitrary text; if later resolved, a relative link is\\ninterpreted in relation to its parent directory.\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"Mandatory arguments to long options are mandatory for short options too.\\n\"
fputs_unlocked
stdout
dcgettext
\"      --backup[=CONTROL]      make a backup of each existing destination file\\n  -b                          like --backup but does not accept an argument\\n  -d, -F, --directory         allow the superuser to attempt to hard link\\n                                directories (note: will probably fail due to\\n                                system restrictions, even for the superuser)\\n  -f, --force                 remove existing destination files\\n\"
fputs_unlocked
stdout
dcgettext
\"  -i, --interactive           prompt whether to remove destinations\\n  -L, --logical               make hard links to symbolic link references\\n  -n, --no-dereference        treat destination that is a symlink to a\\n                                directory as if it were a normal file\\n  -P, --physical              make hard links directly to symbolic links\\n  -s, --symbolic              make symbolic links instead of hard links\\n\"
fputs_unlocked
stdout
dcgettext
\"  -S, --suffix=SUFFIX         override the usual backup suffix\\n  -t, --target-directory=DIRECTORY  specify the DIRECTORY in which to create\\n                                the links\\n  -T, --no-target-directory   treat LINK_NAME as a normal file\\n  -v, --verbose               print name of each linked file\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nThe backup suffix is `~', unless set with --suffix or SIMPLE_BACKUP_SUFFIX.\\nThe version control method may be selected via the --backup option or through\\nthe VERSION_CONTROL environment variable.  Here are the values:\\n\\n\"
fputs_unlocked
dcgettext
\"Using -s ignores -L and -P.  Otherwise, the last option specified controls\\nbehavior when the source is a symbolic link, defaulting to %s.\\n\\n\"
__printf_chk
stdout
dcgettext
\"  none, off       never make backups (even if --backup is given)\\n  numbered, t     make numbered backups\\n  existing, nil   numbered if numbered backups exist, simple otherwise\\n  simple, never   always make simple backups\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
hash_get_first
abort
seen_file
hash_lookup
xget_version
get_version_part_0
getenv
\"VERSION_CONTROL\"
unk_8920
get_version_part_0
rpl_linkat
linkat
__errno_location
__errno_location
linkat
have_follow_really_4922
__errno_location
have_follow_really_4922
have_follow_really_4922
areadlinkat
mdir_name
free
free
mfile_name_concat
free
free
free
free
linkat
free
close_stdout_set_ignore_EPIPE
ignore_EPIPE
quotearg_mem
quotearg_n_options
default_quoting_options
hash_string
last_component
quotearg_style
quotearg_n_style
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
STRING
STRING
program_name
program_invocation_name
quotearg_style_mem
quotearg_n_style_mem
mfile_name_concat
last_component
base_len
strlen
malloc
mempcpy
mempcpy
hash_find_entry
abort
hash_initialize
raw_hasher
raw_comparator
malloc
check_tuning_isra_0
next_prime
calloc
free
default_tuning
check_tuning_isra_0
quotearg_char_mem
qword_20B230
default_quoting_options
xmmword_20B210
xmmword_20B220
quotearg_n_options
version_etc
version_etc_arn
hash_lookup
abort
hash_reset_tuning
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
malloc
xalloc_die
close_stdout_set_file_name
file_name_0
hash_do_for_each
opendir_safer
opendir
dirfd
dup_safer
fdopendir
__errno_location
close
closedir
quotearg_n_style_mem
quotearg_n_options
file_name_concat
mfile_name_concat
xalloc_die
yesno
__getdelim
stdin
rpmatch
free
quote_n
quotearg_n_style
quotearg_custom
quotearg_n_custom_mem
hash_clear
next_prime
quote
quotearg_n_style
quotearg_custom_mem
quotearg_n_custom_mem
argmatch_invalid
dcgettext
\"invalid argument %s for %s\"
dcgettext
\"ambiguous argument %s for %s\"
quote_n
quotearg_n_style
error
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
hash_get_n_entries
strip_trailing_slashes
last_component
base_len
argmatch_to_argument
memcmp
set_quoting_style
default_quoting_options
default_quoting_options
dup_safer
rpl_fcntl
xrealloc
realloc
xalloc_die
xzalloc
xmalloc
memset
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
hash_print_statistics
__fprintf_chk
__fprintf_chk
__fprintf_chk
__fprintf_chk
set_quoting_flags
default_quoting_options
.textdomain
textdomain
xcalloc
calloc
xalloc_die
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
hash_get_next
abort
set_custom_quoting
default_quoting_options
default_quoting_options
abort
.fgetc
fgetc
xmemdup
xmalloc
memcpy
same_name
last_component
last_component
base_len
dir_name
dir_name
__errno_location
error
\"%s: %s\"
__xstat
__errno_location
error
\"%s: %s\"
__xstat
free
free
base_len
memcmp
quotearg_alloc
quotearg_alloc_mem
.wcwidth
wcwidth
freadahead
hash_free
free
free
free
free
areadlinkat
readlinkat
__errno_location
free
free
__errno_location
malloc
malloc
memcpy
realloc
quotearg
quotearg_n_options
default_quoting_options
.exit
exit
__xargmatch_internal
argmatch
argmatch_invalid
argmatch_valid
malloc
malloc
dir_len
last_component
get_quoting_style
default_quoting_options
quotearg_n_style
quotearg_n_options
close_stream
__fpending
fclose
__errno_location
__errno_location
.feof
feof
write_counts
umaxtostr
__printf_chk
print_chars
print_words
print_words
print_lines
umaxtostr
__printf_chk
print_bytes
umaxtostr
__printf_chk
print_linelength
print_chars
umaxtostr
__printf_chk
print_bytes
print_linelength
umaxtostr
__printf_chk
__printf_chk
stdout
__overflow
stdout
stdout
stdout
set_char_quoting
default_quoting_options
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
.mbsinit
mbsinit
x2realloc
xalloc_die
xrealloc
xrealloc
argv_iter_free
free
free
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
._exit
exit
argv_iter_init_stream
malloc
xstrdup
strlen
xmemdup
quotearg_char
quotearg_char_mem
.ferror
ferror
quotearg_colon
quotearg_char_mem
.strlen
strlen
.fileno
fileno
.sysconf
sysconf
save_token
_obstack_newchunk
_obstack_newchunk
free
free
quotearg_n_custom_mem
default_quoting_options
qword_20B230
xmmword_20B210
xmmword_20B220
abort
quotearg_n_options
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
argmatch
strlen
strncmp
strlen
memcmp
close_stdout_set_file_name
file_name
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
close_stdout_set_ignore_EPIPE
ignore_EPIPE
dir_name
mdir_name
xalloc_die
hash_pjw
argv_iter_n_args
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
physmem_total
sysconf
sysconf
mdir_name
dir_len
malloc
memcpy
readtokens0_init
_obstack_begin
malloc
free
_obstack_begin
malloc
free
_obstack_begin
malloc
free
argmatch_valid
dcgettext
\"Valid arguments are:\"
__fprintf_chk
__fprintf_chk
memcmp
__fprintf_chk
stderr
__overflow
stderr
stderr
stderr
quote_n
quotearg_n_style
.__fpending
_fpending
set_quoting_style
default_quoting_options
default_quoting_options
version_etc_va
version_etc_arn
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
rpl_fcntl
fcntl
rpl_fcntl
have_dupfd_cloexec_3202
fcntl
have_dupfd_cloexec_3202
__errno_location
rpl_fcntl
have_dupfd_cloexec_3202
have_dupfd_cloexec_3202
fcntl
__errno_location
close
fcntl
.fclose
fclose
set_custom_quoting
default_quoting_options
default_quoting_options
abort
.close
close
base_len
strlen
argv_iter_init_argv
malloc
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
quotearg_mem
quotearg_n_options
default_quoting_options
.iswspace
iswspace
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
.iswprint
iswprint
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_n_style_mem
quotearg_n_options
argv_iter
feof
getdelim
xrealloc
realloc
xalloc_die
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
quotearg_colon
quotearg_char_mem
umaxtostr
readtokens0_free
obstack_free
obstack_free
obstack_free
xstrdup
strlen
xmemdup
quotearg_custom
quotearg_n_custom_mem
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]... [FILE]...\\n  or:  %s [OPTION]... --files0-from=F\\n\"
__printf_chk
stdout
dcgettext
\"Print newline, word, and byte counts for each FILE, and a total line if\\nmore than one FILE is specified.  With no FILE, or when FILE is -,\\nread standard input.\\n  -c, --bytes            print the byte counts\\n  -m, --chars            print the character counts\\n  -l, --lines            print the newline counts\\n\"
fputs_unlocked
stdout
dcgettext
\"      --files0-from=F    read input from the files specified by\\n                           NUL-terminated names in file F;\\n                           If F is - then read names from standard input\\n  -L, --max-line-length  print the length of the longest line\\n  -w, --words            print the word counts\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
xmemdup
xmalloc
memcpy
.free
free
version_etc_ar
version_etc_arn
safe_read
read
__errno_location
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
version_etc
version_etc_arn
._exit
exit
last_component
xzalloc
xmalloc
memset
.fclose
fclose
quote
quotearg_n_style
.__fpending
_fpending
get_quoting_style
default_quoting_options
close_stream
__fpending
fclose
__errno_location
__errno_location
.fileno
fileno
.strlen
strlen
physmem_available
sysconf
sysconf
physmem_total
.malloc
malloc
.mbsinit
mbsinit
.iswprint
iswprint
set_quoting_flags
default_quoting_options
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
set_char_quoting
default_quoting_options
version_etc_ar
version_etc_arn
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
version_etc_va
version_etc_arn
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
quotearg_alloc
quotearg_alloc_mem
version_etc
version_etc_arn
quotearg_style
quotearg_n_style
close_stdout_set_ignore_EPIPE
ignore_EPIPE
close_stdout_set_file_name
file_name
quotearg_style_mem
quotearg_n_style_mem
quotearg
quotearg_n_options
default_quoting_options
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
quotearg_char_mem
qword_208230
default_quoting_options
xmmword_208210
xmmword_208220
quotearg_n_options
fopen_safer
fopen
fileno
dup_safer
__errno_location
fclose
__errno_location
close
fclose
fdopen
quotearg_n_options
__errno_location
slotvec
abort
xrealloc
slotvec
slotvec0
xrealloc
slotvec
slotvec
slotvec
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xmalloc
quotearg_buffer_restyled
xmalloc
malloc
xalloc_die
set_custom_quoting
default_quoting_options
default_quoting_options
abort
quotearg_n_style
quotearg_n_options
quotearg_alloc
quotearg_alloc_mem
quotearg
quotearg_n_options
default_quoting_options
quotearg_char
quotearg_char_mem
x2realloc
xalloc_die
xrealloc
xrealloc
quotearg_n_custom_mem
default_quoting_options
qword_2061D0
xmmword_2061B0
xmmword_2061C0
abort
quotearg_n_options
quotearg_mem
quotearg_n_options
default_quoting_options
quotearg_n_custom_mem
default_quoting_options
qword_208230
xmmword_208210
xmmword_208220
abort
quotearg_n_options
quotearg_n_style
quotearg_n_options
.textdomain
textdomain
dup_safer
rpl_fcntl
xcalloc
calloc
xalloc_die
quotearg_char
quotearg_char_mem
.close
close
quotearg_n_style_mem
quotearg_n_options
quotearg_custom_mem
quotearg_n_custom_mem
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
rpl_fcntl
fcntl
rpl_fcntl
have_dupfd_cloexec_3202
fcntl
have_dupfd_cloexec_3202
__errno_location
rpl_fcntl
have_dupfd_cloexec_3202
have_dupfd_cloexec_3202
fcntl
__errno_location
close
fcntl
quotearg_colon
quotearg_char_mem
main
set_program_name
setlocale
\"Written by %s, %s, and %s.\\n\"
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
atexit
close_stdout
append
ignore_interrupts
getopt_long
\"ai\"
long_options
signal
dword_0
ignore_interrupts
tee_files
optind
optind
dcgettext
\"standard input\"
__errno_location
error
close
exit
usage
append
ignore_interrupts
version_etc
stdout
STRING
unk_3EF0
STRING
STRING
STRING
STRING
exit
usage
.exit
exit
xrealloc
realloc
xalloc_die
version_etc_va
version_etc_arn
quotearg_custom
quotearg_n_custom_mem
xcalloc
calloc
xalloc_die
close_stdout_set_ignore_EPIPE
ignore_EPIPE
last_component
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]... [FILE]...\\n\"
__printf_chk
stdout
dcgettext
\"Copy standard input to each FILE, and also to standard output.\\n\\n  -a, --append              append to the given FILEs, do not overwrite\\n  -i, --ignore-interrupts   ignore interrupt signals\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"\\nIf a FILE is -, copy again to standard output.\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
LCO_hash
xmalloc
malloc
xalloc_die
close_stream
__fpending
fclose
__errno_location
__errno_location
set_quoting_style
default_quoting_options
default_quoting_options
xzalloc
xmalloc
memset
base_len
strlen
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
xmemdup
xmalloc
memcpy
set_quoting_flags
default_quoting_options
.fclose
fclose
get_quoting_style
default_quoting_options
fts_sort
free
realloc
qsort
xstrdup
strlen
xmemdup
.chdir
chdir
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
set_char_quoting
default_quoting_options
check_tuning.isra.0
default_tuning
default_tuning
.opendir
opendir
.dirfd
dirfd
quotearg_style
quotearg_n_style
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xmalloc
quotearg_buffer_restyled
hash_print_statistics
__fprintf_chk
__fprintf_chk
__fprintf_chk
__fprintf_chk
.close
close
.fchdir
fchdir
quotearg_style_mem
quotearg_n_style_mem
.readdir
readdir
x2realloc
xalloc_die
xrealloc
xrealloc
.iswprint
iswprint
.fdopendir
fdopendir
hash_get_entries
quotearg_char_mem
qword_2061D0
default_quoting_options
xmmword_2061B0
xmmword_2061C0
quotearg_n_options
.mbsinit
mbsinit
i_ring_empty
usage
dcgettext
\"Try `%s --help' for more information.\\n\"
__fprintf_chk
dcgettext
\"Usage: %s [OPTION]... CONTEXT FILE...\\n  or:  %s [OPTION]... [-u USER] [-r ROLE] [-l RANGE] [-t TYPE] FILE...\\n  or:  %s [OPTION]... --reference=RFILE FILE...\\n\"
__printf_chk
stdout
dcgettext
\"Change the security context of each FILE to CONTEXT.\\nWith --reference, change the security context of each FILE to that of RFILE.\\n\\n  -h, --no-dereference   affect symbolic links instead of any referenced file\\n\"
fputs_unlocked
stdout
dcgettext
\"      --reference=RFILE  use RFILE's security context rather than specifying\\n                         a CONTEXT value\\n  -R, --recursive        operate on files and directories recursively\\n  -v, --verbose          output a diagnostic for every file processed\\n\"
fputs_unlocked
stdout
dcgettext
\"  -u, --user=USER        set user USER in the target security context\\n  -r, --role=ROLE        set role ROLE in the target security context\\n  -t, --type=TYPE        set type TYPE in the target security context\\n  -l, --range=RANGE      set range RANGE in the target security context\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"The following options modify how a hierarchy is traversed when the -R\\noption is also specified.  If more than one is specified, only the final\\none takes effect.\\n\\n  -H                     if a command line argument is a symbolic link\\n                         to a directory, traverse it\\n  -L                     traverse every symbolic link to a directory\\n                         encountered\\n  -P                     do not traverse any symbolic links (default)\\n\\n\"
fputs_unlocked
stdout
dcgettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
dcgettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
last_component
program_name
dcgettext
\"\\nReport %s bugs to %s\\n\"
__printf_chk
dcgettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
__printf_chk
stdout
dcgettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
dcgettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
__printf_chk
strncmp
\"en_\"
last_component
program_name
dcgettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
__printf_chk
exit
free
free
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
i_ring_push
._exit
exit
set_program_name
fwrite
STRING
stderr
abort
strrchr
_bss_start
STRING
STRING
program_name
program_invocation_name
.__fpending
_fpending
fts_compare_ino
version_etc_arn
__fprintf_chk
dcgettext
\"(C)\"
__fprintf_chk
dcgettext
\"\\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.\\nThis is free software: you are free to change and redistribute it.\\nThere is NO WARRANTY, to the extent permitted by law.\\n\\n\"
fputs_unlocked
abort
dcgettext
\"Written by %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\nand %s.\\n\"
dcgettext
\"Written by %s, %s, %s,\\n%s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, and %s.\\n\"
__fprintf_chk
dcgettext
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\nand %s.\\n\"
__fprintf_chk
\"Written by %s, %s, %s,\\n%s, %s, %s, %s,\\n%s, and %s.\\n\"
STRING
dcgettext
__fprintf_chk
.textdomain
textdomain
openat_safer
openat
fd_safer
last_component
.strlen
strlen
cwd_advance_fd
abort
i_ring_push
close
close
base_len
strlen
quote
quotearg_n_style
AD_compare
LCO_compare
.closedir
closedir
fts_set
__errno_location
.malloc
malloc
.exit
exit
fd_ring_clear
i_ring_empty
i_ring_pop
close
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
fts_alloc
malloc
memcpy
fts_palloc.isra.2
free
__errno_location
realloc
free
next_prime
version_etc_ar
version_etc_arn
set_custom_quoting
default_quoting_options
default_quoting_options
abort
setup_dir.isra.4
hash_initialize
AD_hash
AD_compare
free
malloc
cycle_check_init
quotearg
quotearg_n_options
default_quoting_options
enter_dir.isra.11
malloc
hash_insert
free
cycle_check
version_etc
version_etc_arn
hash_lookup
abort
close_stdout_set_file_name
file_name
leave_dir.isra.14
hash_delete
free
abort
hash_get_n_buckets
quotearg_n_style_mem
quotearg_n_options
AD_hash
hash_string
hash_get_n_buckets_used
hash_table_ok
quotearg_custom
quotearg_n_custom_mem
hash_get_n_entries
