._exit
exit
.free
free
.__fpending
_fpending
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
.puts
puts
.textdomain
textdomain
.gettext
gettext
.strlen
strlen
.fclose
fclose
.printf
printf
.ferror_unlocked
ferror_unlocked
.malloc
malloc
.exit
exit
.iswprint
iswprint
.mbsinit
mbsinit
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
.__cxa_atexit
_cxa_atexit
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
gettext
\"Usage: %s [OPTION]\\n\"
printf
stdout
gettext
\"Print the name of the current user.\\n\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
emit_ancillary_info
exit
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
base_len
strlen
last_component
quote_n
quotearg_n_style
main
set_program_name
setlocale
shortopts
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
atexit
close_stdout
parse_long_options
STRING
STRING
STRING
usage
STRING
usage
getopt_long
shortopts
quote
optind
gettext
\"extra operand %s\"
error
usage
optind
getlogin
puts
exit
gettext
\"no login name\"
error
exit
get_quoting_style
default_quoting_options
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
quote
quote_n
close_stdout
gettext
\"write error\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
\"%s\"
file_name
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
set_custom_quoting
default_quoting_options
abort
set_quoting_style
default_quoting_options
set_quoting_flags
default_quoting_options
gettext_quote
gettext
L\"\\\"`'\"
quoting_options_from_style
memset
set_char_quoting
default_quoting_options
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_206028
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
quotearg_alloc
quotearg_alloc_mem
quotearg_mem
quotearg_n_mem
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_style
quotearg_n_style
quotearg
quotearg_n
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_206028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_style_mem
quotearg_n_style_mem
quotearg_n_custom_mem
default_quoting_options
qword_2060C8
qword_2060D0
qword_2060D8
qword_2060E0
qword_2060E8
qword_2060F0
set_custom_quoting
quotearg_n_options
quotearg_n_style
quoting_options_from_style
quotearg_n_options
quotearg_char
quotearg_char_mem
.__fpending
_fpending
quotearg_colon
quotearg_char
xcalloc
calloc
xalloc_die
quotearg_custom
quotearg_n_custom
quotearg_char_mem
default_quoting_options
qword_2060C8
qword_2060D0
qword_2060D8
qword_2060E0
qword_2060E8
qword_2060F0
set_char_quoting
quotearg_n_options
.gettext
gettext
quotearg_custom_mem
quotearg_n_custom_mem
.rpmatch
rpmatch
xcharalloc
xmalloc
.fflush
fflush
xrealloc
realloc
xalloc_die
.mbsinit
mbsinit
xmalloc
malloc
xalloc_die
x2nrealloc
xalloc_die
xrealloc
version_etc_ar
version_etc_arn
xzalloc
xmalloc
memset
version_etc_va
version_etc_arn
xstrdup
strlen
xmemdup
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
xmemdup
xmalloc
memcpy
target_directory_operand
last_component
strlen
stat
lstat
dereference_dest_dir_symlinks
__errno_location
quote
gettext
\"accessing %s\"
error
quote
gettext
\"target %s is not a directory\"
error
.ferror_unlocked
ferror_unlocked
.getenv
getenv
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
.__xstat
_xstat
.free
free
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
._exit
exit
check_extension
last_component
base_len
__errno_location
pathconf
__errno_location
.fdopendir
fdopendir
.unlink
unlink
.strlen
strlen
.fclose
fclose
rpl_fflush
fflush
__freading
clear_ungetc_buffer_preserving_position
fflush
.iswprint
iswprint
.textdomain
textdomain
.close
close
.__lxstat
_lxstat
.opendir
opendir
rpl_fseeko
fileno
lseek
fseeko
.dirfd
dirfd
.printf
printf
.closedir
closedir
.fileno
fileno
.readdir
readdir
.malloc
malloc
.__freading
_freading
.rename
rename
hash_get_first
abort
.exit
exit
.__cxa_atexit
_cxa_atexit
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
hash_do_for_each
seen_file
hash_lookup
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
program_name
program_name
program_name
program_name
gettext
\"Usage: %s [OPTION]... [-T] TARGET LINK_NAME   (1st form)\\n  or:  %s [OPTION]... TARGET                  (2nd form)\\n  or:  %s [OPTION]... TARGET... DIRECTORY     (3rd form)\\n  or:  %s [OPTION]... -t DIRECTORY TARGET...  (4th form)\\n\"
printf
stdout
gettext
\"In the 1st form, create a link to TARGET with the name LINK_NAME.\\nIn the 2nd form, create a link to TARGET in the current directory.\\nIn the 3rd and 4th forms, create links to each TARGET in DIRECTORY.\\nCreate hard links by default, symbolic links with --symbolic.\\nWhen creating hard links, each TARGET must exist.  Symbolic links\\ncan hold arbitrary text; if later resolved, a relative link is\\ninterpreted in relation to its parent directory.\\n\\n\"
fputs_unlocked
stdout
gettext
\"Mandatory arguments to long options are mandatory for short options too.\\n\"
fputs_unlocked
stdout
gettext
\"      --backup[=CONTROL]      make a backup of each existing destination file\\n  -b                          like --backup but does not accept an argument\\n  -d, -F, --directory         allow the superuser to attempt to hard link\\n                                directories (note: will probably fail due to\\n                                system restrictions, even for the superuser)\\n  -f, --force                 remove existing destination files\\n\"
fputs_unlocked
stdout
gettext
\"  -i, --interactive           prompt whether to remove destinations\\n  -L, --logical               make hard links to symbolic link references\\n  -n, --no-dereference        treat destination that is a symlink to a\\n                                directory as if it were a normal file\\n  -P, --physical              make hard links directly to symbolic links\\n  -s, --symbolic              make symbolic links instead of hard links\\n\"
fputs_unlocked
stdout
gettext
\"  -S, --suffix=SUFFIX         override the usual backup suffix\\n  -t, --target-directory=DIRECTORY  specify the DIRECTORY in which to create\\n                                the links\\n  -T, --no-target-directory   treat LINK_NAME as a normal file\\n  -v, --verbose               print name of each linked file\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
gettext
\"\\nThe backup suffix is `~', unless set with --suffix or SIMPLE_BACKUP_SUFFIX.\\nThe version control method may be selected via the --backup option or through\\nthe VERSION_CONTROL environment variable.  Here are the values:\\n\\n\"
fputs_unlocked
gettext
\"Using -s ignores -L and -P.  Otherwise, the last option specified controls\\nbehavior when the source is a symbolic link, defaulting to %s.\\n\\n\"
printf
off_A004
stdout
gettext
\"  none, off       never make backups (even if --backup is given)\\n  numbered, t     make numbered backups\\n  existing, nil   numbered if numbered backups exist, simple otherwise\\n  simple, never   always make simple backups\\n\"
fputs_unlocked
emit_ancillary_info
exit
record_file
xmalloc
xstrdup
hash_insert
xalloc_die
triple_free
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
triple_hash
hash_pjw
hash_free
free
free
free
free
triple_free
free
free
triple_hash_no_name
get_version
backup_types
_xargmatch_internal
backup_args
backup_types
argmatch_die
triple_compare
same_name
triple_compare_ino_str
strcmp
last_component
version_etc_va
version_etc_arn
rpl_linkat
linkat
__errno_location
linkat
have_follow_really_4385
__errno_location
have_follow_really_4385
have_follow_really_4385
linkat_follow
file_name_concat
mfile_name_concat
xalloc_die
version_etc_ar
version_etc_arn
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
xget_version
get_version
getenv
\"VERSION_CONTROL\"
get_version
STRING
quote_n
quotearg_n_style
mfile_name_concat
last_component
base_len
longest_relative_suffix
strlen
malloc
mempcpy
mempcpy
quote
quote_n
base_len
strlen
find_backup_file_name
strlen
strlen
STRING
xmalloc
memcpy
numbered_backup
memcpy
STRING
check_extension
get_quoting_style
default_quoting_options
close_stdin
freadahead
stdin
rpl_fseeko
stdin
rpl_fflush
stdin
close_stream
stdin
gettext
\"error closing file\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
\"%s\"
file_name
close_stdout
_exit
exit_failure
hash_get_entries
close_stdout
gettext
\"write error\"
quotearg_colon
file_name_0
__errno_location
error
\"%s: %s\"
__errno_location
error
off_A6D1
file_name_0
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
clear_ungetc_buffer_preserving_position
rpl_fseeko
set_custom_quoting
default_quoting_options
abort
hash_get_max_bucket_length
hash_get_n_entries
hash_clear
longest_relative_suffix
hash_table_ok
hash_lookup
abort
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_20D038
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
hash_get_n_buckets
hash_get_next
abort
transfer_entries
abort
free_entry
abort
allocate_entry
is_prime
next_prime
is_prime
hash_get_n_buckets_used
__xargmatch_internal
argmatch
argmatch_invalid
argmatch_valid
set_char_quoting
default_quoting_options
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
compute_bucket_size
next_prime
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
hash_print_statistics
hash_get_n_entries
hash_get_n_buckets
hash_get_n_buckets_used
hash_get_max_bucket_length
fprintf
\"# entries:         %lu\\n\"
fprintf
\"# buckets:         %lu\\n\"
fprintf
\"# buckets used:    %lu (%.2f%%)\\n\"
fprintf
\"max bucket length: %lu\\n\"
hash_initialize
raw_hasher
raw_comparator
malloc
default_tuning
free
check_tuning
compute_bucket_size
calloc
hash_string
free_entry
quotearg_custom_mem
quotearg_n_custom_mem
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
raw_hasher
rotr_sz
.fclose
fclose
.ferror_unlocked
ferror_unlocked
strip_trailing_slashes
last_component
base_len
hash_rehash
compute_bucket_size
calloc
free
abort
transfer_entries
transfer_entries
free
transfer_entries
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
xmalloc
malloc
xalloc_die
hash_find_entry
abort
free_entry
free_entry
check_tuning
default_tuning
default_tuning
set_quoting_style
default_quoting_options
xzalloc
xmalloc
memset
paste_serial
strcmp
\"-\"
fopen
\"r\"
have_read_stdin
stdin
delims
getc_unlocked
__errno_location
getc_unlocked
xputchar
delims
delim_end
xputchar
__errno_location
xputchar
xputchar
error
\"%s\"
ferror_unlocked
clearerr_unlocked
__errno_location
error
\"%s\"
fclose
opendir_safer
opendir
dirfd
dup_safer
fdopendir
__errno_location
close
closedir
__errno_location
xmemdup
xmalloc
memcpy
set_quoting_flags
default_quoting_options
allocate_entry
malloc
gettext_quote
gettext
L\"\\\"`'\"
close_stdout
gettext
\"write error\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
\"%s\"
file_name
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
quotearg_alloc
quotearg_alloc_mem
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
linkat_follow
areadlinkat
free
mdir_name
free
free
__errno_location
mfile_name_concat
free
free
__errno_location
__errno_location
linkat
__errno_location
free
__errno_location
__errno_location
free
__errno_location
__errno_location
freadahead
quotearg_style
quotearg_n_style
argmatch_invalid
gettext
\"invalid argument %s for %s\"
gettext
\"ambiguous argument %s for %s\"
quote_n
quotearg_n_style
error
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_20D038
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
quoting_options_from_style
memset
quotearg_style_mem
quotearg_n_style_mem
argmatch_to_argument
memcmp
quotearg_char
quotearg_char_mem
quoting_options_from_style
memset
quotearg_mem
quotearg_n_mem
quotearg_char_mem
default_quoting_options
qword_20D108
qword_20D110
qword_20D118
qword_20D120
qword_20D128
qword_20D130
set_char_quoting
quotearg_n_options
dir_name
mdir_name
xalloc_die
quotearg_colon
quotearg_char
quotearg
quotearg_n
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
xnrealloc
xalloc_die
xrealloc
dup_safer
rpl_fcntl
quotearg_custom
quotearg_n_custom
quotearg_mem
quotearg_n_mem
quotearg_char_mem
default_quoting_options
qword_2070C8
qword_2070D0
qword_2070D8
qword_2070E0
qword_2070E8
qword_2070F0
set_char_quoting
quotearg_n_options
x2nrealloc
xalloc_die
xrealloc
xzalloc
xmalloc
memset
quotearg_n_style
quoting_options_from_style
quotearg_n_options
rpl_fcntl
fcntl
rpl_fcntl
fcntl
rpl_fcntl
have_dupfd_cloexec_2895
have_dupfd_cloexec_2895
__errno_location
have_dupfd_cloexec_2895
fcntl
__errno_location
close
__errno_location
fcntl
have_dupfd_cloexec_2895
yesno
getline
stdin
rpmatch
free
same_name
last_component
last_component
base_len
base_len
memcmp
dir_name
dir_name
__errno_location
error
\"%s\"
stat
__errno_location
error
\"%s\"
stat
free
free
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
hash_pjw
argmatch
strlen
strlen
memcmp
strncmp
.exit
exit
last_component
quotearg_n_custom_mem
default_quoting_options
qword_20D108
qword_20D110
qword_20D118
qword_20D120
qword_20D128
qword_20D130
set_custom_quoting
quotearg_n_options
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
mdir_name
dir_len
malloc
memcpy
dword_0
argmatch_valid
gettext
\"Valid arguments are:\"
fprintf
stderr
fprintf
stderr
\", `%s'\"
fprintf
stderr
\"\\n  - `%s'\"
memcmp
putc_unlocked
stderr
xcharalloc
xmalloc
dir_len
last_component
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
._exit
exit
do_decode
base64_decode_ctx_init
fread_unlocked
memmove
isbase64
gettext
\"read error\"
__errno_location
error
ferror_unlocked
feof_unlocked
feof_unlocked
base64_decode_ctx
fwrite_unlocked
gettext
\"write error\"
__errno_location
error
gettext
\"invalid input\"
error
feof_unlocked
lstat
__lxstat
.getc_unlocked
getc_unlocked
.free
free
set_char_quoting
default_quoting_options
xrealloc
realloc
xalloc_die
.strlen
strlen
.__fpending
_fpending
base64_decode_alloc_ctx
malloc
free
base64_decode_ctx
quotearg_alloc
quotearg_alloc_mem
xcalloc
calloc
xalloc_die
.putchar_unlocked
putchar_unlocked
.clearerr_unlocked
clearerr_unlocked
bkm_scale
xstrdup
strlen
xmemdup
.mbsinit
mbsinit
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_207028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
.gettext
gettext
base_len
strlen
bad_cast
.fileno
fileno
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
.gettext
gettext
.__cxa_atexit
_cxa_atexit
get_quoting_style
default_quoting_options
.mbsinit
mbsinit
set_custom_quoting
default_quoting_options
abort
areadlinkat
readlinkat
__errno_location
free
__errno_location
__errno_location
free
__errno_location
malloc
malloc
memcpy
realloc
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
collapse_escapes
xstrdup
delims
delim_end
stat
__xstat
quotearg
quotearg_n
main
STRING
set_program_name
setlocale
locale
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
atexit
close_stdout
have_read_stdin
serial_merge
getopt_long
\"d:s\"
longopts
bad_cast
\"-\"
optind
set_quoting_style
quotearg_colon
gettext
\"delimiter list ends with an unescaped backslash: %s\"
error
collapse_escapes
paste_parallel
optind
optind
paste_serial
optind
optind
serial_merge
free
delims
__errno_location
error
\"-\"
fclose
stdin
have_read_stdin
exit
usage
optarg
STRING
optarg
serial_merge
version_etc
stdout
STRING
STRING
STRING
STRING
STRING
exit
usage
base64_encode
to_uchar
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
to_uchar
to_uchar
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
to_uchar
to_uchar
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
to_uchar
base_len
strlen
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
quotearg_mem
quotearg_n_mem
.textdomain
textdomain
version_etc_ar
version_etc_arn
get_quoting_style
default_quoting_options
gettext_quote
gettext
L\"\\\"`'\"
.printf
printf
quotearg_n_style
quoting_options_from_style
quotearg_n_options
version_etc_va
version_etc_arn
set_quoting_flags
default_quoting_options
quote_n
quotearg_n_style
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
.malloc
malloc
quotearg_char_mem
default_quoting_options
qword_2080C8
qword_2080D0
qword_2080D8
qword_2080E0
qword_2080E8
qword_2080F0
set_char_quoting
quotearg_n_options
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
quotearg_custom_mem
quotearg_n_custom_mem
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
xcharalloc
xmalloc
xcalloc
calloc
xalloc_die
quotearg
quotearg_n
.exit
exit
.free
free
quoting_options_from_style
memset
xmalloc
malloc
xalloc_die
.iswprint
iswprint
._exit
exit
quotearg_n_style
quoting_options_from_style
quotearg_n_options
.__fpending
_fpending
quotearg_style
quotearg_n_style
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
.fclose
fclose
xrealloc
realloc
xalloc_die
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
quotearg_style_mem
quotearg_n_style_mem
quotearg_colon
quotearg_char
.__lxstat
_lxstat
xmemdup
xmalloc
memcpy
xputchar
putchar_unlocked
write_error
quotearg_colon
quotearg_char
.printf
printf
quotearg_custom_mem
quotearg_n_custom_mem
.free
free
.iswprint
iswprint
quotearg_custom
quotearg_n_custom
xcharalloc
xmalloc
.__fpending
_fpending
xmalloc
malloc
xalloc_die
.fclose
fclose
x2nrealloc
xalloc_die
xrealloc
.ferror_unlocked
ferror_unlocked
xstrdup
strlen
xmemdup
xrealloc
realloc
xalloc_die
._exit
exit
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
.textdomain
textdomain
xstrdup
strlen
xmemdup
.strlen
strlen
.malloc
malloc
.iswprint
iswprint
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
main
set_program_name
setlocale
locale
bindtextdomain
\"coreutils\"
\"/usr/local/share/locale\"
textdomain
\"coreutils\"
atexit
close_stdout
getopt_long
\"+pP\"
longopts
gettext
\"missing operand\"
error
usage
optind
validate_file_name
optind
optind
optind
exit
version_etc
stdout
STRING
STRING
STRING
STRING
STRING
STRING
exit
usage
usage
.strlen
strlen
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
gettext
\"Usage: %s [OPTION]... [FILE]...\\n\"
printf
stdout
gettext
\"Write lines consisting of the sequentially corresponding lines from\\neach FILE, separated by TABs, to standard output.\\nWith no FILE, or when FILE is -, read standard input.\\n\\n\"
fputs_unlocked
stdout
gettext
\"Mandatory arguments to long options are mandatory for short options too.\\n\"
fputs_unlocked
stdout
gettext
\"  -d, --delimiters=LIST   reuse characters from LIST instead of TABs\\n  -s, --serial            paste one file at a time instead of in parallel\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
emit_ancillary_info
exit
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
gettext
\"Usage: %s [OPTION]... [FILE]\\nBase64 encode or decode FILE, or standard input, to standard output.\\n\\n\"
printf
stdout
gettext
\"  -w, --wrap=COLS       Wrap encoded lines after COLS character (default 76).\\n                        Use 0 to disable line wrapping.\\n\\n  -d, --decode          Decode data.\\n  -i, --ignore-garbage  When decoding, ignore non-alphabet characters.\\n\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
gettext
\"\\nWith no FILE, or when FILE is -, read standard input.\\n\"
fputs_unlocked
stdout
gettext
\"\\nThe data are encoded as described for the base64 alphabet in RFC 3548.\\nWhen decoding, the input may contain newlines in addition to the bytes of\\nthe formal base64 alphabet.  Use --ignore-garbage to attempt to recover\\nfrom any other non-alphabet bytes in the encoded stream.\\n\"
fputs_unlocked
emit_ancillary_info
exit
do_encode
fread_unlocked
feof_unlocked
ferror_unlocked
base64_encode
wrap_write
feof_unlocked
ferror_unlocked
gettext
\"write error\"
__errno_location
error
fputs_unlocked
\"\\n\"
gettext
\"read error\"
__errno_location
error
ferror_unlocked
quotearg
quotearg_n
.malloc
malloc
version_etc_ar
version_etc_arn
base64_encode_alloc
malloc
base64_encode
quotearg_style_mem
quotearg_n_style_mem
.exit
exit
get_4
memchr
version_etc_va
version_etc_arn
quotearg_char
quotearg_char_mem
base64_decode_ctx
decode_4
get_4
decode_4
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
set_program_name
fwrite
\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/A NULL argv[0] was passed through an exec system call.\\n\"
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
component_len
set_quoting_style
default_quoting_options
bkm_scale_by_power
bkm_scale
quotearg_custom
quotearg_n_custom
last_component
last_component
set_custom_quoting
default_quoting_options
abort
close_stdout
gettext
\"write error\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
off_651E
file_name
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
xcharalloc
xmalloc
quote_n
quotearg_n_style
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_207028
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
set_char_quoting
default_quoting_options
xmalloc
malloc
xalloc_die
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
quote
quote_n
xzalloc
xmalloc
memset
quotearg_char
quotearg_char_mem
quotearg_style
quotearg_n_style
quotearg_alloc
quotearg_alloc_mem
quotearg_style_mem
quotearg_n_style_mem
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
quotearg_n_custom_mem
default_quoting_options
qword_2070C8
qword_2070D0
qword_2070D8
qword_2070E0
qword_2070E8
qword_2070F0
set_custom_quoting
quotearg_n_options
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
quotearg_char
quotearg_char_mem
.wctype
wctype
quotearg_custom
quotearg_n_custom
xcalloc
calloc
xalloc_die
.fileno
fileno
set_quoting_flags
default_quoting_options
.__fxstat
_fxstat
gettext_quote
gettext
L\"\\\"`'\"
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
.btowc
btowc
.printf
printf
x2nrealloc
xalloc_die
xrealloc
.strdup
strdup
.__cxa_atexit
_cxa_atexit
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_208028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
xmemdup
xmalloc
memcpy
.feof_unlocked
feof_unlocked
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
quotearg_mem
quotearg_n_mem
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
wrap_write
gettext
\"write error\"
__errno_location
error
fwrite_unlocked
stdout
gettext
\"write error\"
__errno_location
error
fputs_unlocked
\"\\n\"
gettext
\"write error\"
__errno_location
error
fwrite_unlocked
stdout
quotearg_style
quotearg_n_style
search_table
compare_words
portable_chars_only
strspn
\"/ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789._-\"
mbrlen
quote_n
quotearg_n_style_mem
gettext
\"nonportable character %s in file name %s\"
error
.textdomain
textdomain
isbase64
b64
to_uchar
quotearg_char_mem
default_quoting_options
qword_2070A8
qword_2070B0
qword_2070B8
qword_2070C0
qword_2070C8
qword_2070D0
set_char_quoting
quotearg_n_options
version_etc_va
version_etc_arn
output_one_tex_line
printf
\"\\\\%s \"
macro_name
putchar_unlocked
print_field
tail
qword_2297D8
fwrite_unlocked
off_23078
stdout
print_field
before
qword_2297F8
fwrite_unlocked
off_23078
stdout
keyafter
qword_229818
keyafter
rpl_re_match
unk_229288
keyafter
qword_229818
keyafter
matcher_error
qword_229818
word_fastmap
to_uchar
word_fastmap
to_uchar
keyafter
word_regex
print_field
fwrite_unlocked
off_23078
stdout
print_field
fwrite_unlocked
off_23078
stdout
print_field
head
qword_229838
putchar_unlocked
putchar_unlocked
print_field
STRING
qword_229858
putchar_unlocked
auto_reference
input_reference
putchar_unlocked
.gettext
gettext
xrealloc
realloc
xalloc_die
set_quoting_style
default_quoting_options
.__cxa_atexit
_cxa_atexit
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
proper_name
gettext
mbsstr_trimmed_wordbounded
strlen
strlen
xmalloc
sprintf
\"%s (%s)\"
set_custom_quoting
default_quoting_options
abort
decode_4
isbase64
isbase64
b64
to_uchar
b64
to_uchar
isbase64
b64
to_uchar
b64
to_uchar
isbase64
b64
to_uchar
b64
to_uchar
.close
close
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
is_basic_0
is_basic_table
quotearg_alloc
quotearg_alloc_mem
quote
quote_n
.malloc
malloc
no_leading_hyphen
strchr
quote
gettext
\"leading `-' in a component of file name %s\"
error
version_etc_ar
version_etc_arn
.exit
exit
set_quoting_style
default_quoting_options
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_207028
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
set_quoting_flags
default_quoting_options
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
argmatch
strlen
strlen
memcmp
strncmp
component_start
quotearg_n_style
quoting_options_from_style
quotearg_n_options
gettext_quote
gettext
L\"\\\"`'\"
swallow_file_in_memory
strcmp
\"-\"
fstat
open
__errno_location
error
\"%s\"
fstat
__errno_location
error
\"%s\"
xmalloc
read
__errno_location
error
\"%s\"
xmalloc
read
xrealloc
__errno_location
error
\"%s\"
__errno_location
error
\"%s\"
close
quotearg_colon
quotearg_char
version_etc_ar
version_etc_arn
freopen_safer
fileno
dup2
dup2
dup2
freopen
protect_fd
protect_fd
protect_fd
__errno_location
close
close
close
__errno_location
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_208028
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
quotearg_custom_mem
quotearg_n_custom_mem
base_len
strlen
gettext_quote
gettext
L\"\\\"`'\"
quotearg_n_custom_mem
default_quoting_options
qword_2080C8
qword_2080D0
qword_2080D8
qword_2080E0
qword_2080E8
qword_2080F0
set_custom_quoting
quotearg_n_options
xstr_cd_iconv
str_cd_iconv
xalloc_die
__errno_location
x2nrealloc
xalloc_die
xrealloc
close_stdout
gettext
\"write error\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
\"%s\"
file_name
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
argmatch_valid
gettext
\"Valid arguments are:\"
fprintf
stderr
fprintf
stderr
\", `%s'\"
fprintf
stderr
\"\\n  - `%s'\"
memcmp
putc_unlocked
stderr
xzalloc
xmalloc
memset
xstrdup
strlen
xmemdup
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
quoting_options_from_style
memset
last_component
.iswlower
iswlower
close_stream
__fpending
ferror_unlocked
fclose
__errno_location
__errno_location
quotearg_char
quotearg_char_mem
quote_n
quotearg_n_style
._exit
exit
.ferror_unlocked
ferror_unlocked
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_207028
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
quotearg_custom
quotearg_n_custom
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
.toupper
toupper
.mbsinit
mbsinit
xmemdup
xmalloc
memcpy
bitset_set
.fclose
fclose
set_char_quoting
default_quoting_options
.gettext
gettext
.init_proc
_gmon_start__
_gmon_start__
_gmon_start__
bitset_contain
.putchar_unlocked
putchar_unlocked
.__fpending
_fpending
.nl_langinfo
nl_langinfo
.textdomain
textdomain
.towupper
towupper
.printf
printf
.iswprint
iswprint
re_string_wchar_at
.iswalnum
iswalnum
.iswspace
iswspace
.__cxa_atexit
_cxa_atexit
compile_regex
folded_chars
ignore_case
strlen
rpl_re_compile_pattern
quote
gettext
\"%s (for regexp %s)\"
error
rpl_re_compile_fastmap
re_string_skip_chars
mbrtowc
initialize_regex
folded_chars
toupper
ignore_case
context_regex
context_regex
context_regex
STRING
context_regex
STRING
gnu_extensions
input_reference
context_regex
compile_regex
context_regex
context_regex
compile_regex
word_regex
word_regex
break_file
gnu_extensions
__ctype_b_loc
word_fastmap
word_fastmap
memset
word_fastmap
byte_229540
byte_229529
byte_22952A
gnu_extensions
break_file
quotearg_n_options
__errno_location
slotvec
abort
slotvec
slotvec0
slotvec
slotvec
slotvec0
xrealloc
slotvec
off_229058
slotvec0
memset
nslots
nslots
nslots
nslots
quotearg_buffer_restyled
free
slot0
xcharalloc
quotearg_buffer_restyled
__errno_location
compare_occurs
compare_words
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
gettext
\"Usage: %s [OPTION]... NAME...\\n\"
printf
stdout
gettext
\"Diagnose invalid or unportable file names.\\n\\n  -p                  check for most POSIX systems\\n  -P                  check for empty names and leading \\\"-\\\"\\n      --portability   check for all POSIX systems (equivalent to -p -P)\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
emit_ancillary_info
exit
re_string_destruct
free
free
free
digest_word_file
swallow_file_in_memory
xalloc_die
xrealloc
qsort
compare_words
digest_break_file
swallow_file_in_memory
memset
word_fastmap
word_fastmap
to_uchar
byte_229540
byte_229529
byte_22952A
gnu_extensions
free
re_string_realloc_buffers
realloc
realloc
realloc
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
build_upper_buffer
toupper
__ctype_b_loc
is_basic
is_basic_table
generate_all_output
tail
qword_2297D8
tail_truncation
head
qword_229838
head_truncation
occurs_table
number_of_occurs
number_of_occurs
define_all_fields
output_one_roff_line
output_one_dumb_line
output_one_tex_line
output_format
output_format
output_format
re_node_set_alloc
malloc
get_quoting_style
default_quoting_options
re_node_set_init_1
malloc
set_char_quoting
default_quoting_options
usage
program_name
gettext
\"Try `%s --help' for more information.\\n\"
fprintf
stderr
program_name
program_name
gettext
\"Usage: %s [OPTION]... [INPUT]...   (without -G)\\n  or:  %s -G [OPTION]... [INPUT [OUTPUT]]\\n\"
printf
stdout
gettext
\"Output a permuted index, including context, of the words in the input files.\\n\\n\"
fputs_unlocked
stdout
gettext
\"Mandatory arguments to long options are mandatory for short options too.\\n\"
fputs_unlocked
stdout
gettext
\"  -A, --auto-reference           output automatically generated references\\n  -G, --traditional              behave more like System V `ptx'\\n  -F, --flag-truncation=STRING   use STRING for flagging line truncations\\n\"
fputs_unlocked
stdout
gettext
\"  -M, --macro-name=STRING        macro name to use instead of `xx'\\n  -O, --format=roff              generate output as roff directives\\n  -R, --right-side-refs          put references at right, not counted in -w\\n  -S, --sentence-regexp=REGEXP   for end of lines or end of sentences\\n  -T, --format=tex               generate output as TeX directives\\n\"
fputs_unlocked
stdout
gettext
\"  -W, --word-regexp=REGEXP       use REGEXP to match each keyword\\n  -b, --break-file=FILE          word break characters in this FILE\\n  -f, --ignore-case              fold lower case to upper case for sorting\\n  -g, --gap-size=NUMBER          gap size in columns between output fields\\n  -i, --ignore-file=FILE         read ignore word list from FILE\\n  -o, --only-file=FILE           read only word list from this FILE\\n\"
fputs_unlocked
stdout
gettext
\"  -r, --references               first field of each line is a reference\\n  -t, --typeset-mode               - not implemented -\\n  -w, --width=NUMBER             output width in columns, reference excluded\\n\"
fputs_unlocked
stdout
gettext
\"      --help     display this help and exit\\n\"
fputs_unlocked
stdout
gettext
\"      --version  output version information and exit\\n\"
fputs_unlocked
stdout
gettext
\"\\nWith no FILE or if FILE is -, read Standard Input.  `-F /' by default.\\n\"
fputs_unlocked
emit_ancillary_info
exit
re_node_set_init_2
malloc
re_node_set_init_copy
malloc
memcpy
memset
proper_name_utf8
gettext
locale_charset
xstr_iconv
STRING
strlen
xmalloc
memcpy
memcpy
STRING
xstr_iconv
STRING
free
free
strchr
c_strcasecmp
STRING
free
free
free
free
strlen
strlen
xmalloc
sprintf
\"%s (%s)\"
free
free
mbsstr_trimmed_wordbounded
mbsstr_trimmed_wordbounded
mbsstr_trimmed_wordbounded
strcmp
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
re_node_set_compare
version_etc_va
version_etc_arn
re_node_set_remove_at
set_custom_quoting
default_quoting_options
abort
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
quotearg_alloc
quotearg_alloc_mem
argmatch_to_argument
memcmp
create_ci_newstate
calloc
free
free_state
register_state
re_node_set_init_copy
register_state
re_node_set_alloc
re_node_set_insert_last
realloc
free_workarea_compile
free
free
close_stdout
gettext
\"write error\"
quotearg_colon
file_name
__errno_location
error
\"%s: %s\"
__errno_location
error
\"%s\"
file_name
_exit
exit_failure
close_stream
stdout
ignore_EPIPE
__errno_location
close_stream
stderr
_exit
exit_failure
quotearg_n_custom_mem
default_quoting_options
qword_2070A8
qword_2070B0
qword_2070B8
qword_2070C0
qword_2070C8
qword_2070D0
set_custom_quoting
quotearg_n_options
quotearg_alloc_mem
default_quoting_options
__errno_location
quotearg_buffer_restyled
xcharalloc
quotearg_buffer_restyled
__errno_location
free_dfa_content
free_token
free
free
free
free
free
free
free
free
free_state
free
free
free
utf8_sb_map
free
free
quoting_options_from_style
memset
optimize_subexps
xcalloc
calloc
xalloc_die
search_duplicated_node
quotearg_custom_mem
quotearg_n_custom_mem
calc_first
re_dfa_add_node
quotearg
quotearg_n
lstat
__lxstat
bitset_clear
calc_eclosure
calc_eclosure_iter
free
duplicate_node
re_dfa_add_node
quotearg_mem
quotearg_n_mem
.getenv
getenv
quotearg_n_style
quoting_options_from_style
quotearg_n_options
bitset_empty
memset
parse
fetch_token
parse_reg_exp
create_tree
create_tree
.free
free
quotearg_style
quotearg_n_style
parse_branch
parse_expression
parse_expression
create_tree
bitset_merge
parse_sub_exp
fetch_token
parse_reg_exp
create_tree
.getc_unlocked
getc_unlocked
build_equiv_class
strlen
bitset_set
quotearg_char_mem
default_quoting_options
qword_229888
qword_229890
qword_229898
qword_2298A0
qword_2298A8
qword_2298B0
set_char_quoting
quotearg_n_options
re_string_allocate
re_string_construct_common
re_string_realloc_buffers
.strlen
strlen
fetch_number
fetch_token
bitset_set_all
memset
.ferror_unlocked
ferror_unlocked
.tolower
tolower
.iconv_close
iconv_close
bitset_mask
.towlower
towlower
.mbsinit
mbsinit
build_charclass_op
calloc
calloc
build_charclass
free
free_charset
bitset_set
bitset_not
bitset_mask
create_token_tree
free_charset
create_token_tree
create_tree
free
free_charset
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
re_string_peek_byte_case
duplicate_tree
create_token_tree
re_string_construct
memset
re_string_construct_common
re_string_realloc_buffers
re_string_translate_buffer
build_wcs_buffer
build_upper_buffer
build_wcs_upper_buffer
re_string_realloc_buffers
rpl_re_search_2
re_search_2_stub
compare_words
folded_chars
to_uchar
folded_chars
to_uchar
to_uchar
to_uchar
ignore_case
re_node_set_insert
re_node_set_init_1
realloc
check_halt_node_context
re_string_context_at
bitset_contain
iswalnum
rpl_re_set_registers
rpl_re_compile_pattern
rpl_re_syntax_options
re_compile_internal
rpl_re_syntax_options
gettext
\"Success\"
_re_error_msgid_idx
free_fail_stack_return
free
free
free
fix_output_parameters
reference_max_width
file_line_count
file_line_count
sprintf
\"%d\"
strlen
strlen
input_file_name
input_file_name
reference_max_width
reference_max_width
number_input_files
STRING
xmalloc
reference_max_width
auto_reference
line_width
reference_max_width
gap_size
auto_reference
input_reference
right_reference
half_line_width
line_width
before_max_width
line_width
gap_size
keyafter_max_width
line_width
truncation_string_length
strlen
STRING
STRING
STRING
STRING
before_max_width
truncation_string_length
before_max_width
before_max_width
keyafter_max_width
truncation_string_length
keyafter_max_width
truncation_string_length
gnu_extensions
edited_flag
__ctype_b_loc
byte_2296CC
byte_2296E2
STRING
edited_flag
to_uchar
edited_flag
diacrit_diac
output_format
output_format
output_format
re_node_set_insert_last
realloc
check_halt_state_context
re_string_context_at
check_halt_node_context
rpl_regcomp
malloc
strlen
re_compile_internal
free
rpl_re_compile_fastmap
update_regs
memcpy
memcpy
strnlen1
memchr
calc_state_hash
pop_fail_stack
__assert_fail
\"REG_VALID_INDEX (num)\"
\"regexec.c\"
\"pop_fail_stack\"
memcpy
free
free
preorder
xstr_iconv
str_iconv
xalloc_die
__errno_location
re_acquire_state_context
calc_state_hash
re_node_set_compare
create_cd_newstate
check_dst_limits_calc_pos_1
check_dst_limits_calc_pos_1
build_sifted_states
sift_states_iter_mb
check_node_accept
re_node_set_contains
check_dst_limits
re_node_set_insert
rpl_regerror
abort
gettext
\"Success\"
_re_error_msgid_idx
strlen
memcpy
argmatch_invalid
gettext
\"invalid argument %s for %s\"
gettext
\"ambiguous argument %s for %s\"
quote_n
quotearg_n_style
error
lower_subexp
create_tree
create_tree
create_tree
create_tree
check_arrival_expand_ecl
re_node_set_alloc
re_node_set_merge
check_arrival_expand_ecl_sub
free
find_subexp_node
free
check_dst_limits
search_cur_bkref_entry
search_cur_bkref_entry
check_dst_limits_calc_pos
check_dst_limits_calc_pos
__xargmatch_internal
argmatch
argmatch_invalid
argmatch_valid
init_dfa
memset
malloc
calloc
__ctype_get_mb_cur_max
nl_langinfo
strcasecmp
\"UTF-8\"
strcasecmp
\"UTF8\"
utf8_sb_map
calloc
btowc
base_len
strlen
extend_buffers
re_string_realloc_buffers
realloc
build_upper_buffer
build_wcs_upper_buffer
re_string_translate_buffer
build_wcs_buffer
peek_token_bracket
transit_state
transit_state_mb
build_trtable
re_string_context_at
protect_fd
open
\"/dev/null\"
close
__errno_location
calc_next
match_ctx_add_subtop
realloc
calloc
create_tree
create_token_tree
quote
quote_n
check_arrival_add_next_nodes
memset
check_node_accept_bytes
re_node_set_merge
re_node_set_insert
re_acquire_state
free
free
check_node_accept
re_node_set_insert
free
calc_inveclosure
memset
re_node_set_insert_last
get_quoting_style
default_quoting_options
mem_cd_iconv
iconv
iconv
__errno_location
__errno_location
iconv
malloc
__errno_location
iconv
iconv
__errno_location
iconv
abort
__errno_location
free
__errno_location
create_token_tree
malloc
set_quoting_style
default_quoting_options
parse_reg_exp
parse_branch
fetch_token
parse_branch
create_tree
match_ctx_clean
free
free
free
free
free
free
_start
_libc_start_main
main
_libc_csu_init
_libc_csu_fini
set_quoting_flags
default_quoting_options
parse_bracket_symbol
re_string_fetch_byte_case
prune_impossible_nodes
malloc
malloc
memset
sift_ctx_init
sift_states_backward
free
merge_state_array
free
check_halt_state_context
sift_ctx_init
sift_states_backward
free
free
free
free
xzalloc
xmalloc
memset
version_etc_ar
version_etc_arn
quotearg_free
slotvec
free
nslots
free
slotvec0
qword_100
off_229058
slot0
slot0
slotvec0
free
slotvec0
slotvec
slotvec0
slotvec0
nslots
rpl_regexec
strlen
re_search_internal
re_search_internal
bkm_scale
base_len
strlen
merge_state_array
re_node_set_init_union
re_acquire_state
free
quotearg_style_mem
quotearg_n_style_mem
mb_copy
memcpy
clone_quoting_options
__errno_location
default_quoting_options
xmemdup
__errno_location
re_search_2_stub
malloc
memcpy
memcpy
re_search_stub
re_search_stub
re_search_stub
free
quotearg_colon
quotearg_char
add_epsilon_src_nodes
re_acquire_state
re_node_set_alloc
re_node_set_merge
re_node_set_add_intersect
c_isascii
set_quoting_flags
default_quoting_options
quotearg_n_custom_mem
default_quoting_options
qword_229888
qword_229890
qword_229898
qword_2298A0
qword_2298A8
qword_2298B0
set_custom_quoting
quotearg_n_options
push_fail_stack
realloc
malloc
memcpy
re_node_set_init_copy
c_isalnum
check_dst_limits_calc_pos
check_dst_limits_calc_pos_1
quotearg_buffer
default_quoting_options
__errno_location
quotearg_buffer_restyled
__errno_location
re_string_char_size_at
c_isblank
clean_state_log_if_needed
extend_buffers
memset
quotearg_n_style_mem
quoting_options_from_style
quotearg_n_options
find_recover_state
merge_state_with_log
re_string_construct_common
c_iscntrl
update_cur_sifted_state
add_epsilon_src_nodes
check_subexp_limits
re_acquire_state
sift_states_bkref
quotearg_char_mem
default_quoting_options
qword_2060A8
qword_2060B0
qword_2060B8
qword_2060C0
qword_2060C8
qword_2060D0
set_char_quoting
quotearg_n_options
get_subexp_sub
check_arrival
match_ctx_add_entry
clean_state_log_if_needed
xrealloc
realloc
xalloc_die
c_islower
sift_states_iter_mb
check_node_accept_bytes
re_node_set_contains
re_string_fetch_byte_case
re_string_char_size_at
__libc_csu_init
_do_global_dtors_aux_fini_array_entry
_frame_dummy_init_array_entry
init_proc
_frame_dummy_init_array_entry
c_ispunct
check_node_accept
bitset_contain
re_string_context_at
check_subexp_matching_top
match_ctx_add_subtop
._exit
exit
c_toupper
re_node_set_contains
.fclose
fclose
is_basic_2
is_basic_table
match_ctx_add_sublast
realloc
calloc
find_subexp_node
.ferror_unlocked
ferror_unlocked
mbslen
strlen
__ctype_get_mb_cur_max
memset
mbuiter_multi_next_1
re_acquire_state
calc_state_hash
re_node_set_compare
create_ci_newstate
xstrdup
strlen
xmemdup
.mbsinit
mbsinit
check_arrival_expand_ecl_sub
re_node_set_contains
re_node_set_contains
re_node_set_insert
re_node_set_insert
check_arrival_expand_ecl_sub
.malloc
malloc
rpl_re_set_syntax
rpl_re_syntax_options
rpl_re_syntax_options
locale_charset
nl_langinfo
unk_24D6E
get_charset_aliases
strlen
strlen
strcmp
strlen
STRING
emit_ancillary_info
last_component
program_name
gettext
\"\\nReport %s bugs to %s\\n\"
printf
STRING
gettext
\"%s home page: <http://www.gnu.org/software/%s/>\\n\"
printf
STRING
\"coreutils\"
stdout
gettext
\"General help using GNU software: <http://www.gnu.org/gethelp/>\\n\"
fputs_unlocked
setlocale
last_component
program_name
gettext
\"Report %s translation bugs to <http://translationproject.org/team/>\\n\"
printf
strncmp
\"en_\"
last_component
program_name
gettext
\"For complete documentation, run: info coreutils '%s invocation'\\n\"
printf
__do_global_dtors_aux
_cxa_finalize
_dso_handle
__cxa_finalize
deregister_tm_clones
completed_7698
completed_7698
rpl_re_compile_fastmap
memset
re_compile_fastmap_iter
re_compile_fastmap_iter
re_compile_fastmap_iter
re_compile_fastmap_iter
match_ctx_init
malloc
malloc
set_program_name
fwrite
STRING
stderr
abort
strrchr
program_invocation_short_name
strncmp
\"lt-\"
strncmp
\"/.libs/\"
program_name
program_invocation_name
set_char_quoting
default_quoting_options
